{
  "Source": "tech.meituan.com",
  "Title": "美团AI全景图：吃喝玩乐背后的黑科技",
  "Link": "https://tech.meituan.com/2018/12/06/ai-in-meituan-csdn.html",
  "Content": "\u003cdiv class=\"post-content\"\u003e\u003cdiv class=\"content\"\u003e\u003cp\u003e很多人都会发现日常生活已经越来越离不开美团了，这个互联网平台涵盖了吃、住、行、游、购、娱……能帮我们做很多事情，非常接地气。黄色的美团外卖骑手，橙色的摩拜单车，还有美团和大众点评的Logo……会不时出现在各个角落，已经成为我们熟悉的城市风景线。\u003c/p\u003e\u003cp\u003e可这些与科技的关系，大家就不一定都那么清楚了。\u003c/p\u003e\u003cp\u003e我们注意到，美团点评的上市招股书中不仅多次提到科技，而且将科技放到了非常核心的位置：“我们相信科技将使人们的生活更加美好……我们用科技连接消费者和商家……通过先进的大数据和人工智能技术助力服务行业。”\u003c/p\u003e\u003cp\u003e美团创始人王兴本人也在今年公开演讲中特别强调：“到了互联网的下半场，我们要从用户需求驱动，转向用户需求和核心技术双轮驱动。”\u003c/p\u003e\u003cp\u003e根据公开信息，公司产品技术研发团队现在已经超过1万人，最近一个季度的研发投入同比翻番，达到20亿元。据我们所知，这两个数字在整个业界都是排在前列的。这么大规模的研发团队，都在做什么呢？AI又在其中发挥着怎样的作用呢？\u003c/p\u003e\u003cp\u003e近日，带着这个问题，CSDN走访了美团AI技术团队。\u003c/p\u003e\u003ch2 id=\"美团ai全图\"\u003e美团AI全图\u003c/h2\u003e\u003cp\u003e美团点评办公区位于朝阳区望京，具体包括几栋楼，连很多员工都搞不太清楚。从恒电大厦、科创大厦到旁边的奔驰大厦、施耐德大楼、锐创大厦，还有更远的数码港、太极大厦，都入驻了美团点评大大小小的工位、会议室，还有实验室。\u003c/p\u003e\u003cp\u003e“在美团做AI，有一个非常大的优势，就是数据和应用场景丰富，可以把各种各样的前沿技术用到实际产品中，改善亿万人的生活。要把几亿消费者与数百万生活服务商家高效地连接起来，AI有很多用武之地，因此比较大的业务部门中的技术团队，都有从事AI的同学。” 美团点评技术委员会算法通道主席何仁清，用下面的大图向我们介绍了整个公司AI应用的情况。\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://awps-assets.meituan.net/mit-x/blog-images-bundle-2018b/0ea2438a.png\" alt=\"美团AI全景图\"/\u003e\u003c/p\u003e\u003cp\u003e整体上，美团算法团队正在构建的AI相关技术囊括了语音、视觉、自然语言处理、机器学习、知识图谱等。以美团/大众点评App搜索、推荐为核心，面向外卖配送的策略、调度算法、定价系统，延伸到无人配送的自动驾驶、智能耳机里的语音识别、人脸识别，再到连接用户端的客服系统，连接商家端的金融体系、供应链系统也汇聚了美团点评正在构建的庞大知识图谱……\u003c/p\u003e\u003cp\u003e就拿大家最熟悉的美团外卖来说，看起来非常简单，和科技好像没什么关系。但是，美团外卖一天要完成约2000万订单，而且大多集中在几小时高峰时段，及时调度50多万骑手小哥按照最优路线工作，为了保证都市上班族都能及时吃上温热而不是冰冷的饭菜，还需要将配送时间控制在30分钟内……这可不是一件容易的事情。\u003c/p\u003e\u003cp\u003e事实上，为了完成这一高难度的技术任务，何仁清带领的美团配送算法团队开发了目前世界上超大规模、超高复杂度的多人多点实时智能配送调度系统。“\u003cstrong\u003e29亿次\u003c/strong\u003e”，这是美团智能调度系统高峰时每小时的路径计算次数。\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://awps-assets.meituan.net/mit-x/blog-images-bundle-2018b/8a87c8c8.png\" alt=\"\"/\u003e\u003c/p\u003e\u003ch2 id=\"做能落地的ai-对人才求贤若渴\"\u003e做能落地的AI，对人才求贤若渴\u003c/h2\u003e\u003cp\u003e美团独特的AI落地场景和挑战，对优秀人才也形成了独特的吸引力。从今年整体来看，美团吸引了不少AI高手的加入，他们要么是毕业于国内外知名学府，如清华北大、CMU、UCSD等，要么是来自Google、微软、腾讯、阿里、百度等互联网巨头公司。\u003c/p\u003e\u003cp\u003e目前，整个公司从事人工智能的算法工程师（含实习生）已经超过1000人，可是，这还远远不能满足需求。\u003c/p\u003e\u003cp\u003e为了吸引AI人才，美团首次联合主办AI Challenger全球挑战赛，两个主赛道的数据集和命题设置，一个是由无人配送团队负责的“无人驾驶视觉感知”，另一个则由美团点评AI平台部NLP中心负责的“细粒度用户评论情感分析”，后者也是本次挑战赛报名最火的赛道。历时3个多月的AI Challenger全球挑战赛也于近日落下了帷幕。\u003c/p\u003e\u003cp\u003e组建仅两年的无人配送部门，已发展到了百人以上，甚至给出了2018年扩张至200人规模的指标，其中大部分都是AI方向。如今，新年临近，足见人才招聘的压力。\u003c/p\u003e\u003cp\u003e而NLP中心今年2月正式组建，不过数月，团队已超40人，主要成员均来自阿里达摩院、MSRA、腾讯（微信）、百度NLP等业界知名的AI团队。随着明年来自清华、北大、中科院、上海交大等高校的优秀博士、硕士毕业生的加入，NLP中心的团队规模还将进一步扩大。\u003c/p\u003e\u003cp\u003e同样求贤若渴的还有何仁清的美团配送方向的策略和算法团队。他的团队从构成上主要分两类：一类是有着过硬运筹学背景的工科人才，还有一类是有过机器学习、定价系统方面经验丰富的计算机人才。\u003c/p\u003e\u003cp\u003e目前在美团，算法工程师已经在排在后台、前端之后，成为第三大技术群体，而且还在迅速扩张中。\u003c/p\u003e\u003ch2 id=\"探索ai未来之无人配送\"\u003e探索AI未来之无人配送\u003c/h2\u003e\u003cp\u003e美团的算法工程师面临着一个共同的问题：在复杂多变的真实场景下，如何在快速发展的业务中利用算法提升效率效益。除此之外，以无人配送为代表的新技术探索部门还承担了更多的工作：从零到一建立系统、数据、业务。\u003c/p\u003e\u003cp\u003e现在，无人配送开放平台已经完成了雄安新区、首都钢铁园、深圳联想大厦等多地的测试运营，印证了美团无人配送开放平台进行片区规模化运营的可行性。\u003c/p\u003e\u003cp\u003e今年7月，美团还发布了无人配送开放平台，希望集合政府、高校、企业三方力量一起实现这个伟大梦想，现已吸引了包括清华大学、加州伯克利大学、北京智能车联产业创新中心、华夏幸福、Segway等近20家国内外合作伙伴的加入。\u003c/p\u003e\u003cp\u003e“我们已经克服了很多在技术、运营，以及装备制造、生产加工等供应链上遇到的挑战，才走到了今天。”美团点评首席科学家、无人配送部总经理夏华夏提到。\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://awps-assets.meituan.net/mit-x/blog-images-bundle-2018b/f26e127b.png\" alt=\"左：可在城市道路低速自动驾驶的无人配送车；右：主要用于园区内送外卖的无人车\"/\u003e\u003c/p\u003e\u003cp\u003e无人驾驶技术的落地是世界难题，但美团配送末端物流“小轻慢物”的特点，则提供了一个很好的场景。从去年年底开始，原来担任美团外卖总架构师的夏华夏就开始全身心投入到无人配送这个项目上，在他看来，无人配送从技术上讲非常复杂，对各类人才的需求很大。不仅包括感知、定位、地图、规划控制等，也包括操作系统、嵌入式计算、嵌入式编程等偏内核的东西，同时还涉及硬件的集成，包括传感器、汽车底盘、车身的机械结构，也有大数据存储、云端仿真的系统。此外，在运营方面，还需要跟物业地产公司、各地政府完善无人驾驶方面的各种规章标准。\u003c/p\u003e\u003ch2 id=\"构建大规模的餐饮娱乐知识图谱-美团大脑\"\u003e构建大规模的餐饮娱乐知识图谱——美团大脑\u003c/h2\u003e\u003cp\u003e美团点评平台上汇聚了围绕生活服务方方面面的海量数据，比如商户信息、菜品信息、景点信息、用户评价等等。如何从这些数据中提炼出有价值的知识，从而进一步帮助人们提升生活便利性，助力餐饮娱乐产业升级呢？\u003c/p\u003e\u003cp\u003e今年5月，美团NLP中心开始构建大规模的餐饮娱乐知识图谱——美团大脑。美团点评作为中国最大的在线本地生活服务平台，连接了数亿用户和数百万商户，蕴含着丰富的日常生活相关知识。在建的美团大脑目前有23类概念、16亿实体、486亿三元组，对比Google的Knowledge Graph 700亿三元组和微软的Satori 500亿三元组，美团大脑的知识关联数量级可以说是世界级的了，未来一年预计会突破千亿规模。\u003c/p\u003e\u003cp\u003eNLP中心的核心带头人，是此前曾就职于Facebook、微软亚洲研究院的王仲远博士。作为美团大脑项目的负责人，他向我们介绍，美团大脑会充分挖掘关联各个场景数据，用AI技术让机器“阅读”用户评论，充分理解用户喜好，构建知识关联，从而形成一个“知识大脑”。相比于深度学习的“黑盒子”，知识图谱具有可解释性，在美团跨场景的多个业务中应用性非常强，目前已经在搜索、金融、商家运营等场景中验证了知识图谱的有效性。王仲远博士还谈到，深度学习和知识图谱技术近年来都有很大的发展，并且存在互相融合的趋势。在美团大脑的知识构建过程中，也会使用深度学习技术进行知识挖掘，从而用知识助力业务发展，实现智能化的本地生活服务，帮助每个用户“Eat Better，Live Better”，这也是美团点评的企业使命。\u003c/p\u003e\u003cp\u003e王仲远博士同时是大众点评搜索智能中心负责人。搜索是大众点评App上用户进行信息查找的最大入口，是连接用户和信息的重要纽带。用户搜索的方式非常多样，搜索场景也非常细分和丰富，并且对接业务种类多，流量差异大，为点评搜索带来了巨大挑战。而解决这些挑战的方法，需要升级NLP技术，进行深度查询理解以及深度评价分析，并依赖知识图谱技术和深度学习技术对搜索架构进行整体升级。\u003c/p\u003e\u003cp\u003e据王仲远博士介绍，在NLP中心以及点评搜索智能中心两个团队的紧密合作下，短短5个月，点评搜索核心KPI在已经较高的基础上又有大幅提升，是过去一年半涨幅的五倍之多，提前七个月就完成了全年的目标。\u003c/p\u003e\u003cp\u003e从大方向来看，知识图谱正成为图像、自然语言处理之后又一个新的值得关注的技术领域。2018年8月Gartner公布的关于AI技术成熟度曲线显示，知识图谱、自然语言生成、聊天机器人等技术将逐渐得到公众的关注。\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://awps-assets.meituan.net/mit-x/blog-images-bundle-2018b/29790ce2.png\" alt=\"\"/\u003e\u003c/p\u003e\u003cp\u003e除了搜索推荐外，美团大脑正在应用于SaaS收银系统专业版。从用户角度来说，美团大脑可以阅读每一条评论，充分理解用户对商家的感受；从商家角度来说，美团大脑能够归纳总结用户评价，从而发现商家在市场上的竞争优势/劣势、用户对于商家的总体印象趋势、商家菜品的受欢迎程度变化。另外，通过细粒度用户评论全方位分析，细致刻画商家服务现状，并对商家提供前瞻性经营方向。这些智能经营建议将通过美团SaaS收银系统专业版定期触达到各个商家，智能化指导商家精准优化经营模式。\u003c/p\u003e\u003cp\u003e美团大脑与美团金融平台也正在紧密合作，利用知识图谱中的社区发现、标签传播等方法来对用户进行风险管理，能够更准确的识别逾期客户，以及用户的不良行为，从而大大提升信用风险管理能力。在反欺诈场景中，知识图谱已经帮助金融团队在案件调查中发现团伙欺诈案件，还可在已有的反欺诈规则上进行推理预测。\u003c/p\u003e\u003cp\u003e与此同时，王仲远团队也正在构建国内领先的商业化分布式图引擎系统，支撑千亿级别知识图谱的实时图查询、图推理，根据不同业务定制化支持子图加速，加速大规模分布式图计算。\u003c/p\u003e\u003cp\u003e目前，王仲远负责的NLP中心隶属于基础研发平台的AI平台部，而该部门由美团CTO罗道锋兼任负责人，足见美团对AI的重视。基础研发平台还在负责构建整个公司统一的云计算、大数据和机器学习平台，其中包括GPU集群的构建。从实际情况来看，单纯的CPU已无法满足美团日益飙升的海量数据的运算处理。9月底，机器学习平台刚刚完成了数千块GPU集群的搭建。而美团的大数据平台也已经积累了总计几百PB的海量数据。\u003c/p\u003e\u003ch2 id=\"面向业务的ai平台\"\u003e面向业务的AI平台\u003c/h2\u003e\u003cp\u003e如果说基础研发平台的AI平台部奠基了美团公司研发AI技术的基础实力，那么美团首席科学家张锦懋领导的美团平台算法与数据研发部就承担了另一个重要角色：连接公司内各个业务场景对于AI技术的全方位需求。\u003c/p\u003e\u003cp\u003e在组织架构调整后，张锦懋的团队目前划归于由美团平台、点评平台、服务体验平台部等部门组成的用户平台。实际上，从2016年起，张锦懋的团队，从组织上来讲，越来越强调构建一种面向业务AI需要的平台能力。因此，他们几乎与公司内部所有的业务部门都打过交道：“除了做业务，也要有一个技术积累的团队。我们一方面有直接深入到业务线，响应业务线相关AI需求的项目团队，另一方面也有偏向底层基础能力的团队，（算法方面）如语音、图像、NLP、机器学习、用户画像等。”\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://awps-assets.meituan.net/mit-x/blog-images-bundle-2018b/605e3b9c.png\" alt=\"\"/\u003e\u003c/p\u003e\u003cp\u003e在张锦懋看来，如果美团想要形成一个在技术上有重要竞争力的平台，一定是以AI为主导，数据为基础，并做到行业最佳水平。除了配送、调度这种单点上的算法，实际上还需要一个不断迭代、演进的系统。这个系统同时也需要人和业务共同迭代，能够让业务人员与算法工程师配合起来，形成一个业务的闭环。接下来才可能突破一些关键技术点：因此，除去传统的机器学习、感知层的视觉、听觉等算法方面的工作，构建以海量数据为基础，可以在业务端持续迭代演进的系统也是这个团队的关键性工作。\u003c/p\u003e\u003ch2 id=\"ai未来-长期有耐心\"\u003eAI未来：长期有耐心\u003c/h2\u003e\u003cp\u003e在美团，大家最常说的两句话，一句是“以客户为中心”，一句是“长期有耐心”。虽然外界AI很火，但美团技术团队对AI这件事有自己比较清醒的认识。\u003c/p\u003e\u003cp\u003e公司的业务团队离客户更近，之前其实对AI的态度并没有特别积极，因为落地确实有很多难点，而技术团队也做好了长期死磕的准备。以智能调度系统来说，虽然已经成为一种行业趋势，但何仁清还是更多看到了困难：“在推行智能化系统方面，整个公司的决心是比较大的。但是这个事情落地时候还会遇到很多问题需要解决，特别是线下的一些阻力、企业客户需要适应、利益上的变动等。”\u003c/p\u003e\u003cp\u003e目前，包括阿里菜鸟、京东都在试图用无人驾驶技术解决物流上的问题。相比载人车辆来讲，美团无人配送虽有着落地的优越性，但也有无人驾驶技术的复杂性，匀速20公里/时的无人配送车，在国内人流密集的大城市内行驶仍具有很高挑战性。谈及对无人配送部门未来的规划和期待时，夏华夏很冷静：“我们的预期是有的，但也没有非常严格的Deadline。希望在三五年内首先达到在无人配送场景上的落地。”\u003c/p\u003e\u003cp\u003e随着技术能力的不断增强，张锦懋明显感觉到今年的业务合作关系、信任度相比此前，发生了很大的改变，大家都对新技术更加重视了。当然，AI应用于美团这么复杂的场景，仍然任重道远。“如果没有一个好的平台、好的系统，这个工作的挑战是非常巨大的。现在我们还处于刚刚起步的状态。” 张锦懋在采访最后这样表示。\u003c/p\u003e\u003cp\u003e正如美团点评CTO罗道锋在今年AI Challenger大赛启动仪式上所分享的：\u003c/p\u003e\u003cp\u003e“我们对AI的投入很坚决，希望依靠技术提升我们的业务，服务更多消费者和商户。不过也要看到，AI现在虽然已经进入开花阶段，但还在早期。我们目前拥有更大量的数据、更强的算力，做的是超高维空间的拟合，现在应用的AI技术还是弱人工智能，我们离强人工智能还有很远的距离，解决真实问题仍然面临不少艰巨的挑战，这是一件需要长期有耐心的事情。”\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e文章转载自AI科技大本营，特别感谢杨丽、谷磊两位记者，特别感谢CSDN对美团的报道。\u003c/p\u003e\u003c/blockquote\u003e\u003c/div\u003e\u003c/div\u003e",
  "Date": "2018-12-06T00:00:00Z",
  "Author": "soulteary@gmail.com"
}