{
  "Source": "tech.meituan.com",
  "Title": "KDD Cup 2020 AutoGraph比赛冠军技术方案及在美团的实践",
  "Link": "https://tech.meituan.com/2020/08/27/kdd-cup-autograph-practice.html",
  "Content": "\u003cdiv class=\"post-content\"\u003e\u003cdiv class=\"content\"\u003e\u003ch2 id=\"背景\"\u003e背景\u003c/h2\u003e\u003cp\u003eACM SIGKDD （国际数据挖掘与知识发现大会，简称 KDD）是数据挖掘领域的国际顶级会议。KDD Cup比赛是由SIGKDD主办的数据挖掘研究领域的国际顶级赛事，从1997年开始，每年举办一次，是目前数据挖掘领域最具影响力的赛事。该比赛同时面向企业界和学术界，云集了世界数据挖掘界的顶尖专家、学者、工程师、学生等参加，为数据挖掘从业者们提供了一个学术交流和研究成果展示的平台。KDD Cup 2020共设置五道赛题（四个赛道），分别涉及数据偏差问题（Debiasing）、多模态召回问题（Multimodalities Recall）、自动化图学习（AutoGraph）、对抗学习问题和强化学习问题。\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://p0.meituan.net/travelcube/0d62b5338c42f377e268b056db66d510102073.jpg@1920w_493h_80q\" alt=\"图1 KDD 2020会议\"/\u003e\u003c/p\u003e\u003cp\u003e美团到店广告平台搜索广告算法团队基于自身的业务场景，一直在不断进行前沿技术的深入优化与算法创新，团队在图学习、数据偏差、多模态学习三个前沿领域均有一定的算法研究与应用，并取得了不错的业务结果。基于这三个领域的技术积累，我们在比赛中选择了三道紧密联系的赛题，希望应用并提升这三个领域技术积累，带来技术与业务的进一步突破。搜索广告算法团队的黄坚强、胡可、漆毅、曲檀、明健、博航、雷军与中科院大学唐兴元共同组建参赛队伍Aister，参加了AutoGraph、Debiasing、Multimodalities Recall三道赛题，最终在AutoGraph赛道中获得了冠军（1/149），在Debiasing赛道中获得冠军（1/1895），并在Multimodalities Recall赛道中获得了季军（3/1433）。\u003c/p\u003e\u003cp\u003e近些年来，图神经网络（GNN）在广告系统、社交网络、知识图谱甚至生命科学等各个领域都得到了越来越广泛的应用。广告系统中存在着较为丰富的User-Ad、Query-Ad、Ad-Ad、Query-Query等结构化关系，搜索广告算法团队成功地将图表示学习应用于广告系统上，业务效果得到了一定的提升。此外，基于广告系统上图学习的技术积累，团队在今年KDD Cup的AutoGraph赛道中斩获了第一名。本文将介绍AutoGraph赛题的技术方案，以及团队在广告系统中图表示学习的应用与研究，希望对从事相关研究的同学能够有所帮助或者启发。\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://p1.meituan.net/travelcube/eeacf9ee6f0f42168901031cbc1893f61114376.png@1749w_949h_80q\" alt=\"图2 KDD Cup 2020 AutoGraph比赛TOP 5榜单\"/\u003e\u003c/p\u003e\u003ch2 id=\"赛题介绍与问题分析\"\u003e赛题介绍与问题分析\u003c/h2\u003e\u003ch3 id=\"autograph问题概述\"\u003eAutoGraph问题概述\u003c/h3\u003e\u003cp\u003e自动化图表示学习挑战赛（AutoGraph）是有史以来第一个应用于图结构数据的AutoML挑战，是AutoML与Graph Learning两个前沿领域的结合。KDD Cup 2020中的AutoML赛道挑战，由第四范式、ChaLearn、斯坦福大学和Google提供。\u003c/p\u003e\u003cp\u003e图结构数据在现实世界中无处不在，例如社交网络、论文网络、知识图谱等。图表示学习一直是一个非常热门的话题，它的目标是学习图中每个结点的低维表示 ，然后可用于下游任务，例如社交网络中的朋友推荐，或将学术论文分类为引用网络中的不同主题。 传统做法一般利用启发法从图中提取每个结点的特征，例如度统计或基于随机游走的相似性。 近些年来，业界提出了大量用于图表示学习任务的复杂模型，例如图神经网络（GNN）[1]，已经帮助很多任务（例如结点分类或链接预测）取得了新的成果。\u003c/p\u003e\u003cp\u003e然而，无论是传统的启发式方法还是最近基于GNN的方法，都需要投入大量的计算和专业知识资源，只有这样才能获得令人满意的任务性能。 例如在Deepwalk[2]和Node2Vec[3]中，必须对两种众所周知的基于随机游动的方法进行微调，以获得各种不同的超参数，例如每个结点的游走长度和数量、窗口大小等，以获得更好的性能。 而当使用GNN模型时，例如GraphSAGE[4]或GAT[5]，我们必须花费大量时间来选择GraphSAGE中的最佳聚合函数或GAT中多头自注意力头的数量。 因此，由于人类专家在调参过程需要付出大量时间和精力，进而限制了现有图表示模型的应用。\u003c/p\u003e\u003cp\u003eAutoML[6]是降低机器学习应用程序中人力成本的一种有效方法，并且在超参数调整、模型选择、神经体系结构搜索和特征工程方面都取得了令人鼓舞的成绩。 为了使更多的人和组织能够充分利用其图结构数据，KDD Cup 2020 AutoML赛道举办了针对图结构数据的AutoGraph竞赛。在这一竞赛中，参与者应设计一个解决方案来自动化进行图表示学习问题（无需任何人工干预）。该解决方案可以基于图的给定特征、邻域和结构信息，有效而高效地学习每个结点的高质量表示，解决方案应设计为自动提取和利用图中的任何有用信号。\u003c/p\u003e\u003cp\u003e本次AutoGraph竞赛针对自动化图学习这一前沿领域，选择了图结点多分类任务来评估表示学习的质量。竞赛官方准备了15个图结构数据集，其中5个数据集可供下载，以便参赛者离线开发其解决方案。 除此之外，还将向参与者提供另外5个反馈数据集，以评估其AutoGraph解决方案的公共排行榜得分。 之后，无需人工干预，竞赛的最后一次提交将在剩余的5个数据集里进行评估，这5个数据集对于参赛者而言是一直不可见的，评估排名最终会被用来评估所有参赛者的解决方案。 而且，这些数据集是从真实业务中收集的，随机划分为训练集和测试集，每个数据集给予了图结点id和结点特征，以及图边和边权信息，并且每个数据集都给了时间预算。参赛者必须在给定的时间预算和算力内存限制下设计一个自动化图学习解决方案，对每个数据集进行结点分类。每个数据集会通过精度（Accuracy）来评估准确性，通过精度可以确定参赛者们在每个数据集的排名，最终排名将根据最后5个数据集的平均排名来评估。\u003c/p\u003e\u003ch3 id=\"数据分析与问题理解\"\u003e数据分析与问题理解\u003c/h3\u003e\u003cp\u003e我们对离线五个图数据集进行分析，发现其图的类型多种多样，如下表1所示。从图的平均度可以看出离线图3、4较为稠密，而图1、2、5较为稀疏，从特征数量可以看出图1、2、3、4带有结点特征，图5无结点特征，同时我们发现图4是有向图而图1、2、3、5是无向图，我们考虑将图类型划分为有向图/无向图、稠密图/稀疏图、带特征图/无特征图等。\u003c/p\u003e\u003cp\u003e从表1中，我们也可以看出大部分图数据集的时间限制都在100秒左右，这是一个很短的时间限制，大部分神经网络架构和超参数搜索方案[7,8,9,10]都需要一个较长的搜索时间，需要数十个小时甚至长达数天进行架构和超参数搜索。因此，不同于神经网络架构搜索，我们需要一个结构和超参数快速搜索的方案。\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://p0.meituan.net/travelcube/c219df3dc35df51fce75f34bd679f652102119.png@992w_720h_80q\" alt=\"表1 离线五个图数据集的概况\"/\u003e\u003c/p\u003e\u003cp\u003e如图3所示，我们发现在图数据集5上存在着模型训练不稳定的问题，模型在某个epoch上验证集精度显著下降。我们考虑主要是图数据集5易于学习，会发生过拟合现象，因此我们在自动化建模过程中需要保证模型的强鲁棒性。\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://p0.meituan.net/travelcube/4878c96ece9bac4e7e4acb6a2229bf9931625.png@730w_414h_80q\" alt=\"图3 模型在训练过程中的不稳定性\"/\u003e\u003c/p\u003e\u003cp\u003e同时，从下图4可以发现，不同于传统的固定数据集评测数据挖掘竞赛，保证多个类型，分布差异大的数据集排名的稳定性相比于优化某个数据集的精度更为重要。例如，数据集5模型精度差异仅有0.15%，却导致了十个名次的差异，数据集3模型精度差异有1.6%，却仅导致7个名次的差异，因而我们需要采用排名鲁棒的建模方式来增强数据集排名的稳定性。\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://p0.meituan.net/travelcube/e6fc33c96990196c676e92d26c223cea153980.png@1186w_850h_80q\" alt=\"图4 不同参赛团队在不同数据集上的精度及排名\"/\u003e\u003c/p\u003e\u003ch3 id=\"问题挑战\"\u003e问题挑战\u003c/h3\u003e\u003cp\u003e基于以上数据分析，该赛题中存在以下三个挑战：\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cstrong\u003e图数据的多样性\u003c/strong\u003e：解决方案要在多个不同的图结构数据上都能达到一个好的效果，图的类型多种多样，包含了有向图/无向图、稠密图/稀疏图、带特征图/无特征图等。\u003c/li\u003e\u003cli\u003e\u003cstrong\u003e超短时间预算\u003c/strong\u003e：大部分数据集的时间限制在100s左右，在图结构和参数的搜索上需要有一个快速搜索的方案。\u003c/li\u003e\u003cli\u003e\u003cstrong\u003e鲁棒性\u003c/strong\u003e：在AutoML领域，鲁棒性是非常重要的一个因素，最后一次提交要求选手在之前没见过的数据集上进行自动化建模。\u003c/li\u003e\u003c/ul\u003e\u003ch2 id=\"竞赛技术方案\"\u003e竞赛技术方案\u003c/h2\u003e\u003cp\u003e针对以上三个挑战，我们设计了一个自动化图学习框架，如下图5所示，我们对输入的图预处理并进行图特征构建。为了克服图的多样性挑战，我们设计了多个图神经网络，每个图神经网络对于不同类型的图有各自的优势。为了克服超短时间预算挑战，我们采用了一个图神经网络结构和超参快速搜索的方法，使用更小的搜索空间以及更少的训练轮数来达到一个更快的搜索速度。为了克服鲁棒性挑战，我们设计了一个多级鲁棒性模型融合策略。最终，我们的自动化图学习解决方案可以在较短的时间内对多个不同图结构数据进行结点分类，并达到鲁棒性效果。接下来，我们将详细地介绍整个解决方案。\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://p1.meituan.net/travelcube/7046a4e081d2960b99a48877a2135430107996.png@964w_856h_80q\" alt=\"图5 自动化图学习框架\"/\u003e\u003c/p\u003e\u003ch3 id=\"数据预处理与特征构建\"\u003e数据预处理与特征构建\u003c/h3\u003e\u003cp\u003e\u003cstrong\u003e有向图处理\u003c/strong\u003e：大多数谱域GNN方法并不能很好地处理有向图，它们的理论依赖于拉普拉斯矩阵的谱分解，而大多数有向图的邻接矩阵是非对称矩阵，不能直接定义拉普利矩阵及其谱分解。特别的，当一个结点只有入度没有出度时，GCN等方法并不能有效地获取其邻居信息。由于赛题关注于结点分类而不是链接预测等，考虑大多数图结点分类问题，更为重要的是如何有效地提取图的邻居信息，因而我们将有向图的边进行反转改为无向图，无向图新边的权重与有向图被反转边的权重相等。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e特征提取\u003c/strong\u003e：为了更有效地进行结点的表示学习，提取了一些图的人工特征来让GNN进行更好地表示学习，例如结点的度、一阶邻居以及二阶邻居的特征均值等，我们对于数值跨度大的特征进行分桶，对这些特征进行Embedding，避免过拟合的同时保证了数值的稳定性。\u003c/p\u003e\u003ch3 id=\"图神经网络模型\"\u003e图神经网络模型\u003c/h3\u003e\u003cp\u003e为了克服图的多样性挑战，我们结合谱域及空域两类图神经网络方法，采用了GCN[11]、TAGConv[12]、GraphSAGE[4]、GAT[5]四个图神经网络模型对多种不同图结构数据进行更好地表示学习，每个模型针对不同类型的图结构数据有各自的优势。\u003c/p\u003e\u003cp\u003e图作为一种非欧式空间结构数据，其邻居结点个数可变且无序，直接设计卷积核是困难的。谱域方法通过图拉普拉斯矩阵的谱分解，在图上进行傅立叶变换得到图卷积函数。GCN作为谱域的经典方法，公式如下所示，其中D是对角矩阵，每个对角元素为对应结点的度，A是图的邻接矩阵，它通过给每个结点加入自环来使得卷积函数可以获取自身结点信息，图中的A帽和D帽矩阵即是加自环后的结果，并在傅立叶变换之后使用切比雪夫一阶展开近似谱卷积，使每一个卷积层仅处理一阶邻域信息，可以通过堆叠多个卷积层达到多阶邻域信息传播。GCN简单且有效，我们将GCN应用到所有数据集上，大部分数据集能取得较好的效果。\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://p1.meituan.net/travelcube/5802b314426b8169c22f59a0898f25f311481.png@361w_59h_80q\" alt=\"\"/\u003e\u003c/p\u003e\u003cp\u003e相较于堆叠多层获取多阶领域信息的GCN方法，TAGConv通过邻接矩阵的多项式拓扑连接来获取多阶领域信息。公式如下所示，可以发现，其通过预先计算邻接矩阵的k次幂，相比GCN可以在训练过程中实现多阶邻域卷积并行计算，高阶邻域的结果不受低阶邻域结果的影响，从而能加快模型在高阶邻域中的学习。在我们的实验结果上，其在稀疏图上能快速收敛并相比于GCN能达到一个更好的效果。\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://p1.meituan.net/travelcube/02e57342987867a7e67307afdbd87d8616902.png@430w_115h_80q\" alt=\"\"/\u003e\u003c/p\u003e\u003cp\u003e相较于谱域方法利用傅立叶变换来设计卷积核参数，空域方法的核心在于直接聚合邻居结点的信息，难点在于如何设计带参数、可学习的卷积核。GraphSAGE提出了经典的空域学习框架，其通过图采样与聚合来引入带参数可学习的卷积核，其核心思想是对每个结点采样固定数量的邻居，这样就可以支持各种聚合函数。均值聚合函数的公式如下所示，其中的聚合函数可以替换为最大值聚合，甚至可以替换为带参数的LSTM等神经网络。由于GraphSAGE带有邻居采样算子，我们引入该图神经网络来极大地加速稠密图的计算。在我们的实验结果上，它在稠密图上的运行时间远小于其他图神经网络，并且能达到一个较好的效果。\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://p0.meituan.net/travelcube/99ffec7d8429d0d85f8f3f2a9649347316816.png@597w_75h_80q\" alt=\"\"/\u003e\u003c/p\u003e\u003cp\u003eGAT方法将Attention机制引入图神经网络中，公式如下所示。它通过图结点特征间的Attention计算每个结点与其邻居结点的权重，通过权重对结点及其邻居结点进行聚合作为结点的下一层表示。通过Masked Attention机制，GAT能处理可变个数的邻居结点，并且其使用图结点及其邻居结点的特征来学习邻居聚合的权重，能有效利用结点的特征信息来进行图卷积，泛化效果更强，它参考了Transformer引入了Multi-head Attention来提高模型的拟合能力。GAT由于利用了结点特征来计算结点与邻居结点间的权重，在带有结点特征的数据集上表现优异，但如果特征维度多就会使得GAT计算缓慢，甚至会出现内存溢出的现象，我们需要在特征维度多的情况下对GAT的参数进行搜索限制，要求其在一个参数量更小的空间下搜索。\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://p0.meituan.net/travelcube/20ecf54c5fe1ca27190c1b7a933d4b8c53232.png@857w_132h_80q\" alt=\"\"/\u003e\n\u003cimg src=\"https://p0.meituan.net/travelcube/ef9a82f984de51ec31109fb04f19f7b817164.png@454w_122h_80q\" alt=\"\"/\u003e\u003c/p\u003e\u003ch3 id=\"超参快速搜索\"\u003e超参快速搜索\u003c/h3\u003e\u003cp\u003e由于超短时间预算的挑战，我们需要设计一个超参快速搜索方法来保证花较少的时间就可以对每个图模型进行参数搜索，并且在每个数据集上尽可能地使用更多的图模型进行训练和预测。如下图6所示，我们将参数搜索分为线下搜索和线上搜索两个部分。\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://p0.meituan.net/travelcube/10f96932f3eb8c85f7551e98d7d510d7160148.png@1402w_616h_80q\" alt=\"图6 超参快速搜索\"/\u003e\u003c/p\u003e\u003cp\u003e我们在线下搜索时，针对每一个图模型在多个数据集上使用一个大的搜索空间去确定图结构和参数边界，保证每个数据集在这个边界中都有较好的效果。具体地，我们对有向图/无向图、稀疏图/稠密图、带特征图/无特征图等不同图类型都对不同模型的大多数参数进行了搜索，确定了几个重要超参数。例如对于稀疏图，调整GCN的层数以及TAGConv多项式的阶数，使得其卷积感受野更大，可以迅速对数据集进行拟合，以使得其可以快速收敛；对于特征特别多的图，调整GAT的卷积层数、多头自注意力头的数量和隐层神经元个数以使得其训练时间在预算之内并且有较好的效果；对于稠密图，调整GraphSAGE的邻居采样，使得其训练可以加速。我们在线下主要确定了不同图模型学习率、卷积层数、隐层神经元个数等这三个重要参数的边界。\u003c/p\u003e\u003cp\u003e由于线上时间预算的限制，我们通过线下的参数边界确定了一个小的参数搜索子空间进行搜索。由于时间预算是相对少的，我们没有充足的时间在参数上做完整的训练验证搜索，因此我们设计了一个快速参数搜索方法。对于每个模型的超参空间，我们通过少量epochs的训练来比较验证集精度从而确定超参数。如下图7所示，我们通过16轮的模型训练来选取验证集精度最优的学习率0.003，我们的目的是确定哪些超参数可以使得模型快速拟合该数据集，而不追求选择最优的超参数，这样既可以减少超参的搜索时间，也可以减少后续模型训练的时间。通过快速超参搜索，我们保证每个模型在每个数据集上可以在较短内确定超参数，从而利用这些超参数进行每个模型的训练。\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://p0.meituan.net/travelcube/b0b0faa849d083cb42b2afc3d75d997246655.png@720w_414h_80q\" alt=\"图7 少量epochs模型训练下不同学习率的验证集精度\"/\u003e\u003c/p\u003e\u003ch3 id=\"多级鲁棒模型融合\"\u003e多级鲁棒模型融合\u003c/h3\u003e\u003cp\u003e由于在该次竞赛中是通过数据集排名平均来确定最终排名，故而鲁棒性是特别重要的。为了达到鲁棒效果，我们采用了一个多级鲁棒模型融合策略。如下图8所示，我们在数据层面进行切分来进行多组模型训练，每组模型包含训练集及验证集，通过验证集精度使用Early Stopping来保证每个模型的鲁棒效果。每组模型包括多种不同的图模型，每种图模型训练进行n-fold bagging进行融合来取得稳定效果。不同种类的图模型由于验证精度差异较大，我们需要对不同种类的图模型进行稠密度自适应带权融合来利用不同模型在不同数据集上的差异性。最后，我们再对每组图模型进行均值融合来利用数据间的差异性。\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://p0.meituan.net/travelcube/605dccb9c3ea3dc9cf933ea25266a143122262.png@1489w_567h_80q\" alt=\"图8 多级鲁棒模型融合\"/\u003e\u003c/p\u003e\u003cp\u003e稠密度自适应带权融合：如图4所示，由于某些图数据集较为稀疏且无特征太容易拟合，选手间精度相差小但是排名差异却较大。例如，数据集5模型精度差异仅有0.15%，却导致了十个名次的差异，数据集3模型精度差异有1.6%，却仅导致7个名次的差异，因而我们对于多种图模型采用了稠密度自适应的融合方式。\u003c/p\u003e\u003cp\u003e融合权重如以下公式所示，其中#edges为边的数量，#nodes为结点数量，则#edges/#nodes表示为图的稠密度，acc（Accuracy）为模型验证集精度，alpha、beta、gamma为超参数，每个模型的权重由weight确定。从以下公式可以看出，如果图足够稠密，则我们只需根据模型精度差异去得到模型权重，无需根据稠密度去自适应调整，参数alpha为是否进行稠密度自适应加权的稠密度临界值；如果图足够稀疏，则模型权重与其验证集精度和数据集的稠密度有关，图越稀疏，则模型权重差异越大。这是由于图越稀疏则模型精度差异性越小，但选手间的排名差异却较大，则我们需要给予更好的模型更大的权重来保证排名的稳定性。\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://p0.meituan.net/travelcube/0a10618f28bae75ffb027b4b5531c4ea37689.png@529w_314h_80q\" alt=\"\"/\u003e\u003c/p\u003e\u003ch2 id=\"评估结果\"\u003e评估结果\u003c/h2\u003e\u003cp\u003e表2所示的是不同图模型在离线五个图数据集上的测试精度，与图神经网络模型章节所描述的特点一致，GCN在各个图数据集上有较好的效果。而TAGConv在稀疏图数据集1、2、5有更优异的效果，GraphSAGE在稠密图数据集4上取得最好的效果，GAT在有特征的数据集1、2、4中表现较为良好，而模型融合在每个数据集上都能取得更稳定且更好的效果。\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://p0.meituan.net/travelcube/8938b32fb3e97ff56b3e898c3c7d3a1274224.png@820w_550h_80q\" alt=\"表2  不同图模型在离线五个图数据集上的测试精度\"/\u003e\u003c/p\u003e\u003cp\u003e如下表3所示，我们的解决方案在每个图数据集上均达到鲁棒性效果，每个数据集的排行均保持较领先的水平，并避免过度拟合，从而在平均排行上取得了第一，最终我们Aister团队在KDD Cup 2020 AutoGraph赛题道上赢得了冠军。\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://p0.meituan.net/travelcube/4b9eea289a0969b83eedaa1db16e572265348.png@1156w_572h_80q\" alt=\"表3 Top 5参赛队伍在最后5个数据集上所有图数据集的平均排行及在每个图数据集的单独排行\"/\u003e\u003c/p\u003e\u003ch2 id=\"广告业务应用\"\u003e广告业务应用\u003c/h2\u003e\u003cp\u003e搜索广告算法团队负责美团与大众点评双平台的搜索广告与筛选列表广告业务，业务类型涉及餐饮、休闲娱乐、丽人、酒店等，丰富的业务类型为算法优化带来很大空间与挑战。在美团丰富的搜索广告业务场景中，结点类型非常丰富，有用户、Query、Ad、地理位置甚至其他细分的组合结点，结点间的边关系也非常多样化，十分适合通过图学习进行建模。我们在搜索广告的触发模块及点击率预估模块进行图学习的深入优化，带来了业务效果的提升。\u003c/p\u003e\u003cp\u003e不仅结点间具有丰富的边关系，每种结点都有丰富的属性信息，比如Ad门店包含结构化的店名、品类、地址位置、星级、销量、客单价以及点击购买次数等统计信息。因此，我们的图是一种典型的异构属性图。目前在搜索广告场景下，我们主要关注包含Query和Ad两类结点的异构属性图。\u003c/p\u003e\u003cp\u003e如下图9所示，我们构建包含了Query结点和Ad结点的图，应用于触发模块与点击率预估模块。目前，该图使用的边关系主要包括以下几种：\u003c/p\u003e\u003cul\u003e\u003cli\u003eQuery-Query Session：用户在一次会话中的多次Query提交；\u003c/li\u003e\u003cli\u003eQuery-Query Similarity Mining：基于用户浏览点击日志挖掘的Query-Query相关性数据；\u003c/li\u003e\u003cli\u003eQuery-Ad Click：Query下Ad的点击；\u003c/li\u003e\u003cli\u003eAd-Ad CoClick：在同一次请求或用户行为序列中，两个Ad的共同点击。\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cimg src=\"https://p0.meituan.net/travelcube/1fe9fdd7eabc678625e0972811e6fd7d79040.png@948w_366h_80q\" alt=\"图9 异构图的构建\"/\u003e\u003c/p\u003e\u003cp\u003e图模型在触发模块主要应用于广告Ad的向量召回，离线构建Ad向量索引，线上实时预估Query向量，通过ANN检索的方式召回相关性较高的广告Ad。相比于传统的基于Bidword的触发方式，基于图模型的向量化召回在语义相关性及长尾流量上有较明显的优势，通过增加召回率显著提升了广告变现效率。\u003c/p\u003e\u003cp\u003e图10所示的是基于图表示多任务学习的触发图网络。我们采用基于MetaPath的Node2Vec游走生成正例，负例通过全局采样得到。在负例采样时，我们限定负例的品类必须和正例一致，否则由于在特征方面使用了品类特征，模型会轻易地学到使用品类特征区分正负例，弱化了其他特征的学习程度，导致了模型在同品类结点中区分度不好。并且负采样时，使用结点的权重进行Alias采样，保证与正例分布一致。为了增强泛化能力解决冷启动问题，我们使用每个结点对应的属性特征而不使用结点id特征，这些泛化特征可以有效地缓解冷门结点问题，异构图中未出现的结点，也可以根据它的属性特征，实时预估线上新Query或Ad的向量。\u003c/p\u003e\u003cp\u003e同时，对于不同结点类型应用不同的深度网络结构，对于Query结点，我们采用基于字粒度和词粒度的LSTM-RNN网络，Ad结点采用SparseEmbedding+MLP的网络。对于异构边类型，我们希望在模型训练过程中能刻画不同边的影响。对于同一个结点，在不同的边上对应单独的一个深度网络，多个边的深度网络生成的Embedding通过Attention的方式进行融合，形成结点的最终Embedding。为了充分利用图的结构信息，我们主要采用GraphSage中提出的结点信息汇聚方式。在本结点生成向量的过程中，除了利用本结点的属性特征外，也使用了邻居聚合向量作为特征输入，提升模型的泛化能力。\u003c/p\u003e\u003cp\u003e另外，在美团O2O场景下，用户的访问时刻、地理位置等Context信息非常重要。因此，我们尝试了图模型和双塔深度模型的多目标联合训练，其中双塔模型使用了用户浏览点击数据，其中包含丰富的Context信息。Query首先经过图模型得到Context无关的静态向量，然后与Context特征Embedding拼接，经过全连接层得到Context-Aware的动态Query向量。\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://p0.meituan.net/travelcube/418b183fefd6b4f2638721ba668c6964188247.png@1640w_780h_80q\" alt=\"图10 基于图表示学习的触发网络\"/\u003e\u003c/p\u003e\u003cp\u003e在点击率预估模块，相较于侧重于相关性建模的触发模块，更侧重于用户个性化的表达。图结构数据可对用户行为序列进行补充、扩建，起到挖掘用户潜在多峰兴趣的效果，从而提高用户点击率。我们通过在DSIN（Deep Session Interest Network）网络中引入图神经网络，将更为发散的用户兴趣扩充引入Session结构化建模。全局的图结构信息不仅有效扩展了用户潜在兴趣点，并且GNN Attention机制可以将目标Ad与图中潜在兴趣Ad信息结合，进一步挖掘出用户的目标兴趣。\u003c/p\u003e\u003cp\u003e如图11所示，对于任意用户行为序列，序列中每一个Ad，都可以在Ad图中进行邻接点遍历，得到其兴趣接近的其余Ad表达；用户行为序列是用户的点击序列，可视为用户兴趣的显示表达；经过Ad图拓展得到的序列，是行为序列在图数据中最相似的Ad组成的序列，可视为用户潜在兴趣的表达。用户原始行为序列的建模，目前基线采用DSIN模型；拓展序列的建模，则采用图神经网络的相关方法，利用GNN attention处理得到兴趣向量，并和目标Ad交叉。我们的实验显示，在DSIN基线模型的基础上，拓展序列还能进一步取得精度提升。\u003c/p\u003e\u003cp\u003e未来，我们还会进一步探索图模型在点击率模块中的应用，包括基于用户意图的图模型等。\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://p0.meituan.net/travelcube/7115e8ce3434107ff79b4b0a0b368573212006.png@1678w_534h_80q\" alt=\"图11 基于图神经网络的个性化预估网络\"/\u003e\u003c/p\u003e\u003ch2 id=\"总结与展望\"\u003e总结与展望\u003c/h2\u003e\u003cp\u003eKDD Cup是同工业界联接非常紧密的一项国际比赛，每年赛题紧扣业界热点问题与实际问题，而且历年产出的Winning Solution对工业界也都有很大的影响。例如，KDD Cup 2012产出了FFM（Feild-Aware Factorization Machine）与XGBoost的原型，在工业界已经取得了非常广泛的应用。\u003c/p\u003e\u003cp\u003e今年的KDD Cup主要关注在自动化图表示学习以及推荐系统等领域上，图表示学习在近年来既是学术界的热点，也被工业界广泛应用。而AutoML领域则致力于探索机器学习端到端全自动化，将AutoML与图表示学习两大研究热点相结合，有助于节省在图上进行大量探索的人工成本，解决了复杂度较高的图网络调优问题。\u003c/p\u003e\u003cp\u003e本文介绍了搜索广告算法团队KDD Cup 2020 AutoGraph赛题的解决方案，通过对所给的离线数据集进行数据分析，我们定位了赛题的三个主要挑战，采用了一个自动化图学习框架，通过多种图神经网络的结合解决了图数据的多样性挑战，通过超参快速搜索方法来保证自动化建模方案的运行时间在预算之内，以及采用了多级鲁棒模型融合策略来保证在不同类型数据集的鲁棒性。同时，也介绍我们在美团搜索广告触发模块以及点击率预估模块上关于图学习的业务应用，这次比赛也让我们对自动化图表示学习的研究方向有了更进一步的认知。在未来的工作中，我们会基于本次比赛取得的经验进一步优化图模型，并尝试通过AutoML技术优化广告系统，解决系统中难以人工遍历的模型优化与特征优化等问题。\u003c/p\u003e\u003ch2 id=\"参考文献\"\u003e参考文献\u003c/h2\u003e\u003cul\u003e\u003cli\u003e[1] Wu Z, Pan S, Chen F, et al. A comprehensive survey on graph neural networks[J]. IEEE Transactions on Neural Networks and Learning Systems, 2020.\u003c/li\u003e\u003cli\u003e[2] Perozzi B, Al-Rfou R, Skiena S. Deepwalk: Online learning of social representations[C]//Proceedings of the 20th ACM SIGKDD international conference on Knowledge discovery and data mining. 2014: 701-710.\u003c/li\u003e\u003cli\u003e[3] Grover A, Leskovec J. node2vec: Scalable feature learning for networks[C]//Proceedings of the 22nd ACM SIGKDD international conference on Knowledge discovery and data mining. 2016: 855-864.\u003c/li\u003e\u003cli\u003e[4] Hamilton W, Ying Z, Leskovec J. Inductive representation learning on large graphs[C]//Advances in neural information processing systems. 2017: 1024-1034.\u003c/li\u003e\u003cli\u003e[5] Veličković P, Cucurull G, Casanova A, et al. Graph attention networks[J]. arXiv preprint arXiv:1710.10903, 2017.\u003c/li\u003e\u003cli\u003e[6] He X, Zhao K, Chu X. AutoML: A Survey of the State-of-the-Art[J]. arXiv preprint arXiv:1908.00709, 2019.\u003c/li\u003e\u003cli\u003e[7] Elsken T, Metzen J H, Hutter F. Neural architecture search: A survey[J]. arXiv preprint arXiv:1808.05377, 2018.\u003c/li\u003e\u003cli\u003e[8] Zhou K, Song Q, Huang X, et al. Auto-gnn: Neural architecture search of graph neural networks[J]. arXiv preprint arXiv:1909.03184, 2019.\u003c/li\u003e\u003cli\u003e[9] Gao Y, Yang H, Zhang P, et al. Graphnas: Graph neural architecture search with reinforcement learning[J]. arXiv preprint arXiv:1904.09981, 2019.\u003c/li\u003e\u003cli\u003e[10] Zhang C, Ren M, Urtasun R. Graph hypernetworks for neural architecture search[J]. arXiv preprint arXiv:1810.05749, 2018.\u003c/li\u003e\u003cli\u003e[11] Kipf T N, Welling M. Semi-supervised classification with graph convolutional networks[J]. arXiv preprint arXiv:1609.02907, 2016.\u003c/li\u003e\u003cli\u003e[12] Du J, Zhang S, Wu G, et al. Topology adaptive graph convolutional networks[J]. arXiv preprint arXiv:1710.10370, 2017.\u003c/li\u003e\u003c/ul\u003e\u003ch2 id=\"作者简介\"\u003e作者简介\u003c/h2\u003e\u003cul\u003e\u003cli\u003e坚强，胡可，金鹏，雷军，均来自美团广告平台搜索广告算法团队。\u003c/li\u003e\u003cli\u003e唐兴元，中国科学院大学。\u003c/li\u003e\u003c/ul\u003e\u003ch2 id=\"关于美团ai\"\u003e关于美团AI\u003c/h2\u003e\u003cp\u003e美团AI以“帮人们吃得更好，生活更好”为核心目标，致力于在实际业务场景需求上探索前沿的人工智能技术，并将之迅速落地在实际生活服务场景中，完成线下经济的数字化。\n美团AI诞生于美团丰富的生活服务场景需求之上，具有场景驱动技术的独特性与优势。以业务场景与丰富数据为基础，通过图像识别、语音交互、自然语言处理、配送调度技术，落地于无人配送、无人微仓、智慧门店等真实场景下，覆盖人们生活的方方面面，用科技助力用户生活质量提升，产业智能化升级乃至整个社会的生活服务新基建建设。\u003c/p\u003e\u003cp\u003e更多信息请访问：\u003ca href=\"https://ai.meituan.com/\"\u003ehttps://ai.meituan.com/\u003c/a\u003e\u003c/p\u003e\u003ch2 id=\"招聘信息\"\u003e招聘信息\u003c/h2\u003e\u003cp\u003e美团广告平台搜索广告算法团队立足搜索广告场景，探索深度学习、强化学习、人工智能、大数据、知识图谱、NLP和计算机视觉最前沿的技术发展，探索本地生活服务电商的价值。主要工作方向包括：\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cstrong\u003e触发策略\u003c/strong\u003e：用户意图识别、广告商家数据理解，Query改写，深度匹配，相关性建模。\u003c/li\u003e\u003cli\u003e\u003cstrong\u003e质量预估\u003c/strong\u003e：广告质量度建模。点击率、转化率、客单价、交易额预估。\u003c/li\u003e\u003cli\u003e\u003cstrong\u003e机制设计\u003c/strong\u003e：广告排序机制、竞价机制、出价建议、流量预估、预算分配。\u003c/li\u003e\u003cli\u003e\u003cstrong\u003e创意优化\u003c/strong\u003e：智能创意设计。广告图片、文字、团单、优惠信息等展示创意的优化。\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003e岗位要求：\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e有三年以上相关工作经验，对CTR/CVR预估，NLP，图像理解，机制设计至少一方面有应用经验。\u003c/li\u003e\u003cli\u003e熟悉常用的机器学习、深度学习、强化学习模型。\u003c/li\u003e\u003cli\u003e具有优秀的逻辑思维能力，对解决挑战性问题充满热情，对数据敏感，善于分析/解决问题。\u003c/li\u003e\u003cli\u003e计算机、数学相关专业硕士及以上学历。\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003e具备以下条件优先：\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e有广告/搜索/推荐等相关业务经验。\u003c/li\u003e\u003cli\u003e有大规模机器学习相关经验。\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e感兴趣的同学可投递简历至：tech@meituan.com（邮件标题请注明：广平搜索团队）。\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "Date": "2020-08-27T00:00:00Z",
  "Author": "soulteary@gmail.com"
}