{
  "Source": "tech.meituan.com",
  "Title": "KDD 2021｜美团联合多高校提出多任务学习模型，已应用于联名卡获客场景",
  "Link": "https://tech.meituan.com/2021/08/12/kdd-2021-aitm.html",
  "Content": "\u003cdiv class=\"post-content\"\u003e\u003cdiv class=\"content\"\u003e\u003cblockquote\u003e\u003cp\u003e论文下载：\u003ca href=\"https://arxiv.org/abs/2105.08489\"\u003e《Modeling the Sequential Dependence among Audience Multi-step Conversions with Multi-task Learning in Targeted Display Advertising》\u003c/a\u003e\u003c/p\u003e\u003cp\u003e源代码：\u003ca href=\"https://github.com/xidongbo/AITM\"\u003ehttps://github.com/xidongbo/AITM\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e\u003cimg src=\"https://p1.meituan.net/travelcube/beeb41b8a27eeada58e95208d8829499647830.png\" alt=\"\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://p1.meituan.net/travelcube/a41284e5745d510bbe057dfabd9356d94455689.png\" alt=\"\"/\u003e\u003c/p\u003e\u003ch2 id=\"招聘信息\"\u003e招聘信息\u003c/h2\u003e\u003cp\u003e美团金融智能应用团队算法岗位持续热招中，诚招优秀算法工程师及专家，坐标北京/上海。招聘岗位包括：\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e营销算法工程师/专家\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e服务美团金融各业务场景，负责营销获客、留存促活等场景的算法设计与开发，综合机器学习与优化技术，解决金融营销问题；\u003c/li\u003e\u003cli\u003e沉淀算法平台能力，提升算法应用的效率，提供客群挖掘、权益分配、素材匹配、动态创意、运筹规划、精准触达等智能解决方案；\u003c/li\u003e\u003cli\u003e结合美团金融业务场景，对深度学习、强化学习、知识图谱等人工智能前沿技术探索创新，实施创新技术沉淀和落地。\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003e风控算法工程师/专家\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e通过机器学习模型与策略的开发优化，持续提升对于金融风险行为的识别能力；\u003c/li\u003e\u003cli\u003e深入理解业务，应用机器学习技术提高风控工作的自动化程度，全面提升业务效率；\u003c/li\u003e\u003cli\u003e跟进人工智能的前沿技术，并在金融风控场景中探索落地。\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eNLP算法工程师/专家\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e基于美团金融业务场景，结合自然语言处理和机器学习相关技术，落地智能对话机器人到金融营销、风险管理、客服等多个场景；\u003c/li\u003e\u003cli\u003e参与研发对话机器人的相关项目，包括但不限于语义理解、多轮对话管理等相关算法的开发和优化；\u003c/li\u003e\u003cli\u003e持续跟进学术界和工业界相关技术的发展，并快速应用于项目中。\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e欢迎感兴趣的同学发送简历至：chenzhen06@meituan.com（邮件标题注明：美团金融智能应用团队）。\u003c/p\u003e\u003ch2 id=\"参考文献\"\u003e参考文献\u003c/h2\u003e\u003cul\u003e\u003cli\u003e[1] Jiaqi Ma, Zhe Zhao, Xinyang Yi, Jilin Chen, Lichan Hong, and Ed H Chi. 2018. Modeling task relationships in multi-task learning with multi-gate mixture-of-experts. In KDD. 1930–1939.\u003c/li\u003e\u003cli\u003e[2] Zhen Qin, Yicheng Cheng, Zhe Zhao, Zhe Chen, Donald Metzler, and Jingzheng Qin. 2020. Multitask Mixture of Sequential Experts for User Activity Streams. In KDD. 3083–3091.\u003c/li\u003e\u003cli\u003e[3] Hongyan Tang, Junning Liu, Ming Zhao, and Xudong Gong. 2020. Progressive Layered Extraction (PLE): A Novel Multi-Task Learning (MTL) Model for Personalized Recommendations. In RecSys. 269–278.\u003c/li\u003e\u003cli\u003e[4] Yixuan Li, Jason Yosinski, Jeff Clune, Hod Lipson, and John E Hopcroft. 2016. Convergent Learning: Do different neural networks learn the same representations? In ICLR.\u003c/li\u003e\u003cli\u003e[5] Matthew D Zeiler and Rob Fergus. 2014. Visualizing and understanding convolutional networks. In ECCV. 818–833.\u003c/li\u003e\u003cli\u003e[6] Eric Tzeng, Judy Hoffman, Ning Zhang, Kate Saenko, and Trevor Darrell. 2014. Deep domain confusion: Maximizing for domain invariance. arXiv preprint arXiv:1412.3474 (2014).\u003c/li\u003e\u003cli\u003e[7] Chen Gao, Xiangnan He, Dahua Gan, Xiangning Chen, Fuli Feng, Yong Li, Tat-Seng Chua, and Depeng Jin. 2019. Neural multi-task recommendation from multi-behavior data. In ICDE. 1554–1557.\u003c/li\u003e\u003cli\u003e[8] Chen Gao, Xiangnan He, Danhua Gan, Xiangning Chen, Fuli Feng, Yong Li, Tat-Seng Chua, Lina Yao, Yang Song, and Depeng Jin. 2019. Learning to Recommend with Multiple Cascading Behaviors. TKDE (2019).\u003c/li\u003e\u003cli\u003e[9] Xiao Ma, Liqin Zhao, Guan Huang, ZhiWang, Zelin Hu, Xiaoqiang Zhu, and Kun Gai. 2018. Entire space multi-task model: An effective approach for estimating post-click conversion rate. In SIGIR. 1137–1140.\u003c/li\u003e\u003cli\u003e[10] Hong Wen, Jing Zhang, Yuan Wang, Fuyu Lv, Wentian Bao, Quan Lin, and Keping Yang. 2020. Entire Space Multi-Task Modeling via Post-Click Behavior Decomposition for Conversion Rate Prediction. In SIGIR. 2377–2386.\u003c/li\u003e\u003cli\u003e[11] \u003ca href=\"https://tianchi.aliyun.com/datalab/dataSet.html?dataId=408\"\u003ehttps://tianchi.aliyun.com/datalab/dataSet.html?dataId=408\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e",
  "Date": "2021-08-12T00:00:00Z",
  "Author": "soulteary@gmail.com"
}