{
  "Source": "tech.meituan.com",
  "Title": "人物志 | 美团女技术总监任登君：不要给自己的人生设限",
  "Link": "https://tech.meituan.com/2018/03/08/biography-rendengjun.html",
  "Content": "\u003cdiv class=\"post-content\"\u003e\u003cdiv class=\"content\"\u003e\u003cp\u003e在我们美团技术团队超过6000名工程师中，有众多的女同学，她们是支撑中国领先的生活服务电子商务平台不可或缺的力量。3月8日女神节，我们专访了她们的代表——美团广告平台技术负责人任登君。登君也是我们团队里目前职位最高的女性技术Leader，平时喜欢玩游戏，喜欢跑步，外号小A也是当年游戏的ID。\u003c/p\u003e\u003cp\u003e希望任登君的成长故事对大家有所启发。同时，在这个特别的日子里，真诚祝福所有的女工程师们，永远年轻，永远美丽。\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://awps-assets.meituan.net/mit-x/blog-images-bundle-2018a/3491e92f.png\" alt=\"任登君\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e本期人物 | 任登君\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e2017年加入美团，担任广告平台技术部负责人，是目前美团技术团队中职位最高的女性。她的团队主要负责公司广告变现的技术平台，包括投放、算法、计费、广告主、销售等相关的系统。这支技术团队支撑了美团广告事业部每天收入从百万量级到千万量级的增长。\u003c/p\u003e\u003cp\u003e任登君硕士毕业 于东北大学，专业方向是NLP（自然语言处理领域）。曾就职于东芝中国研发中心研究部，从事自然语言处理相关工作和研究。2010年加盟阿里巴巴广告技术部，历任广告主工具、直通车定向广告技术团队、搜索广告产品团队负责人。在淘宝广告部门工作期间，负责搜索广告整体市场和完成无线搜索投放策略的制定，带领团队完成直通车定向广告系统和算法的优化。随后出任悠易互通CTO，全面负责组建并带领高效的技术团队，专注于系统架构、基于大数据的核心算法以及显著提升客户的广告效果。\u003c/p\u003e\u003ch2 id=\"梦想当医生-误打误撞搞了计算机\"\u003e梦想当医生，误打误撞搞了计算机\u003c/h2\u003e\u003cp\u003e\u003cstrong\u003eQ1：你最初是怎么开始接触技术的？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e任登君：其实，我一直到大学才算正式接触计算机，高中时虽然也接触过一些BASIC编程，但都比较简单。因为我爸爸是一个医生，我当时一门心思想读医学院，但是高考不是特别理想，所以落到第二志愿。读东北大学的计算机，并不是精挑细选的，算是误打误撞。在考研之前，也想过转到经管方向，但是本科期间对计算机产生了很浓厚的兴趣，刚好东北大学有一个自然语言处理实验室，研究生方向就定了下来。毕业后就直接去了东芝中国的研发中心，后来就一直做自然语言处理领域 (NLP) 方向的研究。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ2：十多年前就搞机器学习、NLP啊，当时这类专业是不是还挺冷门，不好找工作？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e任登君：是的，当时工作机会确实不太好，跟现在找工作相比，已经是天壤之别了。不过，NLP方向在我们学校实验室拥有非常长的历史了，虽然人数一直不多。这也是因为我们学校有一个非常厉害的老师姚天顺，我也是慕名而去，很感恩姚老师把我收下了。对当时20多岁的一个小姑娘来说，也不知道NLP是啥，也没想太多，更没考虑哪个方向比较热门、将来好找工作这回事，就是想跟很厉害的老师学习。\u003c/p\u003e\u003cp\u003e当时NLP非常冷门，在我毕业之前的那些届，基本上全部留在学校继续做研究，当个助教或者老师，极少数人转行去了传统软件公司。我还是属于比较幸运的，研究生毕业时，百度、东芝已经在寻找自然语言处理领域的人才了，那时国内这方面的人才储备可谓凤毛麟角，我们实验室每年也就保持10个人的毕业量，加上我们实验室本身就是国内比较顶尖的自然语言处理实验室。即使很冷门，但是我们工作方面还是不存在问题的。我是2005年毕业，如果早毕业三年的话，估计只能去传统软件公司了，因为好的研究性机构，国内并不多。\u003c/p\u003e\u003cp\u003e加入东芝也是巧合，我曾参加了一次学术会议，刚好发现东芝中国的研发中心研究部要招人。像东芝这种研究中心，已经好几年没有招人了，他们也是聊了很多大学毕业生才下的决定。当时东芝中国的研发中心自然语言处理部门负责人，就是现在百度副总裁、AI技术平台体系 (AIG) 总负责人王海峰。我在东芝待了五年，一直都跟他在一起工作，也学到不少东西。\u003c/p\u003e\u003ch2 id=\"不想学术偏离实际-离开研究所到企业实践\"\u003e不想学术偏离实际，离开研究所到企业实践\u003c/h2\u003e\u003cp\u003e\u003cstrong\u003eQ3：在东芝五年期间，有什么比较有意思的事情吗？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e任登君：因为一直是做研究相关的方向，所以就是大量地写论文、做实验、研究前沿技术、参加各种学术会议以及写专利等等。其实，跟所有的研发中心一样。但是这期间，我们也有支持东芝本身的这些产品模块，我几乎参与了东芝所有的中文分词、日语分词项目，这些自然语言处理工具都在东芝很多产品线里面进行了应用。\u003c/p\u003e\u003cp\u003e我记得还参加了一次世界级的翻译比赛，当时我们花了很长时间去做数据集和算法优化，大概用了两个月的时间，最后16项比赛，我们团队拿了15项第一，只有一项是第二。这五年期间，其实做了很多事情，但是离真正的应用，还是有些远的。当时很多做自然语言处理领域的人才，基本上都在研究机构里面，说蛰伏也好，说沉淀也行，总之大家都熬了很多年。后来，我们部门的很多同事去了百度和微软，特别是近些年，人工智能爆发，我们这些人多年的积累，终于看到了一些成果，还是很欣慰的。\u003c/p\u003e\u003cp\u003e我记得NLP这个领域，应该是在2008年左右有一次爆发，现在已经是新的一波爆发了。当时主要是在语音理解、分词以及知识图谱层面。最近一两年是深度学习和算力的发展，解决了人工智能方向的一些问题，它们都是非常典型的、由数据驱动的解决方案。特别是随着GPU的提升，深度学习实现了非常大的飞跃。但是自然语音处理不是这样，因为语音的处理存在太多歧义，不完全是数据问题，还包括很多的知识问题，所以现在大家集中来解决这个问题。我们也看到，市场上存在很多公司在做知识图谱、智能客服、智能问答这些市场。好啃的骨头很多年前都已经啃完了，现在大家都在死磕最难啃的骨头。当然在NLP领域，细分赛道也越来越多，这也代表新机会。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ4：当时怎么去阿里巴巴的？阿里巴巴带给你哪些成长？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e任登君：当时是老大自己加入百度，我们很多同事在两三年内也纷纷离开。当时我有很多选择，可以去百度，也可以去搜狗和雅虎研究院，但是无论去哪里，还都是做NLP方向。我当时想做一些更贴近业务的方向，前面我也讲了，感觉在研究院这些年，业务不接地气，偏离实际使用很远。所以就跟阿里巴巴的搜索和广告都聊了一下，后来决定加入广告部门。\u003c/p\u003e\u003cp\u003e坦白讲，那时我对互联网也不是很了解，对广告也不是很了解，但这个最接近业务，自己写了五年的论文，做了五年的实验，感觉跟社会很脱节，想到一家能够将一身所学落地的公司，所以最终选择了阿里巴巴的广告平台。\u003c/p\u003e\u003cp\u003e在阿里巴巴当时团队叫淘宝广告技术部，团队开放性和包容性非常好，大家也给我很多机会，我个人的成长也非常快。因为我之前也没有带过团队，也不知道自己适不适合带团队，一直到阿里之后，我才发现自己还蛮适合带团队的。我当时主要给广告主做工具，在这个过程中，发现了自己的管理潜质，后面也就带了定向广告团队。人，总是要不断拥抱自己的变化。\u003c/p\u003e\u003ch2 id=\"从技术到管理-最重要的是接受心理层面的挑战\"\u003e从技术到管理，最重要的是接受心理层面的挑战\u003c/h2\u003e\u003cp\u003e\u003cstrong\u003eQ5：从贡献者到管理者，这个阶段你觉得有什么可以分享？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e任登君：我觉得从一线技术到承担技术管理职责，都要经过一个心理关，可能表现为个人技能和团队整体技能成长之间的矛盾。因为要带人，需要花时间去做管理，可能还需要跟产品沟通，跟很多部门的人沟通。后面可能发现，你没有一线技术看Paper的时间长，没有一线的技术写代码时间久，可能会发慌，担心失去安身立命的本领。我当时也存在这个问题，自己非常的慌。大概经过了半年时间的调整，后来我发现，如果能够把团队带的很完美，也是一件非常有成就感、非常有意思的事情，就解决了这个问题。\u003c/p\u003e\u003cp\u003e但是一定要把团队的产出和自己的产出分开，确定哪些是团队整体的功劳，明确哪些是自己做的事。这样不断提升自己对项目的把控、对技术的把控、对分工的把控。很多技术转管理的同学，在心理上面临很大的挑战，因为管理是软性的东西，看不见、摸不着。如果工程师想转做技术管理，一定要考量哪个让自己更擅长也更喜欢，确定是自己成长更好，还是带领团队一起把事情做好更有成就感。如果是前者，那么未必要走技术管理这条线。我们是一个多元化的大家庭，工程师可以有不同的成长路径。\u003c/p\u003e\u003cp\u003e另一个印象比较深刻的，是跟后进的团队成员谈绩效，阿里采用271，现在应该是361制度，1的这部分同学是没有加薪也没有奖金的。作为经理，我比他们还紧张，在他们的绩效改进过程中，花了非常多的时间辅导，发现其实用处不大。新晋的技术管理同学，很容易花过多时间在低绩效同学辅导和改进上，其实应该把重点放在团队的头部。流失对团队来说，并不见得是一件坏事。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ6：后来去悠易互通做CTO，从技术经理到CTO，这其中最大的变化和挑战有哪些？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e任登君：悠易互通当时技术团队面临很大的挑战，急需一个CTO。我过去后帮助他们打造了一个新的技术团队，重新搭建了整个系统，做完了底层改造，几乎花了小半年的时间。\u003c/p\u003e\u003cp\u003e做CTO跟技术经理也有很大的不同，因为一旦到达这个阶段，不管遇到什么问题，什么挑战，都需要去解决它。而且招聘也是很难的一件事，作为CTO，你要想尽一切办法找到合适的人。我们都知道，一个顶级的技术人才的价值超过10个普通的工程师。这种人才需要花很多精力去招进来。\u003c/p\u003e\u003cp\u003e当然，CTO还要稳住团队，不仅仅要谈工资问题，还要让大家知道，在这里能获得成长。我们要相信，大多数人的自驱力都很好，对未来渴求都非常高。如果聊未来成长、谈人生规划，他们应该成为什么样的人，他们就会相信。我刚接CTO的时候，20多个技术几乎全部离职了，后来我招来60多个技术人才，在我走之前几乎没有离职的。后来，很多人去了360、爱奇艺、今日头条、微博等大公司，这点也让我很开心，挺有成就感的。\u003c/p\u003e\u003ch2 id=\"加入美团-想对广告业务做一次完整的探索\"\u003e加入美团，想对广告业务做一次完整的探索\u003c/h2\u003e\u003cp\u003e\u003cstrong\u003eQ7：当时是如何结缘美团的？加入之前，有没有什么顾虑？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e任登君：我做广告六七年了，然后自己想完整的做一次广告业务，刚好美团广告业务刚刚起步，有机会能完整的做一次探索。美团不仅是中国最大的O2O平台，也是全球最大的生活服务类平台，我非常看好这个平台，很喜欢整个公司的文化，我觉得这就是未来的新巨头，所以没有任何顾虑。而且我做了选择，也不会顾虑很多事情。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ8：目前主要负责哪些方面的工作？平时如何安排自己的时间？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e任登君：我们部门主要负责美团广告变现的技术系统，包括投放、算法、计费、广告主以及销售相关的系统。严格来说，所有的广告系统都在我们这里。我们团队现在覆盖了各个类型的广告，包括效果广告、品牌广告、搜索广告等等，基本上所有的广告类型，也都是我们团队做的技术支持，现在我们每天的广告收益，已经达到每日千万的量级。\u003c/p\u003e\u003cp\u003e对我来说，每天到公司第一件事就是看数据、看报表，特别是收入报表。每天也会开很多会议，会跟产品方向和业务方向的同学讨论最新的进展和问题，讨论更多可行的方向。我每天会想给自己留出两到三个小时的时间（可能最后也就能有一小时）看技术的新方向。应该是突然有一天，我发现自己非常熟悉的NLP方向的发展，都跟不上的时候，还是有点慌的。现在每天都会保留一部分时间学习，也会找相关的技术同学，或者我认识的业界的人士讨论一下。\u003c/p\u003e\u003cp\u003e目前，还会看谷歌和很多其他公司出品的一些论文，也会看一些实验室发的论文。比如我对知识图谱比较感兴趣，会找身边的朋友帮忙推荐一下，但是国内的论文看的比较少。我希望自己能够跟上最新的技术前沿方向，而且作为技术管理者，最主要也是判断方向的对与错，如果没有能力判断前进的方向，基本上也就失去了做一个技术管理者的资格。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ9：目前来讲美团广告这块主要的挑战是什么？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e任登君：我们的广告下面有LBS的限制，上面有服务容量的限制，要在两个限制之下找到比较合适的广告主认知方向和技术迭代方向，把广告做到一个合理的水平，这是一个动态平衡问题，是一个很大的挑战。这方面与传统的纯线上的互联网广告不一样，没有人告诉我们该怎么做，必须自己探索。\u003c/p\u003e\u003cp\u003e对于有一定经验的广告技术人员来说，这种广告场景也是很有吸引力的。因为有挑战，有发挥的空间。甚至对于学术界，也是有意思的研究方向。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ10：对整个美团现在技术团队整体感觉如何？有什么建议？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e任登君：我觉得工程师技术氛围依然需要持续培养，其中最核心的是做到“追求卓越”这四个字。\u003c/p\u003e\u003cp\u003e在美团这样业务导向的公司，我们首先要尊重技术，相信技术的力量，但也要清醒地认识到，不能把业务押宝在技术的突破上。公司对技术团队还是很宽容的，大家有很大的空间。技术团队自身呢也要致力于把自己的事情做得更好，然后发挥更大的影响力，真正能够“追求卓越”。\u003c/p\u003e\u003cp\u003e公司目前制度、薪资都挺好的。技术管理方面，大家需要达成共识。对技术团队的管理者来说，只要你在一件一件小事上都奖赏、鼓励追求卓越的同学，大家都会看到，这种氛围就培养起来了。我们的博客、微信公众号技术影响力方面，我觉得都挺好，这些东西很难一蹴而就。\u003c/p\u003e\u003ch2 id=\"勇敢选择-并欣然承受所带来的代价\"\u003e勇敢选择，并欣然承受所带来的代价\u003c/h2\u003e\u003cp\u003e\u003cstrong\u003eQ11：家人对自己的工作理解吗？如何处理工作和家庭的关系？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e任登君：我的家庭很普通，但我感到很幸福，因为家人非常支持我的工作。我老公接管了女儿的学习和陪伴，让我能够比较安心的工作。我还要经常出差，他们也能理解。我女儿读一年级，她其实有非常多的课，除了周末能够陪女儿以外，我平常是没有时间陪她的，我也很歉疚。当然，我老公非常给力，因为他的工作相对可控，不像我一样经常出差，离家又比较近，所以他就花大量的时间陪伴女儿，好让我没有后顾之忧。\u003c/p\u003e\u003cp\u003e其实，对于我们这样的人来说，家庭不拖后腿是非常非常重要的点。女儿的成长肯定需要人陪伴，如果我老公也没有时间陪伴的话，我可能就没有办法这样高强度的工作了。我也花了很多时间，跟家人沟通，特别是我女儿，我会告诉她妈妈每天都在忙什么，不然的话，她会埋怨妈妈为什么不陪我。我会经常跟她讲，甚至在她们学校家长课堂上讲我的工作，也许她还不能完全理解，但是她知道妈妈很忙，知道妈妈不陪她的原因是什么。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ12：如何平衡生活和工作？如何做选择？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e任登君：我现在没法平衡，现阶段主要还是工作。除了工作外，就是陪我女儿上各种辅导班。我认为工作和生活是很难平衡的，因为一天时间就那么多。但是，我觉得做事是有选择的，关键是看你喜欢什么，看你这个阶段追求的是什么。而且我觉得选择什么都是可以的，只是选择带来的结果有好有坏。你能接受那些好的褒奖和收获，同时也要接受那些负面的声音和损失，任何事情都有两面性。\u003c/p\u003e\u003cp\u003e比如有的同学说，在这个阶段想多陪孩子，就把工作稍微时间调整一下，这是可以的，完全没问题。如果这个阶段，工作可以让我更开心，那就稍微牺牲一下生活带来的乐趣。现在是很好的社会，我们公司也能够包容多样性。有所得，也有所失，关键是自己能接受，别纠结。特别是对女孩子来说，女性在这些层面很容易被社会和自己内心的纠结所裹挟，我希望身边的女孩子，要更坚强一点，更坚定一点。\u003c/p\u003e\u003ch2 id=\"喜欢玩三国杀-希望能为人类的进步做出一点点贡献\"\u003e喜欢玩三国杀，希望能为人类的进步做出一点点贡献\u003c/h2\u003e\u003cp\u003e\u003cstrong\u003eQ13：在工作之余还有什么爱好吗？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e任登君：我还蛮喜欢打三国杀的，现在很少玩了。很难讲出来理由，就是单纯的喜欢，在打的过程中，会有很大的愉悦感。我很难说，打三国杀对工作和生活会有什么帮助。跑步，倒是一件挺好的事情，但我跑的不多、也不少。\n说到理想的话，其实现阶段我没有特别伟大的梦想。当然，我也希望自己能够有机会去为人类的进步做出一点点贡献，哪怕是一个很微小很微小的进步。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ14：最近在看哪些方面的书？给我们推荐一下。\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e任登君：我最近在看很多管理相关的书籍，因为刚好在管理上有一些心得。一本叫《领导梯队》，我觉得因为它的实操性非常好，非常值得一看。还有一本是《高效能人士的七个习惯》，这本书也比较贴近我们的实际，实操性也很强。最后一本就是《三体》，这种科幻的我也比较喜欢，它的脑洞开的非常大，可以让我们这些平凡人，想象的空间变得大得多。\u003c/p\u003e\u003ch2 id=\"女孩子要足够努力且专注-不要给自己的人生设限\"\u003e女孩子要足够努力且专注，不要给自己的人生设限\u003c/h2\u003e\u003cp\u003e\u003cstrong\u003eQ15：针对做技术的女同学，你有什么成长经验可以分享？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e任登君：我觉得，最重要的一点就是要突破心理界限。当我们决定要持续从事技术这个领域的那一刻，就应该忘记自己是一个女生，因为在这个过程当中，如果你觉得自己是女生，就会给不由自主的给自己设置太多的限制。我觉得做技术，首先要突破性别的界限，自己要突破各种界限。我们现在团队有很多工程师就是女生，她们做的很好，我也为她们感到骄傲和自豪。\u003c/p\u003e\u003cp\u003e今天回过头看所有的专业选择，我也有一些感触。在这个时代，如果你只是一个普通家庭出生的小孩，想要更好的往前冲的话，计算机可能是最好的方向，应该没有之一。因为这个专业延伸足够宽广，可能性足够大，足够包容。互联网在高速发展，新经济时代也不再是完全固化的时代，无论你是男生还是女生，无论你做什么工作，普通人靠自己的努力，可能都不需要万里挑一的天赋，只要足够努力，足够专注，就一定会有非常大的机会，闯出一片属于自己的天地。\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "Date": "2018-03-08T00:00:00Z",
  "Author": "soulteary@gmail.com"
}