{
  "Source": "tech.meituan.com",
  "Title": "人物志 | 美团技术委员会前端通道主席洪磊：爱折腾的斜杠青年",
  "Link": "https://tech.meituan.com/2019/01/10/biography-honglei.html",
  "Content": "\u003cdiv class=\"post-content\"\u003e\u003cdiv class=\"content\"\u003e\u003cblockquote\u003e\u003cp\u003e洪磊，2013年加入美团，目前是美团外卖事业部终端组的负责人，也是美团技术委员会前端通道主席。在加入美团之前，洪磊的职业生涯可以用“跌宕起伏”来形容。他就读于中南财经政法大学，曾任职于雅虎中国，先后担任产品经理、前端开发工程师等职位。拥有4年创业经历，对前端和硬件技术有着很高的热情。\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e\u003cimg src=\"https://p0.meituan.net/travelcube/5eb0fea148a24cf5a72eba890e338fe7626077.png\" alt=\"\"/\u003e\u003c/p\u003e\u003cp\u003e高中时，洪磊就参加各种计算机竞赛，很喜欢技术，但是大学并没有选择计算机这个方向。2002年，洪磊考入中南财经政法大学，读国际贸易专业。不过大四那年，他瞒着家里人跟几个小伙伴一起休学创业了。\u003c/p\u003e\u003cp\u003e当时，他们做了一款基于位置的本地服务（跟美团颇有渊源），受限于团队经验和当时的市场环境，最后以失败而告终。随后加入了雅虎中国，起初做音乐搜索产品经理，一心想做一个好用的音乐搜索产品，但却被技术同学各种“刁难”，“这个不好做，要开发1个月”。于是，他从产品转到了后台，然后又从后台转到了前端。\u003c/p\u003e\u003cp\u003e自从2005年，雅虎中国被阿里巴巴收购，就在不断拥抱变化，洪磊并不是很喜欢那种工作氛围。2009年，创业之火再次燃起，于是受邀加入魔位娱乐，在此期间，洪磊做过网页游戏开发，做过塞班App，从业务、运维、后台再到前端，几乎涉足整个流程并都有较深的参与，练就了“十八般武艺”。2013年，他觉得自己在团队管理和个人发展上遇到了瓶颈，于是正式加入美团，负责移动前端组，再次踏上新的征程。从美团触屏版开始做起，后面还搞了公司的运营系统，最后，“阴差阳错”地来到了美团外卖技术团队，一直到现在。\u003c/p\u003e\u003cp\u003e近日，我们美团技术学院采访了洪磊，一个“爱折腾”的创业者，一个做过产品、运营、后台和前端的工程师，他说家里的所有的智能家居，都是自己亲手“焊板子”捯饬出来的。我们在洪磊身上，真正看到了一种极客精神。今天，让我们一起听洪磊讲讲，这么多年他“折腾”出来的那些故事。\u003c/p\u003e\u003ch3 id=\"q-当时怎么接触到的计算机-为什么大学选择了中南财经政法大学-而且选择了国际贸易专业-有什么特别的故事可以分享吗\"\u003eQ：当时怎么接触到的计算机？为什么大学选择了中南财经政法大学，而且选择了国际贸易专业？有什么特别的故事可以分享吗？\u003c/h3\u003e\u003cp\u003e\u003cstrong\u003e洪磊\u003c/strong\u003e：其实，我在高中时候就经常参加计算机的竞赛。当时的高中在浙江淳安县，那是一个小县城，学校对计算机的理解或者说关注度其实是很低的。我参加一些省里和市里计算机竞赛，还给学校拿过一些奖项，这也是淳安中学最早的几个计算机奖项。\u003c/p\u003e\u003cp\u003e那个时候，对计算机还是非常感兴趣的，而且通过这几次获奖的经历，在自己心里也打下了这个“烙印”。但因为我们江浙一带的人，更偏向于从商，所以当时选择了中南财经政法大学的国际贸易专业。不过整个大学期间，我也非常有收获，对经济学、会计学、保险、物流、运输等等很多方面，都有了一定了解。国际贸易是一个非常广的学科，它涵盖的东西很多，甚至还要学习谈判技巧、各地文化和礼仪。虽然我觉得这个专业非常赞，但是骨子里，我更偏爱技术一点。\u003c/p\u003e\u003cp\u003e最终我还是选择了休学创业，但我知道，家里肯定会反对。所有我没有敢跟家里讲，我只是跟辅导员聊了一下，她当时很支持我的选择，虽然我对经济类专业也比较感兴趣。但是她觉得在计算机领域，我可能会有更好的发展。辅导员了解到我顾虑，她说，“没关系，如果你不敢讲，我帮你去讲”。现在，我还是很感谢辅导员给我的支持。\u003c/p\u003e\u003ch3 id=\"q-辅导员为什么对你那么有自信\"\u003eQ：辅导员为什么对你那么有自信？\u003c/h3\u003e\u003cp\u003e\u003cstrong\u003e洪磊\u003c/strong\u003e：因为我在大学期间，参加了学校里一些计算机相关的社团，还给班里同学辅导技术机等级考试的相关知识，有时还会接一些网站外包的活。最主要的是，我和几个小伙伴给微软旗下的即时通讯工具MSN Messenger开发了一个插件，可以加密聊天记录，并且添加了很多好用的小功能，我当时主要负责Tab系统的开发和维护。这应该也是MSN Messenger历史上最著名的一个插件了。\u003c/p\u003e\u003cp\u003e那是一个虚拟的小组，我当时在武汉，另两个开发者一个在上海，一个在广州，我们是三地办公。有个同学是专门去破解MSN Messenger的相关接口，获取相关权限。另一个同学是做通讯内容的加密，我负责Tab功能相关的系统，三个人配合的井井有条。\u003c/p\u003e\u003cp\u003e后来发现Yahoo! Messenger也有自己的标签系统，我顺便也破解了，这也是后面我能够加入雅虎中国的重要原因。所以我辅导员觉得我在计算机方面有一定的天赋，而且也做出了一些成绩，因此她坚定的支持我去做创业。\u003c/p\u003e\u003ch3 id=\"q-现在回看第一次创业-失败的原因是什么-对自己的影响是什么-有没有后悔过创业这件事\"\u003eQ：现在回看第一次创业，失败的原因是什么？对自己的影响是什么？有没有后悔过创业这件事？\u003c/h3\u003e\u003cp\u003e\u003cstrong\u003e洪磊\u003c/strong\u003e：首先是经验不足，我们想的太过理想，觉得把产品做出来就能有用户。但在当时，时机并不成熟，没有智能手机，上网主要靠PC，几乎无法实现精准的定位。做送餐这样的服务，对商家、用户的体验都很差。现在看来，在技术上，我们做的还行，但是在业务上，我们的思考就太少了。\u003c/p\u003e\u003cp\u003e这次创业后，我觉得事，都要有条理地去做，当时团队应该算是“散兵游勇”，没做市场调查，没有MRD，连PRD也是很简单的一个框架图而已，我们就开始开发了，甚至一些技术的实现也因为总是变动功能而做得比较糙。\u003c/p\u003e\u003cp\u003e对休学这件事，还是有一些遗憾的，但是没有后悔过。比如因为没有毕业证，导致我现在办不了北京的工作居住证，部分城市的落户也会很困难。但是不后悔，如果没有当时的爱折腾，可能也不会有现在这样一个“特别”的我。也许就是每天简单的上班、吃饭、下班、陪家人，当然平淡也是一种幸福。但是我知道，这不是我向往的生活。每次参加校园招聘，我会劝小同学们要来北京这样的大城市，因为视野不同，眼界也大有不同。\u003c/p\u003e\u003cp\u003e我很清楚的记得，有个美团校招时被我的思想“安利”的小同学，她入职一年后告诉我，“真是完全不一样的感觉，如果当时留在成都，大概率就是一生默默无闻的做一份工作，可能永远都不会触达到世界各地。但是，现在我一有空，就全球各地跑、去玩，去了解更多更新的知识，原来世界上有这么多有意思的东西，值得我们去体会。”\u003c/p\u003e\u003ch3 id=\"q-为什么会选择雅虎\"\u003eQ：为什么会选择雅虎？\u003c/h3\u003e\u003cp\u003e\u003cstrong\u003e洪磊\u003c/strong\u003e：雅虎当时还是全球第一大网站。而且我刚刚也讲到了，在大学期间，我把Yahoo! Messenger的Tab系统破解了，还总是给他们提一些问题和想法，所以就认识了当时雅虎中国的产品总监Sam。大二的时候，他就邀请我去雅虎实习。后来创业失败，也没有机会参加校招，干脆就过去了。\u003c/p\u003e\u003cp\u003e雅虎中国也没有看我的学历。我当时还有点沾沾自喜。因为很多同学参加校招，各种面试，最后等发Offer。而我，只写了一个PPT，下面坐了好几个部门的负责人，等我去选择。其实，我当时也不知道自己想做什么，Sam问我这个问题，我记得是这么回答的：“我想做一些把雅虎美国的产品引入中国以后，让中国用户用的更爽的事，我想做一些本地化，或者说更炫酷的功能。”\u003c/p\u003e\u003ch3 id=\"q-给现在的实习生或者在校生提点建议吧\"\u003eQ：给现在的实习生或者在校生提点建议吧？\u003c/h3\u003e\u003cp\u003e\u003cstrong\u003e洪磊\u003c/strong\u003e：这个问题我需要好好回答一下，我参加过很多次校招，也结合我亲身的一些经历，我给现在还在实习的同学们三点小建议：\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003e第一点，要想清楚自己喜欢的工作，或者自己喜欢的方向是什么，这点很重要。很多同学都觉得找个朝阳行业，一份收入高的工作就好。工作以后，我们会逐渐发现，只有我们真正喜欢的，才可能去深入。\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e第二点，建议大家第一份工作要去一个大点的公司，如果是互联网公司，建议去BAT或者美团这样的大型互联网企业。因为大公司能够提供一个体系化的成长平台，让同学们少走弯路。\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e第三点，不要眼高手低，应该从最基础的岗位做起，从底层去了解一个技术。我经常跟美团的小伙伴讲，“要多去看那些基础知识，少去看那些高大上的东西。”如果真想自己去写一个东西，那我希望是从底层原理去了解，而不是通过一些现成的类库来实现，甚至到网上找一个类似的直接改改。\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003ch3 id=\"q-刚开始做的是产品相关的工作-什么原因让你转做前端了呢\"\u003eQ：刚开始做的是产品相关的工作，什么原因让你转做前端了呢？\u003c/h3\u003e\u003cp\u003e\u003cstrong\u003e洪磊\u003c/strong\u003e：这段经历其实挺有意思的，最早我去雅虎中国是做音乐搜索产品助理的，但是对整个产品体系了解不够，就被我老板发配去做运营。其中有个重要的工作就是每天要用几个小时去统计业务的各种数据，非常枯燥。\u003c/p\u003e\u003cp\u003e不过那个过程，对我的帮助非常之大，通过持续了两个月的数据统计工作，我对整个音乐产品有个非常清晰的了解，知道业务上哪些地方有改进的空间。所以后面做产品设计的时候，就可以游刃有余地通过数据来推动业务的发展。\u003c/p\u003e\u003cp\u003e说到转型，还有段精彩的故事。几乎所有的工程师都比较抵触产品，每次去排期的时候，工程师都说这个事情比较难，我们做不了，或者这个事情我们排不上期，如果逼急了，他们可能就来句“你行，你上啊”。当然我也不示弱，就接了一句：“好吧，我自己来搞，你把权限开放给我。”因为我大学的时候就写过PHP代码，雅虎用的也是PHP，所以做一些简单开发，不会有太大的压力。\u003c/p\u003e\u003cp\u003e写完后台以后，发现前端又是个瓶颈，前端人员少，排不上期，那行吧，我又开始写起了前端。这时突然发现前端是我喜欢的一个方向，我就直接转入UED（雅虎的前端在UED团队）。这里有个让我记忆犹新的小故事，可以分享给大家，我作为前端工程师写的第一个页面，因为没有做到到像素级的呈现，结果被投诉到我老板那，被训了一顿。\u003c/p\u003e\u003cp\u003e这件事对我触动很大，做每一件事，都应该符合需求方的诉求，尊重上游同学的劳动成果，而不是自己埋头做一些自己觉得很轻松的事。这也促使我跟设计师同学们的配合都非常默契，包括现在小米（米UI）的设计部门负责人跟我关系就很好，之前他的个人网站就是他设计我开发的，其中各种渐变、圆角加阴影（当时要考虑低版本IE），他非常赞赏我完美的呈现，我经常说他“就剩下对像素的这点追求了”。\u003c/p\u003e\u003ch3 id=\"q-你会鼓励技术同学转型吗\"\u003eQ：你会鼓励技术同学转型吗？\u003c/h3\u003e\u003cp\u003e\u003cstrong\u003e洪磊\u003c/strong\u003e：我还是会鼓励同学们去做一些有挑战的事。而选择转型，去干一个全新的事情，主要还是看个人的兴趣和追求。但是非常推荐同学们去合作团队轮岗。美团外卖就一直在推动轮岗的事，我最近也在产品线轮岗。\u003c/p\u003e\u003cp\u003e我觉得各种技术在思想上其实互通的，我们可以通过轮岗学到交叉领域的很多知识。2013年在平台做LocalStorage缓存优化，就借鉴了MemCache的一些想法去实现的。所以很多情况，我们可以去借鉴其他技术的思想，只是代码的实现层面，略有差异。\u003c/p\u003e\u003ch3 id=\"q-当时为什么会离开雅虎-再次选择创业-有哪些新的收获\"\u003eQ：当时为什么会离开雅虎？再次选择创业，有哪些新的收获？\u003c/h3\u003e\u003cp\u003e\u003cstrong\u003e洪磊\u003c/strong\u003e：很重要的一个原因，就是雅虎中国乃至全球的业务在慢慢萎缩，心里有一定的落差。而且收购后，阿里巴巴的企业文化、价值观我也不是非常适应。刚巧有一个好哥们邀请我和他一起创业，我就决定和他一起“干一票大的”。当然，创业依然是一个很艰辛的过程。\u003c/p\u003e\u003cp\u003e创业要有极强大的内心。我当时从雅虎中国出来，家人朋友并不支持我，因为阿里巴巴在浙江非常有名，大家都挤破了头往里走。父母会觉得，从那么优秀的一家公司出来跑去创业，还是一家“生死未卜”的公司，是脑袋有“坑”的节奏吗？\u003c/p\u003e\u003cp\u003e这次创业中间有很多波折的，做过很多业务，比如网页游戏，比如塞班客户端应用等等。我觉得创业要有耐心，要能够坚持在一个业务上不断深入。也需要灵活，在发现某个业务方向完全行不通的时候快速变化。这次创业，我最大的收获是，从业务到技术，甚至采购和市场都要自己去管理，这让我能更全面的去思考一个业务的发展过程。\u003c/p\u003e\u003cp\u003e其实我还是一个技术流，更喜欢去研究技术问题，家里的智能家居系统都是我自己搞的，其中还包括大部分的硬件，自己购买芯片和元件，然后做PCB板、焊接。我希望对这些设备有“掌控权”，或者说我希望这些设备对我来说，是一个完全“透明”的东西。不希望设备“不听话”，更不希望数据莫名奇妙到了别人的服务器上，对于一个做技术同学来说，这是很难容忍的一件事情。\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://p0.meituan.net/travelcube/2f75880e8ab831f9520fe590a5cdedb32809098.jpg\" alt=\"\"/\u003e\u003c/p\u003e\u003ch3 id=\"q-这么多年的创业-对技术的发展有哪些体会\"\u003eQ：这么多年的创业，对技术的发展有哪些体会？\u003c/h3\u003e\u003cp\u003e\u003cstrong\u003e洪磊\u003c/strong\u003e：对技术而言，第一点感触是，在商业社会中，能服务好业务的技术才有价值，不推崇去搞一些不容易落地的技术。\u003c/p\u003e\u003cp\u003e第二点感触是，技术和产品应该和业务紧密相连，不能单独割裂开来，我们每个技术同学也都应该了解产品还有业务的思路，做出最合适的技术实现。\u003c/p\u003e\u003ch3 id=\"q-后来为什么选择美团\"\u003eQ：后来为什么选择美团？\u003c/h3\u003e\u003cp\u003e\u003cstrong\u003e洪磊\u003c/strong\u003e：创业的前两年比较辛苦，后面基本上全球跑，每天都可以有“说走就走的旅行”。公司的业务趋于稳定，没有太大的发展，感觉自己的发展也遇到了一些瓶颈。\u003c/p\u003e\u003cp\u003e还有一点，我们的公司属于“哥们型”的公司，在团队管理层面，存在很大的问题，我当时管了20人左右，很难再扩大规模了。恰巧雅虎的一个同事推荐我来美团，当时跟亮哥（陈亮，美团高级副总裁）也比较谈得来，所以就加入了。\u003c/p\u003e\u003ch3 id=\"q-到美团后经历了哪些事\"\u003eQ：到美团后经历了哪些事？\u003c/h3\u003e\u003cp\u003e\u003cstrong\u003e洪磊\u003c/strong\u003e：刚来美团的时候，我们团队只有3个人。移动前端在当时也是一个刚兴起不久的方向，几乎相当于从零开始做，我很享受这个过程。\u003c/p\u003e\u003cp\u003e团队主要工作就是开发美团系相关触屏版页面，期间还管理了相关的后端团队和产品团队，最多的时候有30多人，也创造了不错的业绩。同时也为公司很多部门输送了大批人才，包括猫眼（已经独立）、大象、美团酒旅最早期的前端的同学，都是从我们移动前端组过去的。\u003c/p\u003e\u003cp\u003e2016年初，公司希望我去管理外卖前端团队，最初还是有点犹豫的，后来和外卖同学做了简单沟通后就欣然接受了挑战，当时并没有想到会在外卖团队获得如此快速的成长。\u003c/p\u003e\u003cp\u003e到外卖后，第一个挑战就是App的质量欠佳，我并不是客户端出身，所以对客户端技术了解甚少，只能通过管理的手段来做事情，还好当时有非常称心的“左膀右臂”，加上自己精通前端技术，很快跟小伙伴打成一片。我觉得美团的工程师文化还是很好的，“只要你技术好，我就是服你的，可以跟你干”。\u003c/p\u003e\u003cp\u003e现在我们团队有100多名小伙伴，管理团队在成员的引入、留存和培养上下足了功夫，资深工程师占比超过30%，是美团比较优秀的团队之一，我也为此骄傲。在此，也欢迎更多的同学加入我们。\u003c/p\u003e\u003ch3 id=\"q-你觉得美团的技术氛围如何\"\u003eQ：你觉得美团的技术氛围如何？\u003c/h3\u003e\u003cp\u003e\u003cstrong\u003e洪磊\u003c/strong\u003e：我觉得我们美团的技术氛围挺好的，至少在我待过的几家公司里是最好的。因为我们美团的工程师比较有冲劲，自驱力很强。\u003c/p\u003e\u003cp\u003e第二点，再就是大家都愿意去做一些事情，提高整个团队的影响力。在美团这个大家庭里，永远不是一个人在向前跑，而是共同追求进步。\u003c/p\u003e\u003ch3 id=\"q-平时有哪些爱好\"\u003eQ：平时有哪些爱好？\u003c/h3\u003e\u003cp\u003e\u003cstrong\u003e洪磊\u003c/strong\u003e：一是爱折腾，折腾技术，折腾硬件这些。家里的智能家居系统，都是我自己一个人焊板子，捯饬出来的，我希望家里的东西都是“透明”的，代码也要“透明”。\u003c/p\u003e\u003cp\u003e然后，有时间就去旅行，满世界跑。有时一个人，有时约上三两个好友一起自驾。我不太喜欢“走马观花”，更喜欢在一个地方待上一段时间，去体会那里的风土人情，感受当地的文化。旅行时，我不喜欢有太多的规划。很多时候，不知道自己的下一个目的地是哪里，只要一直在路上就好。\u003c/p\u003e\u003ch3 id=\"q-写代码多少年了\"\u003eQ：写代码多少年了？\u003c/h3\u003e\u003cp\u003e\u003cstrong\u003e洪磊\u003c/strong\u003e：要说第一行代码，应该要追溯到2000年左右高二时候了，那时学校还用的是DOS系统，我会用Pascal语言“暴力”获取一些简单游戏的通关步骤。当时“文曲星”上面有一个叫“汉诺塔”的游戏，我就用穷举法找到了最少的移动步骤。\u003c/p\u003e\u003cp\u003e第一行PHP代码是2003年写的，直到现在还会偶尔写写。我对写代码这件事兴趣盎然，应该会永远充满激情。\u003c/p\u003e\u003ch3 id=\"q-对技术同学有哪些建议\"\u003eQ：对技术同学有哪些建议？\u003c/h3\u003e\u003cp\u003e\u003cstrong\u003e洪磊\u003c/strong\u003e：第一点，我觉得应该深入了解底层的原理，而不要只停留在应用层面。这样才能够真真切切地明白程序运行的机理。\u003c/p\u003e\u003cp\u003e第二点，要懂得举一反三，把自己学到的知识，通过加工，创造出更好的实现，使知识得到升华。我感觉中国的工程师比较守规矩，发散性思维较弱，这方面还可以提升很多。\u003c/p\u003e\u003cp\u003e第三点，就是要长期有耐心，这也是我们美团倡导的价值观和做事方式。\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "Date": "2019-01-10T00:00:00Z",
  "Author": "soulteary@gmail.com"
}