{
  "Source": "tech.meituan.com",
  "Title": "青年人在美团是怎样成长的？",
  "Link": "https://tech.meituan.com/2020/05/04/meituan-0504-young-people.html",
  "Content": "\u003cdiv class=\"post-content\"\u003e\u003cdiv class=\"content\"\u003e\u003cp\u003e2020年五四青年节，我们采访了美团技术团队9位青年代表，他们是来自清华大学、北京大学、中国科学院大学等国内高校的2位博士研究生和7位硕士研究生。在这个属于青年人的特别的日子里，我们请他们分享了自己在美团成长的故事。\u003c/p\u003e\u003ch2 id=\"道阻且长-不忘初心-砥砺前行-行则将至\"\u003e道阻且长，不忘初心，砥砺前行，行则将至\u003c/h2\u003e\u003cp\u003e\u003cstrong\u003eQ1：毕业时，你应该拿到了不少Offer，为什么最后选择了美团？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://p0.meituan.net/travelcube/2b02c9fd6bb4cc516edb0ea8fc1584b31105636.png\" alt=\"\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e杨扬\u003c/strong\u003e：最重要的一点，美团的技术氛围很好。在学校的时候，我也关注了美团技术团队的公众号/博客，满满的干货。我其实从大三就开始接触自然语言处理（NLP）这个领域了，那时候就对NLP产生了兴趣和热爱，研究生期间也一直做NLP这个方向，所以投递的岗位以及拿到的Offer也都是与此相关的。此外，也是考虑到美团有海量的数据和丰富的场景，能够将NLP的技术更好地应用，并且公司也处于快速发展的时期，我深信能在美团这里得到更多的成长空间。\u003c/p\u003e\u003cp\u003e当然，还有一个比较特别的原因吧，应该说是缘分。当时有师兄在美团工作，他有一次听了王仲远（AI平台/搜索与NLP部技术负责人）的一次分享后，就直接联系我，然后将我内推了过来，然后才有后续的故事。总的来说，加入美团技术团队，能跟一群优秀的人做事，会让自己变得更加优秀。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ2：在美团众多的企业理念中，哪一条对你影响比较大？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e杨扬\u003c/strong\u003e：「每天前进三十公里」，这句话对我影响比较大。每天多学习一点，多思考一点，积跬步以至千里。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ3：工作中，典型的一天是怎么度过的？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e杨扬\u003c/strong\u003e：早上通勤的路上听听播客，到工位后首先会查看大象以及自己负责的任务运行情况，之后将一天的工作进行拆解，然后就开工啦。下午会利用集中的时间去专注地完成工作上的任务。晚上如果没有会议且工作上的任务完成的情况下，会做一些技术沉淀，学习一些算法知识，再看一些最新的工作进展。下班前，简单复盘下当天的工作，并列一下第二天的To Do。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ4：工作以后，最自豪或者印象最深刻的一件事是什么？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e杨扬\u003c/strong\u003e：工作以来最自豪的一件事，就是参与了美团的BERT项目。自己有幸接触并学习了非常前沿的一些工作，然后应用在具体业务中，而且带来了一定的效果提升。同时也和团队一起发表了一篇技术博客《\u003ca href=\"https://tech.meituan.com/2019/11/14/nlp-bert-practice.html\"\u003eMT-BERT的探索和实践\u003c/a\u003e》。在这整个过程学习到了很多的东西，很感谢Leader和Mentor对我的各种指导，还有同事们的各种帮助，在这里特别感谢大家。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ5：你理解的基本功是什么？你平时怎么加强这方面的训练？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e杨扬\u003c/strong\u003e：我理解的基本功包括2个方面，一方面是硬技能，包括代码能力、业务能力、算法能力等等；另一方面是软技能，包括沟通、协作、时间管理等等。\u003c/p\u003e\u003cp\u003e关于硬技能的话，我觉得一方面要在公司实际业务中多积累经验，提高自己的工程能力、业务能力、执行力，同时关注核心技术，结合业务进行思考，解决问题的同时也要多思考和复盘；另一方面，积极关注公司内部技术分享以及业界技术进展，保持学习的敏锐度，促进技术栈的迭代更新，从而不断延伸个人的能力。\u003c/p\u003e\u003cp\u003e在软技能方面，还是要多学习一些方法论，在工作中进行实践，并从周围优秀的同事身上不断学习，保持精进。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ6：作为美团的新生力量，公司主要为你们提供了哪些方面的培养？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e杨扬\u003c/strong\u003e：美团提供的培养对我的帮助还是很大的。主要讲三点吧。第一点，刚入职时，公司就对我们提供了「萌芽计划」以及部门的「雏鹰计划」，不仅能使我们这些新人更快地融入，也让我们对公司以及部门有了更加深入的了解；第二点，正式入职后，包括算法通道以及部门内会定期有各种技术分享，能够帮助我们开拓视野并学习一线的实践经验；第三点，技术学院也提供了很多基本功课程，包括沟通技巧、写作技巧等等，这些都有益于我们个人技能的提升。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ7：平时喜欢读书吗？哪本对自己影响比较大？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e杨扬\u003c/strong\u003e：平时比较喜欢读书。对我影响比较大的一本书是《高效能人士的七个习惯》，更重要的是在工作和生活中，不断去践行书中提到的一些习惯，从而提高自己的工作效率以及充实自己的生活。\u003c/p\u003e\u003cp\u003e近期，对我影响比较大的一本书是《万物发明指南——时间旅行者生存手册》，作者设定的故事是：假如你坐时光机穿越到过去，那么如何从零创造人类文明？书中介绍了创建文明所需的语言学、数学、植物学、医学、化学、艺术、哲学等等，很酷很有趣，推荐给大家。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ8：五四青年节，对在校的学弟学妹们有什么想说的话？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e杨扬\u003c/strong\u003e：在学校的时候，尽量打好基础，多多积累；平时要积极主动，培养Owner意识；不要给自己设限，去探索更多的可能。道阻且长，不忘初心，砥砺前行，行则将至。\u003c/p\u003e\u003ch2 id=\"练习一样技能-最好的方式是展现给别人看\"\u003e练习一样技能，最好的方式是展现给别人看\u003c/h2\u003e\u003cp\u003e\u003cimg src=\"https://p0.meituan.net/travelcube/ec082e124256dc36b81444dbf74a80821120090.png\" alt=\"\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ1：毕业时，你应该拿到了不少Offer，为什么最后选择了美团？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e瑞年\u003c/strong\u003e：我觉得毕业工作的选择大家都会考虑如下几个点吧：1.工作城市；2. 薪酬；3. 自己在公司的发展空间；4. 工作内容自己是否感兴趣 or 是否匹配自己的专业。对于我来说，上面四点的重要性是 4 = 3 \u0026gt; 2 \u0026gt; 1。我现在所在的NLP与搜索团队跟我所学的专业比较相关，而且美团是一家处于快速增长中的公司，个人成长的空间也相对比较大，另外薪酬方面也还OK，所以综合多种因素，最终选择了美团。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ2：在美团众多的企业理念中，哪一条对你影响比较大？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e瑞年\u003c/strong\u003e：美团有句老话：「如果你想走得快，就要一个人走；你想走得久、走得远，要一群人一起走。」可能只有当我们真正工作了以后，才真正体会到「团队合作」的重要性。以前在学校，做实验、写论文也就跟导师讨论一下，很多事情一个人也能搞得定。但到了公司以后，每个项目基本上都是整个团队中若干个人紧密协作的成果，而且只能通过团队合作，才能真正把工作做好。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ3：工作中，典型的一天是怎么度过的？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e瑞年\u003c/strong\u003e：一般会比上班规定的时间稍早一点到达工位，思考一下今天的工作内容。在白天的工作中，免不了要和同事开会讨论，经常自己的工作做到一半就被拉去开会，开始还有点不适应，不过现在已经习惯了。一般来说，我会尽量把开会讨论放在上午和晚上，下午的时间会留给自己单独做一些开发工作。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ4：工作以后，最自豪或者印象最深刻的一件事是什么？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e瑞年\u003c/strong\u003e：印象最深的一件事，应该就是组内有一个项目在上线前做最后的开发，由于和上海的团队有合作，组里集体去上海出差了2周，天天在上海的会议室里讨论\u0026amp;开发\u0026amp;联调。因为那个会议室里的椅子稍微有点差，感觉腰都要坐断了。不过好在最后还是赶在Dead Line之前把项目推上了线。真心话，当项目上线的那一刻，成就感，真的特别大！\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ5：你理解的基本功是什么？你平时怎么加强这方面的训练？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e瑞年\u003c/strong\u003e：我理解的基本功，更多的是在工作中需要具备的一些通用能力，比如写作能力、沟通能力等等。这些通用的基本功，对我们工作的影响其实特别大。我认为，练习一样技能最好的方式是展现给别人看。比如写作基本功，你要就把自己写的技术文档发给别人看；沟通基本功，就自己尝试去做一些技术分享，或者组织一些小型的讨论。只有这样，才能快速成长。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ6：作为美团的新生力量，公司主要为你们提供了哪些方面的培养？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e瑞年\u003c/strong\u003e：公司的入职培训，我觉得还是挺有帮助的。毕竟是校招生第一次步入社会，入职培训的那一周能让帮助我快速了解我们公司的文化，结交一些新的小伙伴，快速适应这个陌生的环境。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ7：平时有哪些爱好？这些爱好对自己有什么影响？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e瑞年\u003c/strong\u003e：我个人比较喜欢音乐和运动，工作之余会打打架子鼓，然后就是跑步、游泳。去年冬天，开始接触滑雪。我认为培养工作之外的一个爱好特别重要，因为在工作中，我们难免会遇到一些不顺心的事情，职场中也总会伴有一些压力。而工作之外的这些爱好，对我们调解自身的状态特别有帮助。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ8：五四青年节，对在校的学弟学妹们有什么想说的话？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e瑞年\u003c/strong\u003e：好好珍惜在校的时光，毕竟工作之后就没那么多假期了。除了上面这个玩笑之外，还想跟学弟学妹们说，毕业找工作时，一定要提早准备，多接触一些公司，多思考、多比较。最后祝学弟学妹们都能找到理想的工作。\u003c/p\u003e\u003ch2 id=\"简单-专注-好好学习-每天前进30公里\"\u003e简单，专注，好好学习！每天前进30公里\u003c/h2\u003e\u003cp\u003e\u003cimg src=\"https://p0.meituan.net/travelcube/da5de9fe73722069c6e632381b9e07c51208718.png\" alt=\"\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ1：毕业时，你应该拿到了不少Offer，为什么最后选择了美团？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e孙喆\u003c/strong\u003e：我觉得工作中最重要的还是选择跟什么样的人在一起学习和做事吧。我选择美团的一个重要原因就是面试官特别好！我当时前后经历了三轮面试，面试的过程愉悦又轻松，但问的问题确又实实在在，能感受到面试官为面试也做了非常多的准备、专业性很强；有一轮面试，多位面试官参加，在跟他们的交互中，也能感受到我们美团内部的氛围非常好。在发Offer的阶段，面试官（同时也是我现在的Buddy）还针对工作内容跟我沟通了一次，确定工作内容是我所喜欢的，也能感受到美团对校招生的择业方面还是非常负责任的。\u003c/p\u003e\u003cp\u003e还有一个原因是，这是我毕业后初入职场的第一份工作，因此也十分重视公司对人的培养，而美团在这方面有完善的培养机制，为每位新人都配备导师，可以实现短期快速成长。因此我就十分欢快地加入了。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ2：在美团众多的企业理念中，哪一条对你影响比较大？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e孙喆\u003c/strong\u003e：我对「每天前进三十公里」印象倒是很深刻。我查了资料，这个其实来源于美团2周年公司年会上，兴哥讲的南极探险的故事，「有两支训练有素的队伍去南极探险。阿蒙森团队充分评估了环境，对困难有足够的预料，做足了准备，不管天气好坏每天坚持前进30公里，最后成功抵达南极并安全返程。相较之下，同行的斯科特队则因为对环境的评估不足，而且执行计划率性而为：天好时冒进，天恶时滞留，最终长眠南极无一生还」（美团同学基本都知道～但还是贴在这里了）。我觉得这个就是在说目标、学习和持续。相比于研究生期间在某一个领域进行「突破」，现在的工作要求我兼备知识的广度和深度，需要学习的还很多，希望自己可以坚定地每天前进30公里，然后建立完整的计算机知识体系。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ3：工作中，典型的一天是怎么度过的？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e孙喆\u003c/strong\u003e：我是在特殊的疫情防范时期加入美团的，所以典型的一天会从每日报平安\u0026amp;早会开始，通过会议做好昨日的工作总结，也逐步了解部门的工作进展。早会后，我会做个简单的工作规划，我的工作主要涉及技术战略和学术合作两部分，所以在排优先级后会集中精力阅读论文、技术报告等，完成一些需要注意力集中的工作。最近，我正沉浸在AI的知识海洋里，对技术前沿动态进行追踪。同时，每天也会预留部分时间处理需要协同和沟通的工作，非常的充实！\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ4：工作以后，最自豪或者印象最深刻的一件事是什么？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e孙喆\u003c/strong\u003e：从0到1搭建了美团博士后工作站的管理和运营。\u003c/p\u003e\u003cp\u003e我加入美团的阶段正好是美团博士后工作站成立不久，但部门没有把我视为一个「新人」，而是让刚入职不久的我来主R这方面的工作，部门的小伙伴则是帮助我、协助我。从最初的内部征集需求，整理发布招聘启示，制定管理细则，再到同高校科研机构沟通、多部门协作，并成功组织了两名博士的入站答辩。在整个流程中，我也学到了很多，也初步看到了一些结果。未来，我也会负责博士后站的运营，让每位博士后的科研、业务产出最大化，有一种我与「美团博士后工作站」共同成长的感觉，还是很挺成就感的。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ5：你理解的基本功是什么？你平时怎么加强这方面的训练？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e孙喆\u003c/strong\u003e：我理解的基本功，是一个人说话、办事的底层思维逻辑和习惯，扎实的基本功最后的输出可能是高效的沟通、逻辑分明主次明显有论据有结论的文档记录、对工作环节进行拆分规划和有条不紊的执行，以及「凡事有交代，件件有着落，事事有回音」等等。这些输出的多了，大家都会知道你是一个靠谱的人儿。\u003c/p\u003e\u003cp\u003e除了学习美团内部基本功相关课程、阅读推荐书籍等方式之外，我认为意识到自己和别人的差距，并在实践中加以改进、不断尝试，直至养成为习惯也是培养基本功的好方式，毕竟美团真的有好多优秀的同学，而且古语有云：「纸上得来终觉浅，得知此事要躬行。」\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ6：作为美团的新生力量，公司主要为你们提供了哪些方面的培养？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e孙喆\u003c/strong\u003e：对校招新人，公司提供了新人必修课——萌芽计划新员工培训，内容涵盖公司历史和文化，还有写作、沟通、高效能人士的七个习惯、学会提问、金字塔原理等课程。这些有助于我们在初期快速建立对公司的认知，同时对「基本功」有了初步的概念，也有助于我们这些职场「萌新」向职场「达人」的蜕变。\u003c/p\u003e\u003cp\u003e此外，公司还有很多的「选修课」，一方面，互联网+大学提供了技术、产品、运营、商分等类别下各式各样的在线课程。另一方面，在美团「积累」是一种习惯，我发现学城（美团内部WiKi）里也有很多宝藏，很多「复盘」和「总结」中的经验和教训，也相当于工作中的「避坑指南」。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ7：平时喜欢读书吗？哪本对自己影响比较大？平时有哪些爱好？这些爱好对自己有什么影响？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e孙喆\u003c/strong\u003e：影响最大的怕不是《五年高考三年模拟》（抖个机灵）。我还是个科幻迷，喜欢《三体》～～\u003c/p\u003e\u003cp\u003e爱好的话，古筝应该算一个，小学的时候开始学，坚持了好多年，后来又学习了古琴，极大地培养了我「静下来、专注下来」的能力。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ8：五四青年节，对在校的学弟学妹们有什么想说的话？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e孙喆\u003c/strong\u003e：简单，专注，好好学习，然后每天前进30公里！\u003c/p\u003e\u003ch2 id=\"能和一个公司一起变得更牛逼-是另一种优秀\"\u003e能和一个公司一起变得更牛逼，是另一种优秀\u003c/h2\u003e\u003cp\u003e\u003cimg src=\"https://p0.meituan.net/travelcube/09e7fdc4ab83dba3ced75310af4ef1af679352.png\" alt=\"\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ1：毕业时，你应该拿到了不少Offer，为什么最后选择了美团？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e江华\u003c/strong\u003e：能加入牛逼的公司，是一种优秀；能和一个公司一起变得更牛逼，是另一种优秀。美团是一家高速发展的公司，我想亲眼见证美团发展成为阿里、腾讯这种规模的大公司。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ2：在美团众多的企业理念中，哪一条对你影响比较大？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e江华\u003c/strong\u003e：长期有耐心。我所在的部门AI平台-NLP中心更加注重基础能力的建设与积累。我们的项目在落地到各个不同的业务上周期也更长。如果耐不住性子或急于表现，很多需要深耕的问题就没人处理，做起事来容易半途而废。同时用户对产品使用的认知中存在「用户不知道产品没有XX功能」、「用户知道产品没有XX功能」，我们需要对这些问题攻坚，以客户为中心，不断提升用户的使用体验，也少不了「长期有耐心」。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ3：工作中，典型的一天是怎么度过的？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e江华\u003c/strong\u003e：制定日计划，对齐周计划，调整优先级。Coding+Debug+Discuss，然后是总结反思。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ4：工作以后，最自豪或者印象最深刻的一件事是什么？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e江华\u003c/strong\u003e：我们从零开始做的创新性项目，然后各种「黑科技」上线到大众点评，能和身边的人骄傲地说我做了里面的哪些模块。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ5：你理解的基本功是什么？你平时怎么加强这方面的训练？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e江华\u003c/strong\u003e：培养认真负责靠谱的处事态度，积累过硬的专业技能，学习高效的沟通交流能力。平时，以人为镜，多和Mentor、同事交流，向评价高的同学看齐。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ6：作为美团的新生力量，公司主要为你们提供了哪些方面的培养？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e江华\u003c/strong\u003e：感谢公司平台给我们提供了很大的成长机会。当前，我参与了一个创新性的项目，在美团和部门的强力后盾下，使得我们能够不用畏惧创业公司由于缺乏流量导致项目夭折的风险，能够全身心地投入基础能力的积累与建设上。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ7：平时喜欢读书吗？哪本对自己影响比较大？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e江华\u003c/strong\u003e：明人不说暗话，不太喜欢读书。其实，看的最多的还是技术书。但最近我也尝试跳出自己的舒适区，多看看文学类书籍、人物传记和美团的「四大名著」。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ8：五四青年节，对在校的学弟学妹们有什么想说的话？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e江华\u003c/strong\u003e：想对他们说，科研项目和真实工作有很大的不同。科研过程中往往会对很多外界条件做理想化的约束，但是真实工作中，可能各种依赖因素都是欠缺的，做事的方式也会很不一样，需要及时调整好心态，学习更多的软实力。\u003c/p\u003e\u003cp\u003e大家需要珍惜每次的挫折与失败，社会是残酷的，竞争是激烈的，只有哭过笑过，才能做到独当一面。要相信，未来终究是我们的！\u003c/p\u003e\u003ch2 id=\"保持理想-保持健康-追求卓越\"\u003e保持理想，保持健康，追求卓越\u003c/h2\u003e\u003cp\u003e\u003cimg src=\"https://p0.meituan.net/travelcube/74928d92a35896ab42616996944c4a4c1079061.png\" alt=\"\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ1：毕业时，你应该拿到了不少Offer，为什么最后选择了美团？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e成良\u003c/strong\u003e：首先，校招的整个面试体验很好，面试官的专业能力非常强， 探讨的问题都很深入，也给了我一些很好的建议，在这个过程中感受到美团的技术实力和工作效率。然后在拿到Offer后，我又与团队Leader多次交流，对组内的技术要求和工作方向有更进一步的了解。我觉得这个岗位很有挑战，也很有价值，也相信在美团这样的环境中，自己可以成长得更快。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ2：在美团众多的企业理念中，哪一条对你影响比较大？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e成良\u003c/strong\u003e：「追求卓越」和「长期有耐心」这两点吧。我认为，追求卓越是一个公司能够向前发展的保障，同时也是一个优秀的人应该具备的品质，追求卓越的过程往往充满挑战，也就更加需要长期有耐心的努力。\u003c/p\u003e\u003cp\u003e我觉得每一个平凡的工作日都是在践行这两个理念吧。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ3：工作中，典型的一天是怎么度过的？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e成良\u003c/strong\u003e：早上到公司后查看邮件，确认线上流程正常运行。然后制定一天的工作计划，按照重要优先级处理。下班前复盘当天的计划完成情况。挤出的碎片时间，看技术方案、博客或论文。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ4：工作以后，最自豪或者印象最深刻的一件事是什么？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e成良\u003c/strong\u003e：是我入职后负责的第一个项目，利用深度学习预估骑手配送路线及时间。项目整体难度很大，同时业界几乎没有可参考的案例。在项目进程中，我克服了很多困难，取得每一个阶段性的成果都很有成就感。在技术得到提升的同时，也对业务有了更深入的理解。这期间非常感谢Leader和导师的耐心指导，以及同事们的各种帮助。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ5：你理解的基本功是什么？你平时怎么加强这方面的训练？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e成良\u003c/strong\u003e：我理解算法开发工程师的基本功主要体现在以下几个方面：\u003c/p\u003e\u003cul\u003e\u003cli\u003e业务理解能力是前提，只有真正理解业务，才能有合理的、明确的目标，一个正确的方向是成功的一半；\u003c/li\u003e\u003cli\u003e技术能力是核心，这里包括数据挖掘分析能力，针对具体问题的合理建模能力和较强的工程实现能力；\u003c/li\u003e\u003cli\u003e时间管理能力、情绪控制能力、沟通推动能力等软实力也是重要的基础。\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e平时我会有意识地思考自己的短板，技术上多去看相关的资料，思考底层的原理和关联性。其他的软实力，在工作和生活中逐步锻炼。另外，多读一些书也很有帮助。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ6：作为美团的新生力量，公司主要为你们提供了哪些方面的培养？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e成良\u003c/strong\u003e：公司对每个岗位的同学都有一套明确的培养体系，从深度和广度上培养员工的能力，我觉得在这种培养体系下，可以明确自己目前的定位和未来的发展方向，这对我的职业规划是非常有帮助的。除此之外，公司还提供了各种培训，从价值观、软实力增强到各种技术课程，只要想学就会有很多的机会。如果说建议的话，感觉技术培训可以做的更加系统一些。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ7：平时喜欢读书吗？哪本对自己影响比较大？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e成良\u003c/strong\u003e：目前正在努力让读书成为日常习惯，读过的书中，《平凡的世界》和《少有人走的路》这两本书对我的影响比较大，虽然很经典了，也不必多言，但还是想推荐给大家。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ8：五四青年节，对在校的学弟学妹们有什么想说的话？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e成良\u003c/strong\u003e：第一，培养好的生活和学习习惯，早睡早起；第二，锻炼独立思考的能力；第三，潜心在自己的领域做深入的研究。\u003c/p\u003e\u003cp\u003e最后，保持理想，保持健康，追求卓越。\u003c/p\u003e\u003ch2 id=\"前行路上-我们都在努力成为更好的自己\"\u003e前行路上，我们都在努力成为更好的自己\u003c/h2\u003e\u003cp\u003e\u003cimg src=\"https://p1.meituan.net/travelcube/d3aac41844e3805fa83d324ba081e5121187888.png\" alt=\"\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ1：毕业时，你应该拿到了不少Offer，为什么最后选择了美团？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e石英\u003c/strong\u003e：首先，我一直在使用美团、大众点评等App，当时能够感觉到这些产品的用户体验、用户行为数据和UGC数据都有非常高的质量，对于做算法方向的我而言，一家有着大规模、优质数据、真实落地场景的公司是非常具有吸 引力的。其次，美团的整个面试流程简洁明了，各个面试官和Leader都非常Nice，正如我现在的感受一样，我选择了一个积极进取、有目标、有良好氛围的团队。最后，美团在生活服务领域有 很好的用户基础和用户认知，我相信美团未来会做的越来越好，发展潜力也比较大。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ2：在美团众多的企业理念中，哪一条对你影响比较大？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e石英\u003c/strong\u003e：印象最深的就是「我不会，但我可以学」，自从我开始接触计算机，就一直主动或被动的在践行这一条。初中毕业开始接触编程，不会就得自己反复啃书学习。到后来算法竞赛，面对一个个问题，面对一个个算法，面对各种各样优雅的解题思路和实现方式，不会、不理解，还是反复地查资料自学。离开学校步入职场，需要学的除了专业知识和技能，还有沟通、合作、项目管理等等，每天都在学习。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ3：工作中，典型的一天是怎么度过的？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e石英\u003c/strong\u003e：早上把战场摆好（电脑、键盘、屏幕、白开水……），然后看看一周计划和前面进展，确定今天的To Do。一天处理的事务主要分两类事情：偏技术、工程的，根据需求写代码、调程序；偏需求、业务或者沟通的，大象直接连续对接人或者拉会，会前做好准备，会后做好记录和同步。午餐、晚餐一般按时吃，和几个同事一起唠唠嗑，也可能唠唠正在推进的工作。饭后一般会大家一起遛个弯，坐太久了体重容易Hold不住……\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ4：工作以后，最自豪或者印象最深刻的一件事是什么？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e石英\u003c/strong\u003e：工作以来，印象深刻也是比较自豪的事情，应该算是完成了「统一分词器」，并且在DQU项目全量上线，影响着美团大搜和点评大搜每天十亿次的请求。因为「统一分词器」是一个很基础的信号， 并且对性能要求很高，必须用尽可能基础的、底层的实现方式进行优化，能把这个项目推进到现在的阶段，并且在线上稳定运行，也是一种对我自己「码力」的锻炼和检验。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ5：你理解的基本功是什么？你平时怎么加强这方面的训练？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e石英\u003c/strong\u003e：我理解的基本功主要归为两个方面：\u003c/p\u003e\u003cul\u003e\u003cli\u003e硬能力，当然是指技术方面的基本功，「码力」靠练习与借鉴他人的优秀代码，算法靠学习与思考、对比现有的算法方案。\u003c/li\u003e\u003cli\u003e软能力，例如沟通能力、项目管理等，这些需要平时多观察，多换位思考，择其善者而从之，其不善者而改之。\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eQ6：作为美团的新生力量，公司主要为你们提供了哪些方面的培养？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e石英\u003c/strong\u003e：公司有统一的入职培训，能够帮助我们了解公司的文化、制度和技术栈。小组内有对应的Mentor能指导我们熟悉环境、开展工作；也很感谢领导能够放手让我直接参与主要的项目之中，能快速的适应公司的工作流程，也能收获到最实用的技能。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ7：平时喜欢读书吗？哪本对自己影响比较大？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e石英\u003c/strong\u003e：技术类的书就不多说了。之前有读到《人性的弱点》，这本书里对于许多人性或者说人们潜意识的想法、感受、反映有一个很好的剖析，并且大多是我们日常生活、工作中容易忽视却非常重要的方面，对于沟通、人际交往都有不小的启发。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ8：五四青年节，对在校的学弟学妹们有什么想说的话？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e石英\u003c/strong\u003e：首先想到了两个词：怀念和羡慕。学弟学妹们可以好好珍惜在学校的时间，不管是学习、实习，或者出去走走看看都是极好的；然后有一个小建议：早点明确下一阶段的目标，并且尽量早点去 了解和准备，这也是我能幸运地加入美团NLP中心的秘诀。\u003c/p\u003e\u003cp\u003e前行路上，我们都在努力成为更好的自己。\u003c/p\u003e\u003ch2 id=\"仰望天空-脚踏实地\"\u003e仰望天空，脚踏实地\u003c/h2\u003e\u003cp\u003e\u003cimg src=\"https://p0.meituan.net/travelcube/af97999b0ec37734fb19b1c6e5f4bbc61103696.png\" alt=\"\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ1：毕业时，你应该拿到了不少Offer，为什么最后选择了美团？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e世奇\u003c/strong\u003e：我选择了无人车行业。首先，我认为美团是最有希望做成无人车的公司之一。其次，美团的技术氛围在业内有很好的口碑。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ2：在美团众多的企业理念中，哪一条对你影响比较大？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e世奇\u003c/strong\u003e：「长期有耐心」对我影响比较大。因为我们现在做的事情在整个行业来看，都不是短时间内可以完成很大的技术飞跃，我们也会经常听到「质疑」的声音，如果不对未来有坚定的信心，确实很难坚持下来。只有长期有耐心，对未来有信心，才能把技术做强，比别人做的更深、更专。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ3：工作中，典型的一天是怎么度过的？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e世奇\u003c/strong\u003e：早上过来，我会先对今天的工作任务做下梳理，思考好实现细节，然后开始开发代码。期间也会对高优突发的Case进行分析、处理。一天中也要抽空关注业内动态，学习前沿技术。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ4：工作以后，最自豪或者印象最深刻的一件事是什么？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e世奇\u003c/strong\u003e：2019年11月份，我们拿到了北京自动驾驶路测牌照。整个团队经过几个月的努力，解决了很多难题，最终顺利通过测试。在拿到牌照的时候，大家还是非常激动的，能够在这样强劲的技术团队做出自己的贡献，自己也感觉到很自豪。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ5：你理解的基本功是什么？你平时怎么加强这方面的训练？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e世奇\u003c/strong\u003e：日常可以用到的技能都是基本功，比如专业技能、沟通技能等，加强这些技能都可以提升自己的工作效率。一般我会通过阅读相关书籍、参加技术分享来了解相关技能，然后在实践中尝试这些新技能，进而达到提升基本功的目的。美团也有句老话，「仰望天空，脚踏实地」。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ6：作为美团的新生力量，公司主要为你们提供了哪些方面的培养？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e世奇\u003c/strong\u003e：帮助还是挺大的。通过「萌芽计划」让自己对美团文化有了非常深刻的认识，导师制也帮助自己更加快速地融入团队。如果说建议的话，希望后期可以增加一些网上授课。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ7：平时喜欢读书吗？哪本对自己影响比较大？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e世奇\u003c/strong\u003e：《学会提问》，用批判性眼光看待问题。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ8：五四青年节，对在校的学弟学妹们有什么想说的话？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e世奇\u003c/strong\u003e：夯实基础，对新鲜事物、前沿技术保持好奇心。我们是「八九点钟的太阳」，有幸与大家一起共筑辉煌。\u003c/p\u003e\u003ch2 id=\"谋定而后动-做事有头尾\"\u003e谋定而后动，做事有头尾\u003c/h2\u003e\u003cp\u003e\u003cimg src=\"https://p1.meituan.net/travelcube/ca6ed0c5829853319a18dd4bc6d429971344158.png\" alt=\"\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ1：毕业时，你应该拿到了不少Offer，为什么最后选择了美团？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e漆毅\u003c/strong\u003e：首先，我投的公司并不多，毕业时在手的Offer不算多。选美团是因为感受到了美团对校招生的重视。当时面试通过以后，部门专门邀请我们去公司，给我们讲部门具体在做什么、现状如何，后续发展如何。然后个人对整个业务前景也比较认可。既然各家Offer的硬条件都差不多，当然要选一个自己最有好感、也最认可的，最后就选择了我团。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ2：在美团众多的企业理念中，哪一条对你影响比较大？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e漆毅\u003c/strong\u003e：长期有耐心。工作中生活中的事情，能不能在觉得「山穷水尽」时继续坚持，最终迎来「柳暗花明」，关键很看人的耐心够不够，信心足不足。有耐心总是好事。\u003c/p\u003e\u003cp\u003e因为我参加工作不到一年，这里只能举一个稍显单薄的例子。我在广告平台具体做CTR预估的算法工作，最近的一个项目是使用增量学习的方式去优化模型。最初入手时，发现换了优化方式后，模型效果大降，不符合预期。后来也是花费了比较多的时间，从代码Bug、模型参数等等层面看是什么原因，最后定位是输入数据的处理方式需要做适当调整。这个过程需要一定「水磨豆腐」的耐心功夫。当然回头来看，这也使我对「模型效果取决于数据」这句话有了更为深刻的理解。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ3：工作中，典型的一天是怎么度过的？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e漆毅\u003c/strong\u003e：每天到公司后，会先看看夜间的线上任务，确保正常。然后列一列昨日未结事项和今日必做清单，此后就按照计划一项一项去做。如果涉及到沟通合作的事情，就要和相关同事协调时间讨论沟通。因为是做数据相关工作，最近也有意识地多去探索、观察数据。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ4：工作以后，最自豪或者印象最深刻的一件事是什么？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e漆毅\u003c/strong\u003e：工作上的话，印象比较深刻的是第一个模型上线。跟着Mentor走完整个流程，最后成功上线，也有一个不错的结果，还是很开心的。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ5：你理解的基本功是什么？你平时怎么加强这方面的训练？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e漆毅\u003c/strong\u003e：我理解是「谋定而后动」，做事有头尾。在做一件事之前，都先想清楚为什么要做这件事。然后也多和同事、Leader沟通，对齐目标，争取得到最大的帮助。一旦定好目标计划，开始执行，技术层面就靠一些硬功夫，如代码能力、数据分析能力、业务指标理解程度等等，保障能逐步推进，获得有效输出。平时，我主要还是从具体的项目实施中去加强这方面锻炼。在具体的项目制定和推进过程中，注意每天或隔天都有小目标和小回顾，也在合适时与团队沟通、对齐。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ6：作为美团的新生力量，公司主要为你们提供了哪些方面的培养？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e漆毅\u003c/strong\u003e：公司提供的培养方面，帮助最大的无疑是新人培养计划。部门为每个新入职的同事分配了一名Mentor，帮助熟悉工作、融入团队。这里要特别感谢我的Mentor，他的业务、技术厉害不说，还超有耐心。\u003c/p\u003e\u003cp\u003e其他培养的话，我印象比较深的有互联网+大学的一些课程，这些课程都是由公司内同事或公司邀请外部大牛来讲述，是很好的沟通与学习的机会。对于一个技术新人来说，目前，我们收到的课程推送主要是技术方面的课程信息。而公司层面一直很强调业务理解和业务价值，因而我觉得针对这部分内容，可以考虑对技术同学推送业务相关的一些基础课程。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ7：平时喜欢读书吗？哪本对自己影响比较大？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e漆毅\u003c/strong\u003e：平时会读一些书，小说啊诗歌啊之类，比较放松。来美团后看了美团「四大名著」之一的《高效能人士的七个习惯》。特别欣赏其中一条，叫「以终为始」。结合公司强调的基本功训练，我理解就是定好目标，完善计划，并妥善执行。说来容易，动手艰辛，还是一定要耐心够、干劲足才行。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ8：五四青年节，对在校的学弟学妹们有什么想说的话？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e漆毅\u003c/strong\u003e：真的是很羡慕大家，还是挺怀念在学校的日子的。如果说有什么贴近实际的建议，那就是学弟学妹们在找工作时，能多就多投，不要给自己的选择设限。面试也是一个互相了解的过程。当然也欢迎大家多投美团，已经有很多学长学姐，在美团的各个岗位上发挥出个人的价值，特别欢迎大家来广告平台。\u003c/p\u003e\u003cp\u003e这些日子，全球各方面冲突加剧，显得动荡不安。在这样的环境下，我们每个个体看重什么，做什么样的选择，更需要三思。\u003c/p\u003e\u003ch2 id=\"不拘泥于眼前的得失-把控未来五年-十年的变化与发展\"\u003e不拘泥于眼前的得失，把控未来五年、十年的变化与发展\u003c/h2\u003e\u003cp\u003e\u003cimg src=\"https://p0.meituan.net/travelcube/b77bb1d5a0a04969766ce86f6db75c9d746133.png\" alt=\"\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ1：毕业时，你应该拿到了不少Offer，为什么最后选择了美团？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e佳昊\u003c/strong\u003e：我在2018年7月份参加美团的面试，11月份决定加入美团，期间历时4个月的时间。在这期间，我和我的Leader一直在沟通交流，他的坦诚、思考问题的方式、还有他之前在学术界取得的成果深深吸引并打动了我。\u003c/p\u003e\u003cp\u003e此外，在等待Offer期间，部门负责人王仲远还特地为我们校招生开了「保温party」，真实详细且毫不避讳地介绍了部门已有的成果和不足，部门的目标和战略，以及未来的方向。让我认识到，搜索与NLP部门是一个由使命感驱动的团队，是一个可以专心做事的地方。因此，我选择加入了美团。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ2：在美团众多的企业理念中，哪一条对你影响比较大？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e佳昊\u003c/strong\u003e：长期有耐心。在工作期间愈发体会到这5个字的分量。在发展如此快速的互联网行业，大部分人都期望可以快速拿到产出。但「贪心」算法告诉我们，「步步最优，不一定全局最优」。所谓「长期有耐心」，需要我们把目光放的长远，准确把控未来五年、十年的变化与发展，不拘泥于眼前的得失。如果没有一定的战略眼光和知识储备，是无法做到这一点的。当然，也深感自己要学习的还有太多。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ3：工作中，典型的一天是怎么度过的？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e佳昊\u003c/strong\u003e：到公司查看邮件，确定会议时间，做好会议准备。下午到晚上，会专心解决一些复杂的问题。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ4：工作以后，最自豪或者印象最深刻的一件事是什么？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e佳昊\u003c/strong\u003e：我参与的一个项目是改善美团大搜中的相关性问题。当自己的方法上线后，可以切实感受到相关性问题得到了明显的改善，感到很自豪。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ5：你理解的基本功是什么？你平时怎么加强这方面的训练？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e佳昊\u003c/strong\u003e：基本功是工作的日常。发送邮件、大象沟通、写代码注释、做Slides、面对面沟通等等。我最近在锻炼自己的写作能力：\u003c/p\u003e\u003cul\u003e\u003cli\u003e把问题定义清楚。不同的人对同一个词的定义会不一样，容易造成歧义。\u003c/li\u003e\u003cli\u003e减少「口语化」的表述。减少Buzzy Words。力求精炼、准确、无误。\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eQ6：作为美团的新生力量，公司主要为你们提供了哪些方面的培养？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e佳昊\u003c/strong\u003e：美团「萌芽计划」封闭培训，让我了解了公司的历史、文化还有价值观，对公司产生了更大的归属感。还有就是互联网+大学的课程，帮助我快速地学习，提升自己的技术。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ7：平时喜欢读书吗？哪本对自己影响比较大？平时有哪些爱好？这些爱好对自己有什么影响？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e佳昊\u003c/strong\u003e：《原则》，这本书很多大佬都推荐过。还有就是打「桌游」，能够培养自己的逻辑能力，识别逻辑陷阱。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ8：五四青年节，对在校的学弟学妹们有什么想说的话？\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e佳昊\u003c/strong\u003e：对于非毕业生，建议大家学好知识，打好基础。大学生活很精彩，学习是其中最重要的一部分。对于毕业生，在选择第一份工作时，不要只考虑薪酬，还要考虑未来3到5年的发展。希望大家早日做好个人规划，多跟部门同事或者未来的Leader进行沟通。也欢迎大家加入美团，和优秀的人一起做非凡的事。\u003c/p\u003e\u003cp\u003e最后引用鲁迅先生的一句话：「愿中国青年都摆脱冷气，只是向上走，不必听自暴自弃者流的话。能做事的做事，能发声的发声。有一分热，发一分光。就令萤火一般，也可以在黑暗里发一点光，不必等候炬火。」跟同学们共勉。\u003c/p\u003e\u003ch3 id=\"致敬青年\"\u003e致敬青年\u003c/h3\u003e\u003cp\u003e今天，在这个属于青年的特殊日子里，我们向所有的青年才俊说一声：大家辛苦了！\u003c/p\u003e\u003cp\u003e因为有你，我们青春无限。\u003c/p\u003e\u003cp\u003e因为有你，我们不畏艰难。\u003c/p\u003e\u003cp\u003e因为有你，我们纵情向前！\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "Date": "2020-05-04T00:00:00Z",
  "Author": "soulteary@gmail.com"
}