{
  "Source": "tech.meituan.com",
  "Title": "自动驾驶轨迹预测算法：NeurIPS挑战赛冠军方案",
  "Link": "https://tech.meituan.com/2021/02/01/neurips-2020-interaction-prediction.html",
  "Content": "\u003cdiv class=\"post-content\"\u003e\u003cdiv class=\"content\"\u003e\u003cp\u003e\u003cimg src=\"https://p0.meituan.net/travelcube/3bfebe7087bce63fd062f5650167f46d1307778.jpg\" alt=\"\"/\u003e\u003c/p\u003e\u003ch2 id=\"05-参考文献\"\u003e05 参考文献\u003c/h2\u003e\u003cul\u003e\u003cli\u003e[1] Alahi A, Goel K, Ramanathan V, et al. Social lstm: Human trajectory prediction in crowded spaces[C]//Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 2016: 961-971.\u003c/li\u003e\u003cli\u003e[2] Gupta A, Johnson J, Fei-Fei L, et al. Social gan: Socially acceptable trajectories with generative adversarial networks[C]//Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 2018: 2255-2264.\u003c/li\u003e\u003cli\u003e[3] Zhu Y, Qian D, Ren D, et al. StarNet: Pedestrian trajectory prediction using deep neural network in star topology[C]//Proceedings of the IEEE/RSJ International Conference on Intelligent Robots and Systems. 2019: 8075-8080.\u003c/li\u003e\u003cli\u003e[4] Chai Y, Sapp B, Bansal M, et al. Multipath: Multiple probabilistic anchor trajectory hypotheses for behavior prediction[J]. arXiv preprint arXiv:1910.05449, 2019.\u003c/li\u003e\u003cli\u003e[5] Chang M F, Lambert J, Sangkloy P, et al. Argoverse: 3d tracking and forecasting with rich maps[C]//Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 2019: 8748-8757.\u003c/li\u003e\u003cli\u003e[6] Liang J, Jiang L, Niebles J C, et al. Peeking into the future: Predicting future person activities and locations in videos[C]//Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 2019: 5725-5734.\u003c/li\u003e\u003cli\u003e[7] Mohamed A, Qian K, Elhoseiny M, et al. Social-STGCNN: A Social Spatio-Temporal Graph Convolutional Neural Network for Human Trajectory Prediction[C]//Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition. 2020: 14424-14432.\u003c/li\u003e\u003cli\u003e[8] Liang M, Yang B, Hu R, et al. Learning lane graph representations for motion forecasting[C]//European Conference on Computer Vision. Springer, Cham, 2020: 541-556.\u003c/li\u003e\u003cli\u003e[9] Huang Y, Bi H K, Li Z, et al. STGAT: Modeling spatial-temporal interactions for human trajectory prediction[C]//Proceedings of the IEEE International Conference on Computer Vision. 2019: 6272-6281.\u003c/li\u003e\u003cli\u003e[10] Gao J, Sun C, Zhao H, et al. VectorNet: Encoding HD maps and agent dynamics from vectorized representation[J]. arXiv preprint arXiv:2005.04259, 2020.\u003c/li\u003e\u003cli\u003e[11] Zhao H, Gao J, Lan T, et al. Tnt: Target-driven trajectory prediction[J]. arXiv preprint arXiv:2008.08294, 2020.\u003c/li\u003e\u003c/ul\u003e\u003ch2 id=\"06-作者简介\"\u003e06 作者简介\u003c/h2\u003e\u003cp\u003e炎亮、傅 壮、德恒、冬淳，均为美团无人车配送中心算法工程师。\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "Date": "2021-02-01T00:00:00Z",
  "Author": "soulteary@gmail.com"
}