{
  "Source": "tech.meituan.com",
  "Title": "想进美团不知道选哪个技术岗位？这里有一份通关秘籍！",
  "Link": "https://tech.meituan.com/2020/03/26/meituan-tech-corporate-recruitment.html",
  "Content": "\u003cdiv class=\"post-content\"\u003e\u003cdiv class=\"content\"\u003e\u003cp\u003e春暖花开，美团春招已经启动，针对校招和社招开放了几千个职位，其中很大部分都是技术岗位。\u003c/p\u003e\u003cp\u003e随着互联网的高速发展，技术岗位在不断地细分，比如软件开发不仅分为前端和后端，前端会分为Web、iOS和Android三个方向，后端又分为后台、系统、数据等。现在异常火爆的AI方向更是让人「眼花缭乱」，深度学习、数据挖掘、NLP、人脸识别、知识图谱等等。那么，我们应该如何更好地选择适合自己的技术岗位呢？\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://p1.meituan.net/travelcube/4e2f8686df16e8044fe5890ef16c450c46449.png\" alt=\"\"/\u003e\u003c/p\u003e\u003cp\u003e今天我们就逐一介绍各个技术岗位的区别以及对应的岗位要求，然后再解读一下美团面试官会考核的基本能力和软素质，最后我们还附上了来自美团学长学姐的建议，希望这份「通关秘籍」能帮助大家对号入座，找到自己理想的工作。\u003c/p\u003e\u003ch2 id=\"一-美团技术团队分哪些专业方向\"\u003e一、美团技术团队分哪些专业方向？\u003c/h2\u003e\u003cp\u003e\u003cimg src=\"https://p0.meituan.net/travelcube/549bea967db67d2cd18beaf01ff093d439507.png\" alt=\"\"/\u003e\u003c/p\u003e\u003cp\u003e经过多年耕耘和沉淀，美团技术团队已经建成了比较完备的技术体系，有基于主流开源技术加自研的大数据、基础架构、复杂业务系统平台，以及比较完备的运维、安全、风控系统。目前，美团技术团队主要分成前端、后台、系统、数据、测试、运维、算法等技术方向（内部称为通道），每个方向下面又可能包括几种岗位。\u003c/p\u003e\u003cp\u003e特别要提醒大家注意的是，各个方向和岗位的竞争激烈程度每年是不一样的。今年的推荐算法和嵌入式系统、计算机视觉竞争比较激烈，而前端尤其是移动客户端开发、测试、硬件、安全、数据领域则相对平和。以下是2020年春季美团技术团队部分岗位（实习生）的投递录用比（已经收到的简历数：拟招聘的岗位数），供大家参考：\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://p0.meituan.net/travelcube/2e516b07757ae36ed8abb82582560da7177796.png\" alt=\"\"/\u003e\u003c/p\u003e\u003ch3 id=\"前端开发工程师\"\u003e前端开发工程师\u003c/h3\u003e\u003cp\u003e前端也称为大前端，分为Web前端和终端两大方向。作为连接用户和企业的技术工种，前端涉及的领域越来越广泛，已经不再局限于桌面、手机等环境。在目前大前端融合、5G的趋势下，想象空间越来越大，给前端工程师带来广阔的成长发展前景。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e选择前端的7大理由：\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e前端是最接近用户的技术团队，能够第一时间了解用户的需求，是那些对用户体验、交互感兴趣的同学的最佳选择。\u003c/li\u003e\u003cli\u003e前端是最容易成为全栈工程师及技术「多面手」的岗位。前端能快速实现原型、快速给用户推出新产品或者新的用户体验，很容易获得职业层面的成就感。\u003c/li\u003e\u003cli\u003e前端技术发展迅速，这里特别欢迎有创造力、有想法的同学，技术栈广，有众多的岗位选择和发展空间。\u003c/li\u003e\u003cli\u003e前端是美团技术团队中交流最广泛、交流渠道最多、交流氛围最好的团队，在这里你能够认识足够多的技术大牛，也提供足够大的舞台让有想法的同学去展现自己的风采。\u003c/li\u003e\u003cli\u003e相比有些学习曲线比较陡峭的技术岗位，前端的学习成长曲线相对平滑。因为绝大多数高校都不开设前端开发的相关课程，而且前端技术还在不断发展和更迭，前端开发领域对所有的新入门同学都比较友好，这是一片蓝海，等待有梦想的你去不断开拓。\u003c/li\u003e\u003cli\u003e前端是代码和视觉的结合，是技术和艺术的交融，前端能带给用户最简单直接、最炫酷的视觉享受和用户体验。\u003c/li\u003e\u003cli\u003e前端开发是目前互联网领域最炙手可热的技术方向之一，各个公司都高薪争夺前端领域的技术人才，未来可期。\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eWeb前端\u003c/strong\u003e\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e对应岗位名称：前端开发，Web前端开发。\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e\u003cstrong\u003e美团对前端工程师候选人重点考核的专业知识及专业技能\u003c/strong\u003e\u003c/p\u003e\u003col\u003e\u003cli\u003e\u003cstrong\u003e专业背景\u003c/strong\u003e：专业技能主要覆盖计算机专业的基础课程，包括数据结构、计算机组成原理、计算机网络、操作系统、数据库、软件工程、C++或Java编程语言等。此外，现在前端对算法的要求越来越高，在算法方面理解深刻的同学，会有加分。\u003c/li\u003e\u003cli\u003e\u003cstrong\u003e专业知识\u003c/strong\u003e：扎实的6项基础知识：HTML、CSS、JavaScript、移动Web开发、调试、HTTP网络知识。\u003c/li\u003e\u003cli\u003e\u003cstrong\u003e技术能力\u003c/strong\u003e：前端工程能力，构建和持续集成。特别是Coding能力，能够准确地理解需求，并快速实现高质量的代码。\u003c/li\u003e\u003cli\u003e\u003cstrong\u003e加分项\u003c/strong\u003e：掌握Web安全基础知识、浏览器组成及原理方面的基础知识，熟练使用常用的前端框架（React/Vue等）并对其原理有一定的认识。\u003c/li\u003e\u003c/ol\u003e\u003cp\u003e\u003cstrong\u003e终端\u003c/strong\u003e\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e对应岗位名称：iOS开发，Android开发，移动端开发，客户端开发。\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e目前，终端也称移动端、客户端，主要按两大平台分为Android开发和iOS开发。这个方向的优点是对同学们的经验要求较少，只要有较好的编程基础和比较扎实的计算机基础知识，都欢迎加入。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAndroid开发工程师\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e在过去十年中，Android已经成为和iOS并驾齐驱的移动开放平台。未来十年，Android必将在万物互联的生态中占据更加重要的位置，未来可期。虽然「移动端」的概念被提及的次数越来减少，但目前手机的应用市场中每天仍有几百万量级的App在活跃，而这都需要移动端工程师去开发完成。\u003c/p\u003e\u003cp\u003e此外，App是企业和用户交互的桥梁，直接影响用户体验以及用户对公司品牌的感受，其重要性不言而喻。在美团Android开发团队，你写的代码可以影响到数亿用户，你可以把一个个创新的想法，在亲人和朋友的手机上变成实实在在、可以看得见摸得着的界面，相信这一定会让你收获满满的成就感。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e美团对Android工程师候选人重点考核的专业知识及专业技能\u003c/strong\u003e\u003c/p\u003e\u003col\u003e\u003cli\u003e\u003cstrong\u003e专业背景\u003c/strong\u003e：了解计算机基础知识，包括计算机原理、操作系统、网络、算法等；\u003c/li\u003e\u003cli\u003e\u003cstrong\u003e技术知识\u003c/strong\u003e：重点强调Java，其次是C/C++和数据结构，这些是最基本的要求，然后是Android开发的基础知识；\u003c/li\u003e\u003cli\u003e\u003cstrong\u003e编码能力\u003c/strong\u003e：具备一定的编码能力，包括边界条件、编码风格等。\u003c/li\u003e\u003c/ol\u003e\u003cp\u003e\u003cstrong\u003eiOS开发工程师\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e如果你希望自己的工作成果被亿万人直接使用，那么就来做客户端吧！如果你觉得iPhone真香，那么就来做iOS开发工程师吧！在这里，你可以感受技术与体验的完美结合，在成就用户的同时成就自己。在美团，iOS工程师有着明确的培养路径，美团技术学院提供了丰富的技术文档和课程来帮助大家成长。值得一提的是，校招候选人不要求有iOS开发经验，只要具备良好的CS基础便可以。加入美团，我们会帮你快速成长为一名优秀的iOS工程师。\u003c/p\u003e\u003cp\u003e在美团技术团队，iOS工程师主要责任就是打造美团和大众点评等超级App，为它「添砖加瓦」。我们追求更高的代码质量，让Bug远离用户；我们追求更高的编程效率，可以让新功能更快地交付给用户。当然，在做完业务需求之余，你可以投身研究一些OC语言的特性、App的性能优化、Hybrid技术等等。你也可以探索一些工程层面的奥义，比如组件化、平台化、插件化、动态化、自动化，任君遨游。\u003c/p\u003e\u003cp\u003e目前，大家纷纷涌向人工智能、机器学习、图像识别等比较热门的技术领域，千军万马挤独木桥，其难度可想而知。殊不知iOS领域因近些年人才过度稀缺，市场发展前景非常好。更重要的是，当你成为一名iOS工程师以后，你将常年接触iOS与Mac系统，杜绝工作环境中的脏、乱、差，体验优雅、高效、丝滑的开发流程，这也将直接影响到你的生活习惯，让你变成一个有追求、有审美、有品位的「攻城狮」。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e美团对iOS工程师候选人重点考核的专业知识及专业技能\u003c/strong\u003e\u003c/p\u003e\u003col\u003e\u003cli\u003e\u003cstrong\u003e专业背景\u003c/strong\u003e：了解计算机基础知识，包括计算机原理、操作系统、网络等，这是客户端开发的通用技能；\u003c/li\u003e\u003cli\u003e\u003cstrong\u003e技术能力\u003c/strong\u003e：基本数据结构与算法，Coding能力；\u003c/li\u003e\u003cli\u003e\u003cstrong\u003e加分项\u003c/strong\u003e：对OC语言特性能够熟练掌握，了解跨端技术，有一定的技术广度。\u003c/li\u003e\u003c/ol\u003e\u003cp\u003e技术细节请参考美团前端方向的技术文章：\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003ca href=\"https://tech.meituan.com/2018/08/09/waimai-flutter-practice.html\"\u003eFlutter的原理及美团的实践\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://tech.meituan.com/2019/12/19/meituan-mrn-practice.html\"\u003eReact Native在美团外卖客户端的实践\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://tech.meituan.com/2018/11/01/swift-compile-performance-optimization.html\"\u003e深入剖析Swift性能优化\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://tech.meituan.com/2018/03/16/front-end-web-architecture.html\"\u003e美团点评金融平台Web前端技术体系\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://tech.meituan.com/2019/10/17/android-java-8.html\"\u003eAndroid 兼容 Java 8 语法特性的原理分析\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003ch3 id=\"后台-系统开发工程师\"\u003e后台/系统开发工程师\u003c/h3\u003e\u003cblockquote\u003e\u003cp\u003e对应岗位名称：Java开发，后端开发，系统开发，服务端开发。\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e后端在美团又分为后台和系统两个方向。这是最体现以互联网技术改造实体经济的方向。\u003c/p\u003e\u003cp\u003e后台方向总体偏to C（消费者）的产品系统及其依赖的基础平台的研发，包括但不限于：Web API、商品/库存/价格系统、交易系统、促销引擎、支付系统、评价系统、存储系统、消息队列、OCTO、计算平台、检索架构等等。比如我们每一次点外卖时的交易履约都是由后台系统来提供服务的。\u003c/p\u003e\u003cp\u003e后台方向承担了美团基础架构以及各条业务线工程系统的建设，为美团的业务提供了云端保障，包括功能开发、平台建设、基础架构升级等工作，在巨大流量下，为用户提供高性能、高扩展、高并发、高可用、高效率的服务，支撑美团各业务提升运营效率、决策效率，提供良好的用户和商家体验。后台通道也是美团内部最大的一个技术通道。\u003c/p\u003e\u003cp\u003e系统方向偏商户端和公司内部的核心系统的研发，通过技术手段不断提升供给侧效率，降低成本，提升用户体验，促进业务目标达成。随着业务在不断发展变化，美团的新业务在不断涌现，系统方向面临着更复杂、更新鲜的业务场景，也有更多的业务挑战等待着你来解决。\u003c/p\u003e\u003cp\u003e加入美团系统通道，你能够接触线上线下复杂业务，并通过技术手段为业务赋能，进而快速成长为一名懂业务的技术专家。对业务的深刻理解和实践经验会让你身价翻倍，在未来长期的职业发展上有更多选择。美团系统通道牛人多，学习机会多，个人成长快，可以帮你全方位进行提升。值得一提的是，系统通道的成长路径后半段是比较广阔的，离业务更近，能更好地理解公司的商业模式。对于那些有野心的、未来想去创业的同学来说，系统通道是比较合适的方向。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e选择后台方向的5大理由：\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e互联网已经从「黄金时代」走到「青铜时代」，精细化运营对面向用户的后台业务系统提出更高的要求，业务场景复杂多变，后台/系统开发工程师面临更大的挑战，且招聘需求量也非常大。\u003c/li\u003e\u003cli\u003e后台/系统是支持业务最核心的一环，技术体系广且深，对特别优秀的候选人来说，未来可以选择做业务，也可以选择做技术。发展空间几乎没有上限，只要你足够努力。\u003c/li\u003e\u003cli\u003e在美团后台/系统通道，行业大牛众多，直接解决复杂业务系统架构设计，面向全社会的用户和商家，可以参与最前沿技术的研究与实践。\u003c/li\u003e\u003cli\u003e美团后台/系统通道采用导师制，一对一培养。能帮助候选人提升分布式架构设计能力，在丰富的一线实践中，快速成长为优秀的互联网后台开发者。\u003c/li\u003e\u003cli\u003e喜欢逻辑实现，喜欢高并发、高可用、高性能业务场景技术挑战同学比较适合选择后台/系统通道。\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e这里是亿级用户规模的平台，这里有持续快速增长的业务，而后台/系统工程师能够负责驱动并引领业务的发展，这就是我们的价值。期待优秀的你加入我们！\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e美团对系统/后台开发工程师候选人重点考核的专业知识及专业技能\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e计算机基础扎实，熟悉计算机相关的知识包括数据结构、算法、操作系统、计算机网络、面向对象编程、设计模式、多线程等等。\u003c/li\u003e\u003cli\u003eCoding能力，掌握至少一门开发语言（Java/C++等）。\u003c/li\u003e\u003cli\u003e了解常见的后台/系统开发技术，最好阅读过一些项目的源码。\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e技术细节请参考美团后台/系统方向的技术文章：\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003ca href=\"https://tech.meituan.com/2019/09/05/java-bytecode-enhancement.html\"\u003e字节码增强技术探索\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://tech.meituan.com/2018/11/15/java-lock.html\"\u003e不可不说的Java“锁”事\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://tech.meituan.com/2017/12/22/ddd-in-practice.html\"\u003e领域驱动设计在互联网业务开发中的实践\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://tech.meituan.com/2018/11/15/docker-architecture-and-evolution-practice.html\"\u003e美团容器平台架构及容器技术实践\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://tech.meituan.com/2016/02/04/high-availability-systems-dianping.html\"\u003e高可用性系统在大众点评的实践与经验\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003ch3 id=\"数据开发工程师\"\u003e数据开发工程师\u003c/h3\u003e\u003cblockquote\u003e\u003cp\u003e对应岗位名称：数据开发，数据仓库工程师，大数据工程师。\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e小数字成就小人生，大数据创造大未来。数据是DT时代的「石油」已经成为业内共识。数据技术是企业业务发展的根基，小到一个功能模块的设计优化、产品精细化运营、用户精准化营销，中到C端千人千面的产品体验、B端数字化赋能，大到公司战略定制和决策、创新业务人工智能的突破，数据的应用已经是面面俱到。而且大数据已经成为各个公司的基础设施，伴随着AI技术浪潮的到来，大数据也会变得越发重要。\u003c/p\u003e\u003cp\u003e数据通道主要涵盖两大技术方向，一个是数据研发方向，涵盖面向数据资产的数据清洗、加工、整合、挖掘、管理、运营等技术领域，主要包括批处理和实时数据仓库的建设、数据管理、数据价值落地的同学，以及做数据运营的同学。另一个是数据系统研发方向，涵盖批处理、实时数仓开发工具链、BI系统、数据管理系统等数据系统研发同学。数据开发通道希望通过数仓建设、数据系统建设，来提升公司数据质量、数据效率、数据安全，以数据驱动的方式帮助美团完成业务目标，持续提高公司的运营效率和核心竞争力。\u003c/p\u003e\u003cp\u003e美团数据通道负责上游系统数据的集成、建模、应用数据和系统的研发，支持和赋能业务、商分和产研等部门在业务运营、管理、策略迭代方面的决策。数据不是单纯的数字，我们已经通过对数据进行集成、处理、分析和管理，逐步将数据打造成为美团最为重要的资产。此外，数据通道还为美团提供基于大数据体系的基础数据平台、数仓平台和商业分析平台，为美团的数字化运营提供了提供高质量、高效率的数据服务。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e选择美团数据通道的5大理由：\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e数据是一个非常综合的领域，同学们将有机会得到多种技能的训练和培养。数据通道同学可以选择大数据平台搭建、数据资产构建、数据分析、数据挖掘和数据服务化等不同方向，可学习的开发技能包括系统开发技能、数据建模技能、数据应用开发技能等不同方面。在美团，数据人才的发展会有更多的可能性。\u003c/li\u003e\u003cli\u003e数据是与业务贴近程度最高的技术门类之一，同学们在为业务提供数据解决方案的过程中，将会得到商业思维和业务管理能力的训练。\u003c/li\u003e\u003cli\u003e数据相关技术和技能「浩如烟海」，非常适合对技术追求长期有耐心的同学。而且任何行业和领域的工作都需要数据能力的直接支撑。未来数据人才培养难度较高，市场需求也非常旺盛。\u003c/li\u003e\u003cli\u003e美团拥有本地生活领域海量的数据资源、丰富的数据应用场景以及极具挑战性的工作。在美团数据通道，你将有机会参与到PB级数据项目实践，参与业界一流的分析平台建设，应用到业界最先进的技术和知识，接触到吃喝玩乐住行的全链条数据。\u003c/li\u003e\u003cli\u003e美团的数据体系属于国内顶尖级别，数据通道通过精准、专业的组织建设，为公司的数据开发者带来归属感，提供了专业学习交流机制以及职业晋升指导和渠道。特别是对校招生来说，美团还为大家提供贴心的技术学习和职业发展指导，能够帮助大家迅速成长为一名合格的大数据专业人才。\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003e美团对数据开发工程师候选人重点考核的专业知识及专业技能\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e计算机基础以及大数据通用技术的底层原理，包括数据结构与算法、操作系统、计算机网络、数据库原理、统计分析与概率、数学分析以及SQL语言等等；\u003c/li\u003e\u003cli\u003eCoding的能力，掌握至少一门编程语言（Java/Python/C等）；\u003c/li\u003e\u003cli\u003e加分项：有一定的数据逻辑能力，对大数据开源框架有认知，了解分布式计算、消息队列、KV存储等等，了解数据挖掘与机器学习基本理论和方法。\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e细节可以通过美团数据方向的技术文章来体验：\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003ca href=\"https://tech.meituan.com/2020/03/12/delivery-data-governance.html\"\u003e美团配送数据治理实践\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://tech.meituan.com/2017/08/25/dataplat-coalesce.html\"\u003e美团数据平台融合实践\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://tech.meituan.com/2013/12/05/meituan-datawarehouse-evolution.html\"\u003e美团数据仓库的演进\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://tech.meituan.com/2018/05/20/kerberos-big-data-platform.html\"\u003e美团数据平台Kerberos优化实战\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://tech.meituan.com/2018/03/20/user-funnel-analysis-design-build.html\"\u003e每天数百亿用户行为数据，美团点评怎么实现秒级转化分析？\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003ch3 id=\"测试工程师\"\u003e测试工程师\u003c/h3\u003e\u003cblockquote\u003e\u003cp\u003e对应岗位名称：测试开发，测试工程师，QA工程师。\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e互联网已逐步成为人们生活和工作中不可或缺的部分，相应的，用户对互联网产品的用户体验和质量要求随之「水涨船高」，质量低、体验差的产品也将越来越难以留在赛道上。这样的背景下，测试工程师的岗位面临着新的挑战和机遇。美团对测试工程师的期待远不止是传说中「点点点」式的「黑盒」功能测试，而是需要与产品、研发、业务团队密切协作，以专业能力保证数亿消费者的用户体验，支撑数百万商家的线上化运营。\u003c/p\u003e\u003cp\u003e守住质量底线，交付用户价值。美团测试工程师的岗位职责除了基于对用户需求和被测系统的理解、设计并执行完备高效的测试用例从而保证交付质量外，还需要不断推动被测系统改进可测性设计、探索高效测试方法、持续提升自动化测试水平。在此过程中不断完善的测试工具、持续交付基础设施将使得我们的研发过程日趋高效，全过程、多维度的研发过程数据将驱动我们的技术团队持续进化。一个业务需求从发起到最终交付用户使用，测试工程师的角色无处不在，全方位的为稳定的交付质量和良好的用户体验保驾护航。\u003c/p\u003e\u003cp\u003e美团测试通道能力模型全面且立体，测试工程师的成长路径涵盖测试技术专家、业务方向质量顾问、测试工具与基础设施开发者等不同诉求。针对上述细分领域，美团测试通道精心准备了适用于初、中、高阶的培训课程。目前培训课程已经过多轮评审和迭代，课程讲师均是公司内各个领域的佼佼者。期待有朝一日你也成为光荣的讲师团成员！\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e选择美团测试通道的4大理由：\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e适于不同类型人才发挥的空间，无论是热衷技术还是长于协作，热情洋溢或是冷静心细，都能找到展现个人精彩的舞台；\u003c/li\u003e\u003cli\u003e有利于锻炼综合能力，从业务理解到技术架构，从沟通协作到效率提升，相较于「固守一隅」的开发人员拥有更为广阔的视角；\u003c/li\u003e\u003cli\u003e测试通道拥有清晰的人才模型、健全的职级体系、多样化的成长路径，资深导师辅导、开放的技术氛围帮助每位同学成长；\u003c/li\u003e\u003cli\u003e立足完整的测试理论基础和技术体系，面临万物互联和智能化时代伟大挑战，有机会与我们一同探索测试领域全新的未来。\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e当然，在面对多种多样的被测系统时，测试工程师需要对它们的技术原理和实现方法有基本的了解，才能有针对性的进行更深入的测试。在遇到各式各样的可测性难题时，测试工程师需要打破边界、发散思维，从别的领域寻求启发，以突破本领域的思维定势。当然最重要的一点是学习能力，业务领域和技术领域的知识浩渺如大海，扎实的基础知识是成长的基石，而良好的学习习惯，快速的学习能力，以及驱动自己不断探索未知领域的好奇心才是成长的持续动力。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e美团对测试工程师候选人重点考核的专业知识及专业技能\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e计算机技术基础，包括网络、数据结构、数据库、操作系统、编程语言、软件测试/软件工程等等；对校招生不要求有丰富的工作经验，更注重技术基础能力是否扎实。\u003c/li\u003e\u003cli\u003e了解经典的软件测试理论，熟悉基本的测试设计方法；对质量度量、流程把控、客户端专项、性能工具的使用较为熟悉；且具备一定的编码能力；\u003c/li\u003e\u003cli\u003e加分项：测试工程师的岗位需要候选人有比较广泛的知识面，最好对计算机各个领域的知识均有涉猎，不求样样精通，但求能融会贯通。\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e细节可以通过美团测试方向的技术文章来体验：\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003ca href=\"https://tech.meituan.com/2018/05/11/quality-operation-in-zcm.html\"\u003e质量运营在智能支付业务测试中的初步实践\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://tech.meituan.com/2018/04/27/ruby-autotest.html\"\u003e“小众”之美——Ruby在QA自动化中的应用\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://tech.meituan.com/2018/03/11/dianping-shortvideo-battery-testcase.html\"\u003e大众点评App的短视频耗电量优化实战\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://tech.meituan.com/2018/01/09/lego-api-test.html\"\u003eLego-美团接口自动化测试实践\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://tech.meituan.com/2018/12/13/smart-payment.html\"\u003e智能支付稳定性测试实战\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003ch3 id=\"运维工程师\"\u003e运维工程师\u003c/h3\u003e\u003cblockquote\u003e\u003cp\u003e对应岗位名称：运维开发，SRE，DevOps，DBA，网络工程师，安全工程师。\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e在美团做运维工程师，主要分为SRE、系统网络工程师和DBA三个方向，以及安全领域。鉴于安全的特殊地位，我们会将安全工程师，单独拿出来进行说明，本部分先介绍前三个方向。\u003c/p\u003e\u003cp\u003eSRE会以「上帝视角」来运维全公司的业务系统，每一个操作都关乎亿万用户的使用，每一项优化都能帮助公司降低成本，增加效率。公司业务的持续发展离不开卓越的运营，稳定性保障领域还有很多难题需要我们去突破，SRE有很大的机会成长为优秀的架构师、管理者。\u003c/p\u003e\u003cp\u003e系统网络工程师的主要职责是维护和保障美团基础设施的稳定，包括数据中心、网络、服务器等设施，及维护设施所需的运维平台建设与运维。这是涉及基础科学，垂直技术领域最多的一个通道，通过技术与运营相结合，为公司业务提供稳定、高效、低成本的基础设施资源。如果你成为一名系统工程师，就有机会接触大规模的基础设施资源，能够以软硬件结合的方式，系统性的参与到大规模的基础设施的运营。\u003c/p\u003e\u003cp\u003eDBA团队负责保障美团数据库服务的稳定和安全，致力于为公司提供稳定、可靠、高效的在线存储服务。从传统的运维DBA起步，DBA团队在短时间内经历了脚本化、工具化、平台化、自动化的快速迭代，并开始了在智能运维领域的探索和实践。展望未来，我们将着力于应用AI技术推进数据库运维自动化与智能化的交叠演进，并借助NewSQL、容器化、软硬件一体化技术促进OLTP与OLAP更好的融合。如果你有志于服务万亿级的高并发、大流量、多租户的应用场景，欢迎加入美团DBA团队。\u003c/p\u003e\u003col\u003e\u003cli\u003e\u003cstrong\u003eSRE\u003c/strong\u003e：扎实的计算机系统基础知识，丰富的网络知识，掌握常用算法，具备脚本编程能力；具备Linux操作系统的运维实操经验，具备小型网站的搭建能力；\u003c/li\u003e\u003cli\u003e\u003cstrong\u003e系统网络工程师\u003c/strong\u003e：扎实的计算机系统基础知识，丰富的网络知识，掌握常用算法，具备脚本编程能力；具备Linux操作系统的运维实操经验；能够无障碍阅读英文技术Paper；\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eDBA\u003c/strong\u003e：能够掌握各种数据结构，如数组、链表、队列和栈，以及树、哈希表等；掌握数据库的基础知识，如范式、表结构设计，常用SQL语句，聚合函数的用法等；掌握Linux系统下的常用Shell命令；掌握简单的正则表达式和文本处理方法；掌握操作系统的基础知识；多参与实际的项目，在项目中积累编码经验，增强动手能力。\u003c/li\u003e\u003c/ol\u003e\u003cp\u003e细节可以通过美团运维方向的技术文章来体验：\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003ca href=\"https://tech.meituan.com/2018/12/13/intelligent-operation-practice-in-meituan.html\"\u003e数据库智能运维探索与实践\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://tech.meituan.com/2018/05/20/sql-parser-used-in-mtdp.html\"\u003eSQL解析在美团的应用\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://tech.meituan.com/2017/08/03/meituanyun-sre.html\"\u003e云端的SRE发展与实践\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://tech.meituan.com/2018/03/16/redis-high-concurrency-optimization.html\"\u003eRedis 高负载下的中断优化\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://tech.meituan.com/2017/06/29/database-availability-architecture.html\"\u003e美团数据库高可用架构的演进与设想\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://tech.meituan.com/2016/09/18/the-construction-of-database-automation-system.html\"\u003e美团数据库运维自动化系统构建之路\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003e安全工程师\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e在当今社会，企业的信息安全越来越重要，它关系到亿万用户的数据安全和隐私保护，关系到国计民生的基础设施可靠性，甚至可能还关系到国家安全。只有安全上不发生颠覆性的风险，用户和业务才能岁月静好。\u003c/p\u003e\u003cp\u003e美团安全团队是一群有使命感的「守夜人」，他们用卓越的本领和超强的责任心守卫着美团数亿用户的数据和隐私。如果你也热爱安全攻防，愿意在网络空间里「除暴安良」、「保家卫国」，当一位「侠之大者」，欢迎加入美团安全团队！当你选择了信息安全，你会发现不仅是选择了一个行业，更是选择了一种责任。\u003c/p\u003e\u003cp\u003e面对日益复杂的攻防对抗形式和海量数据场景，美团安全团队也在不断提升自己的标准，致力于成为追求卓越、业界领先的安全团队，并落地更多业界认可的实践安全项目。目前，美团安全团队人才济济，大多数核心成员拥有多年互联网以及不同安全领域实践经验，均参与过大型互联网公司的安全体系建设，其中不乏具备百万级IDC规模攻防对抗的经验的全球化安全人才、CVE挖掘圣手、业务全流程风控专家、国际顶级会议演讲者、以及知名媒体大V等。值得一提的是，美团安全团队的氛围非常的轻松和谐。我们不止有「格子衫文化」，更会吃喝玩乐，是一群热爱生活，并且享受生活的年轻人。\u003c/p\u003e\u003col\u003e\u003cli\u003e\u003cstrong\u003e专业背景\u003c/strong\u003e：优先信息安全、计算机科学、统计学、数学等相关学历及专业背景的同学；\u003c/li\u003e\u003cli\u003e\u003cstrong\u003e技术技能\u003c/strong\u003e：至少熟悉Python、Java、Go、C++等主流语言中的一门，有过至少一门语言的开发实践；了解行业政策与动向，关注最新安全漏洞，能分析漏洞原理和实现PoC编写；能够无障碍阅读英文技术Paper；\u003c/li\u003e\u003cli\u003e\u003cstrong\u003e覆盖领域\u003c/strong\u003e：对网络安全、应用安全、数据安全、业务安全、移动安全、AI安全、IoT安全、内容风控、攻防对抗、安全算法等任意领域有实操经验，或有着一定的见解，并对此研究方向抱有热情；\u003c/li\u003e\u003cli\u003e\u003cstrong\u003e加分项\u003c/strong\u003e：如果你是挖洞能手，有独立挖掘过知名开源应用/大型厂商高危漏洞经历，或在相关领域获奖、发表过Paper、做过分享；或者曾经在大型互联网公司有过相关实习经验；或者了解AI主流算法适用场景和调参，有相关的实践经验，都是加分项哦~\u003c/li\u003e\u003c/ol\u003e\u003cp\u003e细节可以通过美团安全领域的技术文章来体验：\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003ca href=\"https://tech.meituan.com/2018/05/24/data-security-system-construction.html\"\u003e互联网企业数据安全体系建设\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://tech.meituan.com/2020/03/12/cloud-native-security.html\"\u003e云原生之容器安全实践\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://tech.meituan.com/2018/11/08/intrusion-detection-security-meituan.html\"\u003e浅谈大型互联网企业入侵检测及防护策略\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://tech.meituan.com/2018/01/26/network-isolation-access-control.html\"\u003e初探下一代网络隔离与访问控制\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://tech.meituan.com/2017/10/27/security-port-monitor.html\"\u003e互联网企业安全之端口监控\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://tech.meituan.com/2017/04/07/google-security-ayazero.html\"\u003e从Google白皮书看企业安全最佳实践\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003ch3 id=\"硬件开发工程师\"\u003e硬件开发工程师\u003c/h3\u003e\u003cblockquote\u003e\u003cp\u003e对应岗位名称：硬件开发，嵌入式系统工程师。\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e硬件涉及面很广，这里不仅仅有硬件的设计和开发工作，同时包括了嵌入式软件方向、机械与结构方向、硬件质量管理等技术方向。这是一个需要能够「上通业务，下晓硬件」的技术领域，在这里工作的同学都是软硬结合的多面手。他们为美团的智能硬件平台提供最佳的解决方案，帮助美团拓展在IoT领域的战略布局。\u003c/p\u003e\u003cp\u003e「硬件」的价值，看得见，摸得着。硬件是软件系统的载体，软件基于稳定可靠的硬件特性基础而扩展，硬件帮助软件技术价值触达用户。如果你是一位喜欢精雕细琢的「工匠」，欢迎加入我们，一起铸造精品！\u003c/p\u003e\u003col\u003e\u003cli\u003e机械和电子专业技术知识，质量及项目管理专业技能，以及发现和解决问题能力。\u003c/li\u003e\u003cli\u003e其中嵌入式软件方向：需要了解计算机体系结构，C/C++程序设计语言，数据结构，常用的网络通信结构，操作系统等基础知识。\u003c/li\u003e\u003c/ol\u003e\u003ch3 id=\"算法工程师\"\u003e算法工程师\u003c/h3\u003e\u003cblockquote\u003e\u003cp\u003e对应岗位名称：算法工程师。\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e美团算法团队希望通过人工智能技术为业务创造价值。要求候选人能够在深入理解美团业务的基础上，进行有效场景的抽象和建模，并使用数据和算法优化上述模型；同时要求候选人能够从海量数据中总结规律，通过规则、模型、自适应学习系统等方式进行有效知识沉淀，通过数据驱动的方式帮助公司提升业务运营全链条的效率、效果。\u003c/p\u003e\u003cp\u003e美团拥有丰富的算法应用场景、海量的数据、以及强大的算力平台。美团算法团队正在构建的AI相关技术，囊括了语音、视觉、自然语言处理、机器学习、知识图谱、搜索推荐、运筹优化、运动控制等领域；美团因为涉及线上和线下经济结合的众多业务，有丰富的应用场景，包括美团点评App内搜索推荐、面向外卖配送的定价和调度、无人配送的自动驾驶、无人机的飞行控制、智能耳机里的语音识别、人脸识别、智能语音客服系统、金融体系和供应链系统中的庞大知识图谱等。同时，美团的巨大的用户和商户以及订单体量，产生了PB量级的真实数据，例如海量的用户评价、商家经营数据、商场监控数据、餐馆菜单、无人车感知数据等，这些真实的数据对于算法研究人员是一个巨大的宝藏和修炼场。美团拥有数万高性能服务器以及数千张GPU卡，给模型训练提供了充足的算力。\u003c/p\u003e\u003cp\u003e目前，美团算法团队比较急缺的岗位包括机器学习/数据挖掘算法工程师、运筹优化研发工程师、语音算法工程师、自然语言处理开发工程师、推荐算法工程师、计算机视觉工程师、无人车和无人机的感知/规划控制工程师等。\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e美团对算法工程师候选人重点考核的专业知识及专业技能\u003c/strong\u003e\u003c/p\u003e\u003col\u003e\u003cli\u003e专业背景：算法基础知识与工程基础知识，包括数据结构、数学、机器学习理论等。\u003c/li\u003e\u003cli\u003e专业知识：细分领域知识，包括数据挖掘、运筹优化、深度学习等基础知识，NLP、图像、3D空间定位、点云、运动规划控制等。\u003c/li\u003e\u003cli\u003e专业能力：要求具备一定的文献阅读和调研能力，以及算法策略的实现能力。\u003c/li\u003e\u003c/ol\u003e\u003cp\u003e划重点：美团算法岗位的竞争非常激烈。如果你在算法方面不是特别自信的话，建议多考虑一下美团的工程方向。\u003c/p\u003e\u003cp\u003e细节可以通过美团算法方向的技术文章来体验：\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003ca href=\"https://tech.meituan.com/2019/11/14/nlp-bert-practice.html\"\u003e美团BERT的探索和实践\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://tech.meituan.com/2015/01/22/mt-recommend-practice.html\"\u003e美团推荐算法实践\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://tech.meituan.com/2019/01/10/deep-learning-in-meituan-hotel-search-engine.html\"\u003e深度学习在搜索业务中的探索与实践\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://tech.meituan.com/2018/03/29/herenqing-ai-con.html\"\u003e美团外卖骑手背后的AI技术\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://tech.meituan.com/2017/07/28/dl.html\"\u003e深度学习在美团推荐平台排序中的运用\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://tech.meituan.com/2017/05/05/machine-learning-model-optimization.html\"\u003e机器学习中模型优化不得不思考的几个问题\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://tech.meituan.com/2019/02/21/meituan-delivery-eta-estimation-in-the-practice-of-deep-learning.html\"\u003e深度学习在美团配送ETA预估中的探索与实践\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e以上就是美团技术团队岗位整体介绍以及对岗位的要求，如果大家想了解更多的招聘信息和岗位信息，欢迎关注「美团技术团队」、「美团点评招聘」微信公众号。\u003c/p\u003e\u003ch2 id=\"二-哪些软素质最受面试官的认可\"\u003e二、哪些软素质最受面试官的认可？\u003c/h2\u003e\u003cp\u003e\u003cstrong\u003e基本能力\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cstrong\u003e聆听的能力\u003c/strong\u003e：希望你能够迅速Get到面试官的提出的问题核心以及前提条件，避免在未清晰获取到问题或者没有思考清晰的情况下，直接就回答面试官提出的问题。\u003c/li\u003e\u003cli\u003e\u003cstrong\u003e沟通表达的能力\u003c/strong\u003e：口头和书面表达逻辑清晰，能够有条理地进行思考，清楚、有力地表达自身想法和观点。在美团的日常工作中，编写技术文档和发送邮件的情况非常普遍，希望你具备清晰的逻辑思考能力和优秀的写作能力。\u003c/li\u003e\u003cli\u003e\u003cstrong\u003e学习能力\u003c/strong\u003e：美团有句经典老话：我不会但我可以学。我们希望你能够主动发现自己的短板，并有规划地为自身能力打补丁，更主动地了解行业相关信息，同时愿意主动学习新技术，包括但不限于经典的技术书籍、网络博客、教学视频等。鼓励大家在大学时尽可能参与一些开源项目，或者参加过一些编程相关的竞技比赛。\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003e工作能力\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cstrong\u003e协作能力\u003c/strong\u003e：一个人可以走的更快，一群人可以走的更远。美团业务线比较多，经常涉及跨部门合作，希望你具备一定的团队协作能力。\u003c/li\u003e\u003cli\u003e\u003cstrong\u003e执行力\u003c/strong\u003e：较好的计划制定和落地能力，较好的风险把控和应对能力，较好的应变和调整能力。\u003c/li\u003e\u003cli\u003e\u003cstrong\u003e管理能力\u003c/strong\u003e：在时间管理方面，能够合理安排工作，以确保自己不被Deadline牵制；在自身管理能力方面，知道时间用在什么地方，重视对外界的贡献，善于发挥自身长处，集中精力于重要领域，善于做出有效决策。\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003e个人素质\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cstrong\u003e技术自驱力\u003c/strong\u003e：我们希望你是真正发自心底的热爱技术，能够对技术保持好奇心，做到「知其然也知其所以然」，且喜欢动手实践。\u003c/li\u003e\u003cli\u003e\u003cstrong\u003e韧性\u003c/strong\u003e：美团提倡「长期有耐心」，希望你在遇到挫折和失败时，不会轻言放弃。从学校到社会的过渡阶段，必然会面临很多挑战和困难，坚韧可以帮助战胜困难。\u003c/li\u003e\u003cli\u003e\u003cstrong\u003e积极开放的心态\u003c/strong\u003e：希望你拥有较强的求知欲和好奇心，对新鲜技术充满探索欲，能够积极拓展圈内外的人际资源，跟大家一起交流、分享。同时能够不自我设限，不断突破自我。\u003c/li\u003e\u003c/ul\u003e\u003ch2 id=\"三-学长有话对你说\"\u003e三、学长有话对你说：\u003c/h2\u003e\u003ch3 id=\"潘魏增学长-南开大学-前端技术专家-2010年加入美团点评\"\u003e潘魏增学长 | 南开大学 | 前端技术专家，2010年加入美团点评\u003c/h3\u003e\u003cp\u003e第一，练好技术基本功，勿在浮沙筑高台。大家要把计算机基础理论、互联网基础知识以及前端开发的基本原理弄明白，这点对刚走上工作岗位的应届生来说尤为重要。第二，不要去追潮流，不要去做技术投机，看到人工智能、算法领域比较火爆，就一窝蜂冲上去，往往容易「折戟沉沙」。而且工程领域发展前景并不输于算法等领域。第三，主动了解所在公司所在部门最需要什么，了解影响业务成功的各种要素，在做好本职工作之外向前多走一步，成为懂业务、懂商业的技术多面手。最重要的一点，持续努力，不要懈怠。不要因为获得一点点成绩而沾沾自喜，千万不要把运气当做自己的能力。\u003c/p\u003e\u003ch3 id=\"王晓飞学长-北京邮电大学-android技术专家-2015年加入美团点评\"\u003e王晓飞学长 | 北京邮电大学 | Android技术专家，2015年加入美团点评\u003c/h3\u003e\u003cp\u003e首先建议学弟学妹，最好在大学期间就能认认真真地去完成一个App的设计、开发、上线的完整流程；第二，必要的面试笔试基本功不能丢（上面写的很详细呦）；第三，多一点耐心，多一点坚持；第四点，要有自己的想法，不要因为大家都去追逐一些新名词就随波逐流，找到适合自己的才是最重要的。\u003c/p\u003e\u003ch3 id=\"董尚先学长-ios技术专家-2015年4月加入美团点评\"\u003e董尚先学长 | iOS技术专家，2015年4月加入美团点评\u003c/h3\u003e\u003cp\u003e计算机知识体系很庞大，但是技术基础上都具备相通性，牢固的知识基础有助于在后续的学习中举一反三。作为一名iOS工程师，不代表你不能学习其他的技术栈。移动端的知识相对来说学习曲线比较平缓，对新同学来说比较友好的，非常适合作为互联网的入门行业。 当感觉到得心应手的时候，一定要及时走出舒适圈，严格要求自己，LLVM、跨端技术、持续集成、动态化、端智能技术等都是可以深入的学习方向。美团技术团队也提供了非常大的一个舞台，内部有无数的「活水」机会，大家可以去不同的业务线、不同的技术线去挑战自我。\u003c/p\u003e\u003ch3 id=\"刘铮学长-西安电子科技大学-后台技术专家-2017年加入美团点评\"\u003e刘铮学长 | 西安电子科技大学 | 后台技术专家，2017年加入美团点评\u003c/h3\u003e\u003cp\u003e后台和系统相关的技术体系很庞大，一开始避免陷入细节，可以先从广度入手，了解各种技术的特性及使用场景，然后结合自己的事情或兴趣，进行某个领域的深入钻研。机会与能力同等重要。作为初出茅庐的毕业生，应该选择一个蓬勃发展的行业，在丰富的实践中快速成长。\u003c/p\u003e\u003ch3 id=\"陈彧学长-清华大学-数据技术专家-2015年加入美团点评\"\u003e陈彧学长 | 清华大学 | 数据技术专家，2015年加入美团点评\u003c/h3\u003e\u003cp\u003e如果你想成为一名优秀的数据工程师，那么你需要知道，数据非常看重实战经验的长期积累。同学们需要具有稳健的职业发展观。在数据领域，毕业后3~5年的时期非常关键，就业的选择要重视未来经验的积累和视野的拓展。建议大家要重视基本功，认知好自己的兴趣和专长。时间若是足够的话，可在美团这样的大型互联网公司找到一份相关的实习工作，提前了解一下行业的实践。\u003c/p\u003e\u003ch3 id=\"陈阳学长-东北石油大学-测试技术专家-2019年加入美团点评\"\u003e陈阳学长 | 东北石油大学 | 测试技术专家，2019年加入美团点评\u003c/h3\u003e\u003cp\u003e测试方向入门容易做精难，想在某一个方向做深入需要比研发工程师更广的知识面，也需要比产品更敏锐的需求提炼和转化能力。从工具的设计、开发再到运营，从技术规划到版本规划再到项目实施，考验的是全面协调以及解决问题的能力。此外，高段位的测试工程师还要根据不同项目的成熟度模型，引入规范的流程、敏捷开发模式、数据版本的管理、代码版本的管理、组件化服务化的升级等等，都需要对业务的深度理解，更需要多年的经验积累来确保软件的质量。建议学弟学妹们要重视知识的广度，夯实基础，在某一个方向持续深入学习，锻炼沟通能力和解决问题的能力。\u003c/p\u003e\u003ch3 id=\"赵应钢学长-华中科技大学-数据库专家-2015年8月加入美团点评\"\u003e赵应钢学长 | 华中科技大学 | 数据库专家，2015年8月加入美团点评\u003c/h3\u003e\u003cp\u003e首先，尽量寻找到在大型互联网公司实习的机会，在实际工作中提升自己，做到理论实践相结合。通过实际工作，更能了解到企业的实际需要。其次，可以多参加一些认证考试，在考证的过程中掌握整个知识体系，形成全局视野。最后一点，多关注顶级企业对人才的招聘要求，提前储备相关技能。\u003c/p\u003e\u003ch3 id=\"赵弼政学长-武汉理工大学-安全技术专家-2018年加入美团点评\"\u003e赵弼政学长 | 武汉理工大学 | 安全技术专家，2018年加入美团点评\u003c/h3\u003e\u003cp\u003e安全攻防是在计算机基本功之上的灵活运用，深刻理解原理才能化腐朽为神奇，所以首先建议大家注意打好基本功（编译原理、操作系统、网络、数据库等）。另一方面，安全领域的大多数前辈都是兴趣驱动的，在实践中培养自信、加深理解、融会贯通。所以一定要多动手，不能仅仅满足于老师和课本上提到的知识。无论是挖漏洞、渗透测试、打CTF比赛、写自动化工具还是做算法参数调优等，尽量把经典的场景都亲手反复实践过，有了这些实践，还要擅长总结（验证对计算机基本知识的理解深度），试着写一些文章或者Blog分享。做好这些技术储备的同时，要坚守初心，不碰黑产。\u003c/p\u003e\u003ch3 id=\"景华学长-北京航空航天大学-嵌入式软件技术专家-2018年加入美团点评\"\u003e景华学长 | 北京航空航天大学 | 嵌入式软件技术专家，2018年加入美团点评\u003c/h3\u003e\u003cp\u003e当与面试官讨论问题的时候，请用数据来征服TA。在这个领域，美团硬件通道不允许用召回率来表达，一个算法也许完成了90%就可以落地了，但是美团需要的是达到99.9999%的设计标准。所以数据是打开这个通道的大门，且对应的数字一定要准确。在这个通道，基本功尤其重要，任何出现在你简历中的内容，一定要解释的明明白白。\u003c/p\u003e\u003ch3 id=\"段航学长-比利时鲁汶大学-算法专家-2015年加入美团点评\"\u003e段航学长 | 比利时鲁汶大学 | 算法专家，2015年加入美团点评\u003c/h3\u003e\u003cp\u003e写好简历，客观地陈述个人的经历，有针对性；做好准备，重视每一次的面试机会，心态平和；积极主动，关注目标企业招聘信息，踊跃申请。\u003c/p\u003e\u003ch2 id=\"四-欢迎加入美团技术团队-重要是跟什么样的人在一起做什么样的事情\"\u003e四、欢迎加入美团技术团队：重要是跟什么样的人在一起做什么样的事情！\u003c/h2\u003e\u003cp\u003e人是美团最重要的资产，美团技术团队以浓厚的学习和分享氛围享誉业界。\u003c/p\u003e\u003col\u003e\u003cli\u003e\u003cstrong\u003e完善的技术培训体系\u003c/strong\u003e：美团技术学院开设几百门技术专业课程。从MRN介绍到Java并发编程，从系统复杂性问题方法论到机器学习算法，从后台用例设计到运维开发初体验……\n\u003cimg src=\"https://p0.meituan.net/travelcube/5de05d54ffd1af4a464bc7bc5aca7e0866937.png\" alt=\"\"/\u003e\u003c/li\u003e\u003cli\u003e\u003cstrong\u003e丰富的技术图书资源\u003c/strong\u003e：美团点评图书馆藏13000多册纸质书（90%以上为技术图书），306本电子书，并有O’Reilly Safari英文电子书库（四万多计算机技术和管理图书！）、ACM Library、知网、极客时间等多种电子资源。\u003c/li\u003e\u003cli\u003e\u003cstrong\u003e浓厚的工程师文化\u003c/strong\u003e：美团技术团队内部社区为技术同学提供一站式技术信息查询服务，内外部技术博客承载技术团队优质内容沉淀，TopTalk不定期邀请国内外技术大咖来公司做分享，1024程序员节狂欢、29个技术俱乐部聚集志同道合的小伙伴，各种学习路径帮助你每天前进30公里。\u003c/li\u003e\u003c/ol\u003e\u003ch2 id=\"内推福利\"\u003e内推福利\u003c/h2\u003e\u003cp\u003e送给大家一个小福利。下面这个是美团技术岗位\u003cstrong\u003e社招\u003c/strong\u003e官方内推码，微信扫码即可投递简历：\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://p0.meituan.net/travelcube/97f92f089885b555cb08e4a4cc0c7be8348997.png\" alt=\"\"/\u003e\u003c/p\u003e\u003cp\u003e参加\u003cstrong\u003e校招\u003c/strong\u003e的同学，可以使用微信扫描下面的内推码：\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://p1.meituan.net/travelcube/b1281e824c80f6fd09355573db60cf6d388288.png\" alt=\"\"/\u003e\u003c/p\u003e\u003cp\u003e欢迎大家踊跃投递简历噢~ ~\u003c/p\u003e\u003cp\u003e在帮大家「吃得更好，生活更好」的背后，有一群默默努力的工程师小哥哥、小姐姐们在默默努力、默默付出。我们也希望优秀的你也能加入我们，用一行行代码，创造出美好的亿万生活！\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "Date": "2020-03-26T00:00:00Z",
  "Author": "soulteary@gmail.com"
}