{
  "Source": "tech.meituan.com",
  "Title": "美团技术十年：让我们感动的那些人那些事",
  "Link": "https://tech.meituan.com/2020/03/05/meituan-10-years.html",
  "Content": "\u003cdiv class=\"post-content\"\u003e\u003cdiv class=\"content\"\u003e\u003cp\u003e时光荏苒，美团十岁了，美团技术团队也走过了十个春秋。\u003c/p\u003e\u003cp\u003e2010年3月4日美团网上线的时候，整个公司总共十来人，在一套三居室的民房里起步。其中技术团队只有5个人，现在有4位还在美团。\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://p0.meituan.net/travelcube/a04f913c940b1a4a7d12ef1f93e9b05a1361760.png\" alt=\"美团技术团队早期办公环境，右边电脑上有测试中还没上线的美团网页版\"/\u003e\u003c/p\u003e\u003cp\u003e今天，美团是中国市值第三的互联网公司，技术团队也已经达到9000多人规模，覆盖前端、后台、系统、算法、测试、运维、数据、硬件等8个技术领域。\u003c/p\u003e\u003cp\u003e2013年美团公司年会上，王兴特别引用了清华大学老校长梅贻琦先生的一句名言：“大学者，非谓有大楼之谓也，有大师之谓也。”他是告诉在场的美团同学：选择跟什么样的人在一起做什么样的事，很重要。\u003c/p\u003e\u003cp\u003e最近，美团技术学院陆续采访了20多位美团技术团队的同学，既有美团早期创始团队的3位“元老”，也有很多美团App、美团外卖等部门的技术骨干，听他们聊了聊自己跟公司一起成长的故事。故事里有争吵，也有友情；有汗水，也有泪水；有委屈，也有成长；有迷茫，也有坚定。我们从中摘录了他们印象最深刻的一些片段，与大家一起感受，10年来美团技术团队经历的那些坎坷与崎岖，收获的那些感动和期许。\u003c/p\u003e\u003ch2 id=\"时间开始了\"\u003e时间开始了\u003c/h2\u003e\u003cp\u003e\u003cimg src=\"https://p0.meituan.net/travelcube/d9cda4200ffddf1263df5097e07a045b927412.png\" alt=\"美团网上线，第一单\"/\u003e\u003c/p\u003e\u003cp\u003e2010年3月4日，美团网上线。\u003c/p\u003e\u003cp\u003e此后半年，团购是互联网领域最火爆的创业领域。如雨后春笋，冒出了数千家团购网站，这就是大家经常提起的“千团大战”。\u003c/p\u003e\u003ch3 id=\"关键是跟什么人在一起-做什么样的事情\"\u003e关键是跟什么人在一起，做什么样的事情\u003c/h3\u003e\u003cp\u003e美团技术团队创始成员付栋平回忆，2010年的时候美团的技术并不是很强，但是团队年轻、有激情、有闯劲，响应速度非常快。大家24小时待命，连大年初二初三还在改Bug，也不觉得累。他感叹：“办公的环境什么的其实并不重要，关键是跟什么人在一起，做什么样的事情。如果这个事情本身很有意义，很激动人心，就很值得我们去投入青春。如果这群人很优秀，也很上进，就值得大家彼此托付，成为彼此信任的战友。”\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://p0.meituan.net/travelcube/a8f1f75151dbfda2a32f2df8afcc7047297924.png\" alt=\"美团网第一次提交的代码统计：文件一共27个，代码量6892行\"/\u003e\u003c/p\u003e\u003ch3 id=\"有安全漏洞-连续加班也要搞定\"\u003e有安全漏洞？连续加班也要搞定\u003c/h3\u003e\u003cp\u003e美团技术团队创始成员、美团网第一次代码提交者秦亚非，在美团内部通信工具大象上的签名是：“我们生在这个时代，能参与一波又一波的互联网科技浪潮，是件很幸运的事。”\u003c/p\u003e\u003cp\u003e秦亚非印象很深的一次危机事件发生在2015年，他们听说有个黑客大会要将美团的系统作为攻击对象，大会的赛题就是“现场攻破美团的支付系统”。公司联合创始人穆荣均亲自带领技术团队的同学们连续加班梳理可能有隐患的环节，连夜查询Bug和漏洞，白盒看代码到天亮，最后找到了问题，并最终完成了修复。\u003c/p\u003e\u003ch3 id=\"最喜欢的特质-美团是一家学习型组织\"\u003e最喜欢的特质：美团是一家学习型组织\u003c/h3\u003e\u003cp\u003e美团技术团队创始成员潘魏增最喜欢的特质，就是美团是一家学习型组织。公司整个创始团队都非常善于学习、思考和总结，并身体力行去分享、去鼓励大家这么做。记得有一次聚会，王兴聊天时说到各地的方言，还帮忙给大家各自的方言做归类，聊到兴致起来，还拿出一本厚厚的语言书，证明他说的都有理有据。还有一次，王兴推荐了一本关于地缘视角看世界的书，还送了不少本给大家。潘魏增看完之后确实对世界格局有了全新的认识，对他的帮助很大。\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://p1.meituan.net/travelcube/c855267aa85d33e6898a6e84b393e94d263779.jpg\" alt=\"2010年，王兴跟美团技术团队的某一次见面会\"/\u003e\u003c/p\u003e\u003ch3 id=\"梦里都在写代码\"\u003e梦里都在写代码\u003c/h3\u003e\u003cp\u003e2010年12月入职美团技术团队的时候，弥新锋还是一个技术小白，所有做的事情都是从未做过的。他从Windows上的DreamWeaver转到学习Linux（Ubutun）上的Vim，从只会用jQuery到能够读懂YUI2源代码，并自己独立写完整的脚本。想到每段CSS和JavaScript的呈现界面都是数十万人在访问和使用，弥新锋都会感到很兴奋。早期美团技术团队几乎每天都加班到很晚，但他几乎没有疲惫的状态，非常兴奋以至于做梦都是关于代码关于公司，他还把这些梦境记录在了饭否上。\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://p1.meituan.net/travelcube/f0ea50c8ccb9e6ed4391e91f97351857325812.png\" alt=\"弥新锋同学在“饭否”的记录\"/\u003e\u003c/p\u003e\u003ch3 id=\"早期美团技术团队的口号是-要么牛逼-要么滚蛋\"\u003e早期美团技术团队的口号是：“要么牛逼，要么滚蛋”\u003c/h3\u003e\u003cp\u003e张佳佳是2010年12月18日硕士毕业、校招入职美团的。美团虽然是个新公司、小公司，但是很早就非常重视从应届生中招聘优秀学生。\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://p0.meituan.net/travelcube/67420efeb57a459b5aefe087e485db7a1086352.png\" alt=\"2014年，技术团队校招场景\"/\u003e\u003c/p\u003e\u003cp\u003e他印象比较深的一件事是，当时技术团队的口号，就是出自Facebook的“Go big or Go Home”，后来秦亚非同学翻译了一版：“要么牛逼，要么滚蛋”。大家一致认为很形象也很贴切，就一直用了很多年。\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://p0.meituan.net/travelcube/6310d796e1f9d9c79dcd85ab98df710c4758388.png\" alt=\"早期美团技术团队的口号\"/\u003e\u003c/p\u003e\u003cp\u003e张佳佳记忆最深刻的是，2010年时穆荣均告诉大家，美团技术团队很快要扩充到100人左右。那时候，成立没多久的美团技术团队才十几个人，张佳佳心里就想，100多个技术，美团这是想干多大一件事啊。张佳佳感言：“你看今天，我们技术团队都已经9000多号兄弟了，真的是让我感慨万千啊。”\u003c/p\u003e\u003ch3 id=\"效率是美团的核心竞争力\"\u003e效率是美团的核心竞争力\u003c/h3\u003e\u003cp\u003e夏姣姣是美团技术团队早期比较少的女同学。她在美团和百度之间，经过慎重的考虑，最终选择了美团，2011年02月21日加入。她的印象中，王兴每周末都会在站在办公室的一个角落中，给他们所有人分享本周的一些思考，而且每次分享的内容都能大家很大的启发和鼓舞。\u003c/p\u003e\u003cp\u003e穆荣均也经常跟美团技术团队一起讨论问题。有次他问：对美团技术团队来说，最重要的事情是什么？大家给出了很多答案，而穆荣均的回答是“效率”，效率是美团区别于竞对的核心竞争力。\u003c/p\u003e\u003ch2 id=\"战略布局移动\"\u003e战略布局移动\u003c/h2\u003e\u003cp\u003e2010年大家使用的手机基本上还是诺基亚和摩托罗拉，“移动化”这个概念刚刚开始受到关注。年底，王兴去美国考察回来，坐在公司的小仓库一张破桌子上，跟美团技术团队讲要搞移动化战略，然后陈亮（现美团高级副总裁）就带着两三个同学在春节前后，花了一两个月的时间快速开发。\u003c/p\u003e\u003cp\u003e2011年3月4日，美团成立一周年那天，美团开始拥有了自己的客户端。\u003c/p\u003e\u003cp\u003e据王慧文回顾，美团在千团大战中脱颖而出，很重要的一个因素，是抓住了移动这一波技术大红利。2011年的时候，美团移动端收入占美团总业务比重仅为7%-8%左右，2012年达到了30%，2013年已经到了70%。2014年超过了95%。\u003c/p\u003e\u003cp\u003e此后，随着业务的发展，用户和数据量都在增长，美团开始组建专门的搜索、推荐和数据团队，也有了更专业的产品经理，原有团队同学迅速成长的同时，也有越来越多外部技术大牛加盟。\u003c/p\u003e\u003ch3 id=\"技术同学敢跟老板拍桌子吵架\"\u003e技术同学敢跟老板拍桌子吵架\u003c/h3\u003e\u003cp\u003e马圣超是陈亮招进来的美团移动端第一个工程师，2011年2月11日入职。当时的一些细节一直让马圣超记忆犹新，就像像刚发生在昨天一样。比如刚来的时候，美团技术团队连设计和美术都没有，陈亮除了给马圣超审核代码之外，还搬着凳子跟一个做运营小哥一起设计图片，美团第一版客户端的开屏图就是这么来的。早期美团的技术、设计同学都不怕自己的Leader，经常为了一个方案跟陈亮吵架，吵到拍桌子……\u003c/p\u003e\u003cp\u003e马圣超说对自己影响最深的是，完成比完美更重要这句话，出自“Done is better than Perfect”。一直到今天，他都把这句话当成做很多事的原则：迭代式前进。想的再完美，不如先行动起来。\u003c/p\u003e\u003ch3 id=\"我跟公司好有缘\"\u003e我跟公司好有缘\u003c/h3\u003e\u003cp\u003e谢语宸感觉自己跟美团特别有缘分。他是2011年3月4日那天入职的应届毕业生，刚好美团成立一周年；他跟自己老婆定情的日子也是某年的3月4日；就在他们俩领证那天，美团刚好宣布跟大众点评合并。这个真的不是他故意为之，其实他们很早就定好了领证的日子。\u003c/p\u003e\u003cp\u003e在2011年到2013年，美团在移动互联网化的进程中在技术上一直处于行业Top位置。虽然从现在看来，当时技术水平肯定不高，但是整个团队技术自豪感很强。当时谢语宸跟秦亚非一起负责数据开发工作，虽然比BAT在相关技术方向积累较少, 但是他们在一开始就在按照一个“互联网巨头”的标准进行自我要求。\u003c/p\u003e\u003ch3 id=\"老板为什么发那么大火\"\u003e老板为什么发那么大火\u003c/h3\u003e\u003cp\u003eAndroid程序员雷地球（2011年4月11日入职）至今还记得，美团Android客户端出现了一个挺大的问题，直接影响到了用户体验，移动端的技术负责人、平时很Nice的陈亮在办公室发了很大的脾气。大家逐渐认识到美团第一条价值观——“以客户为中心”的分量，因为技术问题影响了用户体验，影响了公司的声誉，那可是天大的事情。\u003c/p\u003e\u003ch3 id=\"不要给自己设限\"\u003e不要给自己设限\u003c/h3\u003e\u003cp\u003e让早期数据开发组成员郑刚（2011年6月27日入职）震撼的是2014年公司年会，王兴给2020年美团公司设定的目标：平台总交易额一万亿。此前几天，他们数据组的同学刚做过预测，最高的数字都没有超过2000亿。要知道，美团2013年的数据才到188亿，1万亿简直不敢想象。现在美团已经快要实现这个目标了。郑刚感言：“我受兴哥影响挺大的，他经常告诉我们不要给自己设限。我也经常跟自己的同学讲，战术上只要肯干，就没有达不成的目标。”\u003c/p\u003e\u003cp\u003e当时，对美团数据组最大的挑战就是，技术资源跟不上业务的开发，数据组几个同学要应对人力、销售、市场营销等多个业务线。怎么办？他们就开始教美团的产品经理写SQL，让大家学会如何查询数据。当时有一本非常著名的书叫《MySQL必知必会》，美团那时招聘产品经理，一般都会加上一条要求：会使用SQL。据说，这是当时美团产品招聘的一大特色。\u003c/p\u003e\u003ch3 id=\"早期的美团更像一家科技-直销-公司\"\u003e早期的美团更像一家科技“直销”公司\u003c/h3\u003e\u003cp\u003e陈红兵（美团早期Android开发组成员，2011年7月15日入职）之前都是在一些纯技术的软件公司上班。加入美团后，他每天早上去工位时，总会遇到美团的销售同学在办公室开晨会，那个场面每次都让他联想到一家“传销公司”在开大会。陈红兵坦言，感觉那时候的美团更像一家科技“直销”公司。\u003c/p\u003e\u003ch3 id=\"复杂的事情简单化-简单的事情标准化-标准的事情流程化-流程的事情自动化\"\u003e复杂的事情简单化，简单的事情标准化，标准的事情流程化，流程的事情自动化\u003c/h3\u003e\u003cp\u003e在丁志虎（美团早期Android开发组成员，2011年8月29日入职）的眼中，美团最大的一个特点就是，创始人都几乎清一色的技术背景，无论是王兴、穆荣均、王慧文还是陈亮，都非常重视技术，对技术的投入也很足，包括美团也是业界很早就给技术团队配备了人体工学椅和MacBook的公司。\u003c/p\u003e\u003cp\u003e对丁志虎影响最大的一句话，来自夏华夏（现任美团首席科学家）：“我们要把复杂的事情简单化，简单的事情标准化，标准的事情流程化，流程的事情自动化”。\u003c/p\u003e\u003ch3 id=\"自己花钱体验产品流程-我爱上了看电影\"\u003e自己花钱体验产品流程，我爱上了看电影\u003c/h3\u003e\u003cp\u003e洪光焰（早期移动端后台Java开发组成员，2012年3月5日入职）负责猫眼的选座业务的开发时，为了保证产品体验和研发质量，他就花自己的钱去买票，虽然自己其实并不怎么喜欢看电影，但是因为自己在做产品，要对用户体验负责。如果作为开发人员都没有体验过买票，肯定不行，很可能因为某个技术或者使用问题导致产品流程跑不通。“后来，因为经常买电影票，我对电影真的还产生了一点点喜欢的感觉。”\u003c/p\u003e\u003cp\u003e值得一提的是，在早期，猫眼电影这块业务其实一直是王兴亲自在带。每次开会的时候，洪光焰和美团技术团队的小伙伴们都会近距离感受到王兴思考的缜密性，王兴提的问题都很犀利，如果做事不符合逻辑，他会很严厉地跟你聊这件事。\u003c/p\u003e\u003ch3 id=\"每天往床上一躺-就感觉-今天我又进步了\"\u003e每天往床上一躺，就感觉：今天我又进步了\u003c/h3\u003e\u003cp\u003e陈晓亮（早期iOS开发组成员，2012年11月12日入职）回忆，美团移动端前期一直都是在填坑，不断地补技术债。那个时候提测一个版本，经常能测出来上百个Bug，而且就一个测试工程师，他拼命的开Bug，研发同学拼命的改Bug，大家工作都很嗨。陈晓亮坦言：“根本没有时间去考虑什么技术战略这些东西。也是经过了两三年的时间吧，我们才将移动端的工程化体系建立了起来。”\u003c/p\u003e\u003cp\u003e那时候大家的冲劲都特别足。加班？根本不存在这个概念，也没这种要求。但是，你会看到晚上9点多还是有很多人自发地在办公室敲代码。陈晓亮那时经常11点多才回家，反正家离公司很近也无所谓，真的感觉不到累。最长的一次，他连续加了60天的班。“那时就是满腔热血，每天往床上一躺，就感觉今天我又进步了，哈哈。”\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://p0.meituan.net/travelcube/587e55672ad1ec1e8665e07eb3af402d34730.jpg\" alt=\"早期美团校招复盘会，照片中的多位同学都在美团担任技术高管\"/\u003e\u003c/p\u003e\u003ch3 id=\"周末用了两个白天-一个通宵的时间搞出来的大象-雏形\"\u003e周末用了两个白天、一个通宵的时间搞出来的大象“雏形”\u003c/h3\u003e\u003cp\u003e现在美团内部几万人天天不离手的通信工具大象，最早的版本出自王康（美团早期Android开发组成员，2012年2月22日入职）。是王兴决定要做IM，任务交给了王康。当时王康正在去驾校的路上，刚到那边就马上转车回到家中。周末的时候，王康用了两个白天一个通宵做出来了一个Demo版本。大象正式上线的时候，刚好是4月1日愚人节，美团的同学收到一封邮件，说内部开始有了自己通讯工具。当时大家都不敢相信，以为是愚人节玩笑，后来发现真的能下载，而且能用，同学们都惊叹不已。\u003c/p\u003e\u003ch3 id=\"女产品经理眼中的美团技术-第一印象是又low又土又山寨\"\u003e女产品经理眼中的美团技术：第一印象是又Low又土又山寨\u003c/h3\u003e\u003cp\u003e产品经理刘向品2012年3月5日加入美团后第一次参加技术团队的会议，她那天穿着一双红色的高跟鞋。当时团队人很少，美团的Android和iOS客户端加起来，也就十来个人，一个很小的会议室全装下了。然后进去一看，一群小年轻穿着拖鞋、大短裤……从那以后，刘向品感觉在美团再也没有穿过那双高跟鞋了。“真的，我当时的第一感觉就是，这个团队真的是又Low又土又山寨，哈哈哈！当然必须要承认，大家当时确实很拼，都很努力，加班也很辛苦。”\u003c/p\u003e\u003cp\u003e刘向品对技术同学们印象比较深的，可能就是“相爱相杀”的过程。她早期提出了一个版本规划，提了5个需求，结果技术团队给上线了6个需求。刘向品说：“你是不是以为早期的这些技术同学很厉害？告诉你，完全不是。这帮不靠谱的家伙，他们只上线了我提出的2个需求，还有3个需求挂着没做；同时还有4个‘野需求’上线，问怎么回事，说觉得这个需求该做就做了。”\u003c/p\u003e\u003cp\u003e刘向品笑着说：“为什么一个产品和技术的关系能处这么好？这都是当时‘战斗过程’中培养出来的‘革命友谊’。”\u003c/p\u003e\u003ch2 id=\"快速增长\"\u003e快速增长\u003c/h2\u003e\u003cp\u003e经过几年的努力建设，不断填坑，技术团队也完成了最早的基础建设，同时也建立了相对完善的工程技术体系。美团团购占据了绝对领先的市场份额。同时，还有谷歌、百度、腾讯的一大波技术牛人加入美团技术团队。\u003c/p\u003e\u003ch3 id=\"选择需要魄力-更需要信仰\"\u003e选择需要魄力，更需要信仰\u003c/h3\u003e\u003cp\u003e从Google回国的夏华夏（早期技术工程部技术负责人，2013年6月8日入职）加入美团的故事很有趣：他去美团接太太下班，发现美团的监控工具做得很好，虽然底层也是开源系统，但功能很简洁、很直观、也很好用。后来陆续又接触到很多美团的技术同学，发现整个技术团队虽然很小，但很务实，技术氛围很好，工作态度非常认真。\u003c/p\u003e\u003cp\u003e后来王兴、穆荣均正式向抛出了“橄榄枝”，夏华夏觉得美团做的事情很有意义，选择了降薪加盟这家小公司。之后他组建技术工程部，开始做基础组件、性能优化，包括技术存储、负载均衡、中间件系统等等。后来，又接手了运维和DBA系统优化方面的工作。除此之外，夏华夏还和早期的几位技术同事一起组建了美团技术学院，负责技术团队的培训、交流、宣传等工作。\u003c/p\u003e\u003ch3 id=\"随时准备着-出门团建也要背着电脑\"\u003e随时准备着：出门团建也要背着电脑\u003c/h3\u003e\u003cp\u003e张小虎（早期移动后台技术负责人）2013年5月2日加入美团后主要负责移动组的后台团队，分4个方向：团购移动、猫眼电影、大象、基础设施（RPC、缓存、消息队列等）。当时移动端的交易占比不断提升，面临的主要问题是流量大，到周末的时候，系统容易出问题。当时，他的小组有位同学，团建出门都会背上电脑以防万一，还真的被他遇到了一次宕机情况，打开自己的手机热点，在山上开始改Bug。张小虎记忆比较深的是，有次带自己的孩子刚到奥森公园北门，就收到报警，一路处理故障，后来家人也比较理解他的工作，说以后周六不出门以防公司有突发事情。\u003c/p\u003e\u003ch3 id=\"为公司招到更好的人才-特别有劲头\"\u003e为公司招到更好的人才，特别有劲头\u003c/h3\u003e\u003cp\u003e2014年3月加入美团的王栋主要负责美团平台搜索和推荐以及数据产品技术，当时大概带了三四十人左右的团队。\u003c/p\u003e\u003cp\u003e对王栋来说，印象中最深的事情就是校招。当时，为了招到很好的同学，真的很辛苦，每天从早上八点，一直到晚上九点。然后回到酒店后，还得改笔试卷子，经常熬到半夜2点多。当时，必须是靠咖啡的，当然，都是为了帮公司招到更好的人才，那时候也特别有劲头。王栋说：“我觉得自己很幸运，带出了很多优秀的校招生同学，包括周翔、曹浩、戚亦平等他们，现在都是在美团技术团队都发挥出了自己的价值。”\u003c/p\u003e\u003ch3 id=\"项目上线后看到日志反馈的数据-特别有成就感\"\u003e项目上线后看到日志反馈的数据，特别有成就感\u003c/h3\u003e\u003cp\u003e戚亦平（早期美团移动推荐与个性化团队成员，2013年6月6日入职）觉得美团的技术面试感觉非常好。面试官问他读了哪些方面的书，学到过哪些方面的技术，这给他留下了特别好的印象。\u003c/p\u003e\u003cp\u003e当时戚亦平和四五年轻的实习生一起做美团App的搜索和排序功能，就是首页的个性化推荐和“猜你喜欢”。搜索排序第一次上线。从线上开发，到离线数据计算，再到训练流程的设计，就是戚亦平跟一个实习生两个人一起完成的。戚亦平说：“上线之后，看到日志反馈的数据，当时特别有成就感。加班再多，都不觉得辛苦。”\u003c/p\u003e\u003ch3 id=\"最直观的感觉就是-大家眼睛里都闪着光\"\u003e最直观的感觉就是，大家眼睛里都闪着光\u003c/h3\u003e\u003cp\u003e曹浩2014年3月3日加入美团时，美团App的推荐搜索团队才十几个人。他和几个同事，除了做算法，还需要搞特征工程的研发，从零到一搭建起了美团的排序体系。当时仅针对访购率这一指标（每万人中有多少人购买），效果就提升了30%-40%。美团当时还做了用户调研，用户反馈也很好，大家普遍反映，不仅更快更好，而且还更准确，在美团App能够快速找到自己想吃的美食和店铺。\u003c/p\u003e\u003cp\u003e曹浩说：“2014年的时候，我们搜索推荐团队真的是干劲十足，刚好我们又身处移动化浪潮的新时代。那时候技术团队的口号‘每天前进30公里’给我们很大的力量。最直观的感觉就是，大家眼睛里都闪着光。”\u003c/p\u003e\u003ch3 id=\"为了进美团-我赔了百度公司5000块钱的违约金\"\u003e为了进美团，我赔了百度公司5000块钱的违约金\u003c/h3\u003e\u003cp\u003e加入美团对周翔同学来说，还是有点波折的。他毕业时三方先签了百度，后来才接到美团的Offer。他特别想进美团，也看了很多关于王兴的创业故事，在周翔心目中，美团是一家特别Cool的技术团队。最后，周翔赔了百度公司5000块钱的违约金。“当然，现在看起来，一切都是值得的。”\u003c/p\u003e\u003cp\u003e2014年6月，周翔跟自己电子科技大学的3个同学都加入美团App推荐组，他们也住在一起，每天回到宿舍后，还会继续讨论工作，所以每个人的成长速度都很快。当时，推荐组经常遇到性能问题，半夜两三点钟被警报喊醒，然后大家一起起床改Bug。记得最深刻的是一次问题非常棘手，一位小伙伴半夜4点打车回到公司去解决的。周翔说：“那时候，真的可以说是埋头钻进技术里去解决各种业务问题。虽然也经常加班，但是真的一点怨言都没有，乐在‘技’中。”\u003c/p\u003e\u003ch3 id=\"持续学习的文化以及对人才培养的重视\"\u003e持续学习的文化以及对人才培养的重视\u003c/h3\u003e\u003cp\u003e对魏永超（早期美团搜索团队成员，2014年1月6日入职）影响比较大的，是美团持续学习的文化以及对人才培养的重视，特别是Leader层对下属成长的关注。美团讲拥抱变化，魏永超汇报关系发生过多次变动。魏永超跟王栋（现美团外卖技术负责人）学到了很多技术层面的东西，能够从技术与业务结合的角度思考问题。他跟刘彭程（现美团到店技术负责人）学到了如何从团队人才培养的角度推动团队成员的学习和成长，同时美团也提供了很多挑战会引发他的思考。魏永超跟张锦懋（现美团基础研发平台的技术负责人）学会了从事情的角度出发，一针见血地指出问题所在，尽量站在一个旁观者给团队成员提供帮助，现在也帮助了很多技术同学在高速成长。\u003c/p\u003e\u003ch2 id=\"外卖狂飙突进\"\u003e外卖狂飙突进\u003c/h2\u003e\u003cp\u003e早在2012年年底团购大战格局初定时，王兴就觉得餐饮行业还有互联网化的其他机会，就让王慧文开始组建新产品部，带一个很小的团队去探索新业务。王兴可能也没想到，最后王慧文团队探索出来的外卖，会成为美团今天最大的业务，直到现在，还在不断打破世界纪录。与此同时，从外卖业务逐渐建立起来的配送平台能力，又为AI、机器人等高科技提供了用武之地。\u003c/p\u003e\u003cp\u003e2013年11月18日，美团外卖送出去第一单。\u003c/p\u003e\u003cp\u003e2019年7月27日，美团外卖日订单量突破3000万单。\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://p0.meituan.net/travelcube/ffc831cb589e4f514f783c19d4a7669041250.jpg\" alt=\"\"/\u003e\u003c/p\u003e\u003cp\u003e今天，美团配送已经成为全球领先的分钟级配送网络，服务全国360多万商家和4亿多用户，覆盖2800余座市县，日活跃配送骑手超过70万人。\u003c/p\u003e\u003ch3 id=\"只要你技术好-我就服你-跟你干\"\u003e只要你技术好，我就服你，跟你干\u003c/h3\u003e\u003cp\u003e2015年，洪磊（美团前端通道主席，2013年6月24日入职）接到任务，从美团平台转去负责外卖前端团队。最初他还有点犹豫，和外卖前端同学做了简单沟通后，就欣然接受了这份挑战。他得到团队同学很给力的支持，加上自己精通前端技术，很快跟小伙伴打成一片。洪磊觉得美团的工程师文化还是很好的，“只要你技术好，我就是服你的，可以跟你干”。\u003c/p\u003e\u003ch3 id=\"无数个不眠不休的夜晚-叠加在一起-一点一滴提升了用户体验\"\u003e无数个不眠不休的夜晚，叠加在一起，一点一滴提升了用户体验\u003c/h3\u003e\u003cp\u003e王栋到外卖之后，最难忘的是2015、2016年，那时订单量增长迅猛，系统压力巨大。一到中午，系统就经常报警，这时候大家就会非常默契地集中在美团外卖的“作战会议室”中，一起携手解决线上问题。\u003c/p\u003e\u003cp\u003e2015年的10月，外卖团队的推荐算法负责同学自己动手，每天在晚上八九点，忙完一天的工作之后，一点一点的梳理用户端的埋点数据。历时一个多月，终于理清楚了线上埋点的问题，为后续算法的应用奠定了坚实、可靠的基础。\u003c/p\u003e\u003cp\u003e2016年，为在不影响业务的同时实现绩效系统迁移，外卖技术部运营组和数据组同学放弃了中秋和国庆假期，连续奋战20余天，支持了绩效管理目标的达成。\u003c/p\u003e\u003cp\u003e正是由这样的无数个不眠不休的夜晚，叠加在一起，才一点一滴的提升了用户、商家、骑手和一线拓展人员的使用体验。\u003c/p\u003e\u003ch3 id=\"几百个casestudy文档是我们宝贵的财富\"\u003e几百个CaseStudy文档是我们宝贵的财富\u003c/h3\u003e\u003cp\u003e到家交易系统平台部负责人方建平（2014年8月5日入职）说，因为这些年来外卖交易系统出的事故比较多，所以该组同学写的CaseStudy（事故分析报告）也很多，外卖团队非常看重这项工作。基本上每次事故，无论大小，大家都会坚持尽快完成CaseStudy的撰写，并组织复盘，分析问题，总结经验。几年的积累，美团外卖沉淀了几百个CaseStudy文档，这也是美团技术团队最为宝贵的财富，一直到今天，交易系统团队也会常常组织回顾，包括新人入职也会组织对应的培训。\u003c/p\u003e\u003ch3 id=\"从外卖架构到无人配送\"\u003e从外卖架构到无人配送\u003c/h3\u003e\u003cp\u003e2015年5月，美团外卖业务当时已经初具规模，但系统很不稳定，每周要宕机好几次，而且好几次宕机都是发生在用餐高峰时期。夏华夏临危受命，到外卖组建架构团队。他跟很多技术骨干天天泡在一个称之为“作战会议室”里，周末也不休息，不断迭代升级、测试、监控整个系统。经过两个多月，终于将系统稳定性从98%提高到了20倍，接近99.9%左右，基本支撑了2015年暑期的订单量大涨；到2016年，随着我们的架构优化、运维自动化、测试自动化等工作的开展，外卖的稳定性已经提升到接近四个9。\u003c/p\u003e\u003cp\u003e2017年，夏华夏陆续把手头的地图、到餐技术、外卖架构等工作交接了出去，将全面精力放在内部孵化出来的美团无人配送项目上。功夫不负有心人，美团无人车在疫情期间落地，开始在北京送菜了。\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://p0.meituan.net/travelcube/8e1f7fa702336a5a1169f53e7b3d74b31516213.png\" alt=\"\"/\u003e\u003c/p\u003e\u003cp\u003e还有很多技术团队的故事，没有来得及写进来，敬请期待。\u003c/p\u003e\u003cp\u003e忆往昔峥嵘岁月稠，我们参与创造了历史，也收获了成长与感悟。这期间慢慢积累的一些东西，渐渐渗入我们的血液，成为我们的基因。\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://p0.meituan.net/travelcube/d2a5fcd930c67387e456a5ddc7bdfe3892897.jpg\" alt=\"\"/\u003e\u003c/p\u003e\u003cp\u003e感谢那些虽然已经离开，但曾为美团技术做出过贡献的小伙伴们，常回家看看。\u003c/p\u003e\u003cp\u003e感谢十年来无数技术同行对我们的支持（开源代码、技术图书和文章……）。\u003c/p\u003e\u003cp\u003e新的十年，继续既往不恋，纵情向前！\u003c/p\u003e\u003ch2 id=\"那些珍贵的老照片\"\u003e那些珍贵的老照片\u003c/h2\u003e\u003cp\u003e春天的花开，秋天的风，以及冬天的落阳。十年的时间，我们有过太多的回忆。我们还向美团同学征集了一些充满回忆的老照片。有同学告诉我，他私藏的很多照片都是第一次亮相。在美团技术团队工作过的同学，是否还能认出曾经的那个年轻的自己！\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://p0.meituan.net/travelcube/d42c74f63b086b5b4b1921f4894addca3070928.png\" alt=\"\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://p0.meituan.net/travelcube/7b9610cd2c07354afa7883779c79806b3149907.png\" alt=\"\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "Date": "2020-03-05T00:00:00Z",
  "Author": "soulteary@gmail.com"
}