{
  "Source": "donaldfeury.xyz",
  "Title": "Add Random Looping Background Music Using FFmpeg",
  "Link": "https://donaldfeury.xyz/add-random-looping-background-music-using-ffmpeg/",
  "Content": "\u003csection class=\"gh-content gh-canvas\"\u003e\n        \u003cp\u003eSo recently I decided to try adding some background music to my videos so it isn\u0026#39;t just me blathering the whole time. Naturally, I turn to my weapon of choice in these cases, FFmpeg.\u003c/p\u003e\u003cp\u003eThe music I use for this is from a project called \u003ca href=\"https://www.streambeats.com/\"\u003eStreamBeats\u003c/a\u003e, you should check it out.\u003c/p\u003e\u003ch2 id=\"select-random-music\"\u003eSelect Random Music\u003c/h2\u003e\u003cp\u003eI wanted to pick a random music file from a directory for the first part and use it later. For this, I wrote a simple script:\u003c/p\u003e\u003cpre\u003e\u003ccode class=\"language-sh\"\u003e#!/usr/bin/env sh\n\ndir=$1\nfind \u0026#34;$dir\u0026#34; | shuf -n 1 \u0026gt; tracklist.txt\n\nhead tracklist.txt\n\u003c/code\u003e\u003c/pre\u003e\u003col\u003e\u003cli\u003eI pass in the directory to use\u003c/li\u003e\u003cli\u003eI list out of contents of that directory using \u003ccode\u003efind\u003c/code\u003e\u003c/li\u003e\u003cli\u003eI pipe that output to \u003ccode\u003eshuf\u003c/code\u003e, which randomizes the list of files. With the \u003ccode\u003e-n 1\u003c/code\u003e flag, it will output only the first line\u003c/li\u003e\u003cli\u003eI write the output of all that to a text file for reference later, as well as using \u003ccode\u003ehead\u003c/code\u003e to list that file to stdout\u003c/li\u003e\u003c/ol\u003e\u003ch2 id=\"add-music\"\u003eAdd Music\u003c/h2\u003e\u003cp\u003eTime for the FFmpeg magic:\u003c/p\u003e\u003cpre\u003e\u003ccode class=\"language-sh\"\u003e#!/usr/bin/env sh\n\nvideo=$1\nbgm_dir=$2\noutput=$3\nbgm=\u0026#34;$(random_music \u0026#34;$bgm_dir\u0026#34;)\u0026#34;\n\nffmpeg -i \u0026#34;$video\u0026#34; -filter_complex \\\n    \u0026#34;amovie=$bgm:loop=0,volume=0.03[bgm];\n    [0:a][bgm]amix[audio]\u0026#34; \\\n    -map 0:v -map \u0026#34;[audio]\u0026#34; -shortest -c:v copy \u0026#34;$output\u0026#34;\n\u003c/code\u003e\u003c/pre\u003e\u003col\u003e\u003cli\u003eI have three arguments here\u003c/li\u003e\u003c/ol\u003e\u003cul\u003e\u003cli\u003eThe video to add the music to\u003c/li\u003e\u003cli\u003eThe directory you want to pick the random music from\u003c/li\u003e\u003cli\u003eThe path to write the new file to\u003c/li\u003e\u003c/ul\u003e\u003col\u003e\u003cli\u003eWe get the music file to load in using the random_music script and save it for later\u003c/li\u003e\u003cli\u003eI\u0026#39;ll talk about the important parts of this FFmpeg command\u003c/li\u003e\u003c/ol\u003e\u003cul\u003e\u003cli\u003e\u003ccode\u003eamovie=$bgm:loop=0,volume=0.03[bgm];\u003c/code\u003e - this loads the randomly chosen music file to make its audio stream available and with the loop argument set to 0, loops it indefinitely. The \u003ccode\u003evolume\u003c/code\u003e filter is used to adjust the volume of the music to be more \u0026#34;background music\u0026#34; appropriate\u003c/li\u003e\u003cli\u003e\u003ccode\u003e[0:a][bgm]amix[audio]\u003c/code\u003e - combines the audio from the video and the newly loaded background music into one audio stream\u003c/li\u003e\u003cli\u003e\u003ccode\u003e-shortest\u003c/code\u003e tells FFmpeg to stop writing data to the file when the shortest stream ends, which, in this case, is our video stream. The audio stream technically never ends since it loops forever.\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eTada, you should have a new version of your video with the randomly chosen music looping for the duration of the video.\u003c/p\u003e\u003chr/\u003e\u003cp\u003eDid you find this information useful? If so, consider heading over to my \u003ca href=\"https://donaldfeury.xyz/donate/\"\u003edonation\u003c/a\u003e page and drop me some support.\u003c/p\u003e\u003cp\u003eWant to ask a question or just chat? Contact me \u003ca href=\"https://donaldfeury.xyz/contact\"\u003ehere\u003c/a\u003e\u003c/p\u003e\n    \u003c/section\u003e",
  "Date": "2021-06-27T19:25:36Z",
  "Author": "Donald Feury"
}