{
  "Source": "donaldfeury.xyz",
  "Title": "My YouTube Workflow",
  "Link": "https://donaldfeury.xyz/my-youtube-workflow/",
  "Content": "\u003csection class=\"gh-content gh-canvas\"\u003e\n        \u003cp\u003eEven though I\u0026#39;m only about one month into my \u003cstrong\u003eYouTube\u003c/strong\u003e channel, I thought some people might interested in \u003cstrong\u003ehow\u003c/strong\u003e I go about creating and uploading the videos and thumbnails.\u003c/p\u003e\u003cfigure class=\"kg-card kg-embed-card\"\u003e\u003ciframe width=\"200\" height=\"113\" src=\"https://www.youtube.com/embed/m0JR5cQ3T_A?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\u003c/figure\u003e\u003cp\u003eTo summarize the video above, the process goes like this:\u003c/p\u003e\u003cp\u003eRecord the video using \u003cstrong\u003eOBS\u003c/strong\u003e, usually only involves one file but there are a few times I needed to start and stop again.\u003c/p\u003e\u003cp\u003eIf multiple recordings were done, concat them together using the \u003cstrong\u003edemuxer\u003c/strong\u003e concat method.\u003c/p\u003e\u003cp\u003eFind the timestamp in seconds in my video for the \u003cem\u003eplug.\u003c/em\u003e (a.k.a like, sub, blah blah)\u003c/p\u003e\u003cp\u003eRun the video through my finalize video script to add in the fade in and out, overlay the sub animation, and append the outro.\u003c/p\u003e\u003cp\u003eWhile it\u0026#39;s processing, I take a dumb snapshot with a webcam.\u003c/p\u003e\u003cp\u003eEdit snapshot in \u003cstrong\u003eGimp\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eDo a little color correction and probably brighten the image.\u003c/li\u003e\u003cli\u003eCrop it down to 1280x720, keeping my face to the right side of the image.\u003c/li\u003e\u003cli\u003eAdd text to the left side of the image, usually some variant of the video title.\u003c/li\u003e\u003cli\u003ePut a box behind the text to give them some contrast.\u003c/li\u003e\u003cli\u003eApply an image if applicable. (ex. FFmpeg logo, YouTube logo)\u003c/li\u003e\u003cli\u003e... That\u0026#39;s it, usually takes like five minutes.\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eQuickly check over the video once it\u0026#39;s done processing.\u003c/p\u003e\u003cp\u003eUpload if it looks good.\u003c/p\u003e\u003cp\u003eDo the usual SEO stuff (tags, description, title)\u003c/p\u003e\u003cp\u003eAdd thumbnail exported from \u003cstrong\u003eGimp\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eOnce the video is processed on YouTube, add the end screen where the fade-in starts.\u003c/p\u003e\u003cp\u003eAdd any cards if applicable, such as references to other videos. I always add the relevant playlist to the start of the video.\u003c/p\u003e\u003cp\u003eContent!\u003c/p\u003e\u003cp\u003eThat\u0026#39;s it for now. Once I get consistent lighting in my office, I\u0026#39;m gonna add proper color correcting to the finalization script.\u003c/p\u003e\u003chr/\u003e\u003cp\u003eDid you find this information useful? If so, consider heading over to my \u003ca href=\"https://donaldfeury.xyz/donate/\"\u003edonation\u003c/a\u003e page and drop me some support.\u003c/p\u003e\u003cp\u003eWant to ask a question or just chat? Contact me \u003ca href=\"https://donaldfeury.xyz/contact\"\u003ehere\u003c/a\u003e\u003c/p\u003e\n    \u003c/section\u003e",
  "Date": "2021-06-27T01:55:42Z",
  "Author": "Donald Feury"
}