{
  "Source": "donaldfeury.xyz",
  "Title": "How to replicate the output of the FullScreen template from StreamLadder",
  "Link": "https://donaldfeury.xyz/how-to-replicate-the-output-of-the-fullscreen-template-from-streaml/",
  "Content": "\u003csection class=\"gh-content gh-canvas\"\u003e\n        \u003cp\u003e\u003ca href=\"https://streamladder.com\"\u003eStreamLadder\u003c/a\u003e is a nifty little tool for creating vertical versions of your Twitch clips for platforms like Tiktok and YouTube Shorts. However, I like tinkering with \u003ca href=\"https://donaldfeury.xyz/tag/ffmpeg\"\u003eFFmpeg\u003c/a\u003e so I replicated the output with a simple command.\u003c/p\u003e\u003cp\u003eIf we look at the Fullscreen template, all it\u0026#39;s essentially doing is cropping the original clip down into a 9:16 ratio.\u003c/p\u003e\u003cp\u003eTo do the same with \u003ca href=\"https://donaldfeury.xyz/tag/ffmpeg\"\u003eFFmpeg\u003c/a\u003e we can just do the following:\u003c/p\u003e\u003cpre\u003e\u003ccode class=\"language-sh\"\u003e#!/usr/bin/env sh\n\n# the source video (in this case, a twitch clip)\ninput=$1\n\n# where you want to save the processed version\noutput=$2\n\nffmpeg \\\n\t-i \u0026#34;$input\u0026#34; \\\n\t-vf \u0026#34;crop=w=in_h*9/16:h=in_h,scale=1080x1920\u0026#34; \\\n\t-vcodec libx264 \\\n\t-crf 23 \\\n\t-preset veryfast \\\n\t-c:a copy \\\n\t-s 1080x1920 \\\n\t\u0026#34;$output\u0026#34;\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eThe main part of this command doing all the work is the video filter, denoted with \u003ccode\u003e-vf\u003c/code\u003e. We do \u003ccode\u003ew=in_h*9/16\u003c/code\u003e to set the width of the video to the 9:16 ratio compared to what the height of the video is while we keep the height the same with \u003ccode\u003eh=in_h\u003c/code\u003e. We finally scale the video up to 1080x1920 with the \u003ccode\u003escale\u003c/code\u003e filter.\u003c/p\u003e\u003cp\u003eIf the video quality looks a bit pixelated from scaling up too much, anywhere you see \u003ccode\u003e1080x1920\u003c/code\u003e replace with a smaller equivalent like \u003ccode\u003e720x1280\u003c/code\u003e\u003c/p\u003e\u003chr/\u003e\u003cp\u003eDid you find this information useful? If so, consider heading over to my \u003ca href=\"https://donaldfeury.xyz/donate/\"\u003edonation\u003c/a\u003e page and drop me some support.\u003c/p\u003e\u003cp\u003eWant to ask a question or just chat? Contact me \u003ca href=\"https://donaldfeury.xyz/contact\"\u003ehere\u003c/a\u003e\u003c/p\u003e\n    \u003c/section\u003e",
  "Date": "2021-08-17T23:37:46Z",
  "Author": "Donald Feury"
}