{
  "Source": "donaldfeury.xyz",
  "Title": "Setting up MongoDB on Windows",
  "Link": "https://donaldfeury.xyz/setting-up-mongodb-on-windows/",
  "Content": "\u003csection class=\"gh-content gh-canvas\"\u003e\n        \u003cp\u003eFor a full overview of MongoDB and all my posts on it, check out my \u003ca href=\"https://donaldfeury.xyz/introduction-to-mongodb/\"\u003eoverview\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eMongoDB can be quickly and easily set up on Windows using the default MSI installation wizard provided by the MongoDB team.\u003c/p\u003e\u003cp\u003eTo get the installer, follow these steps:\u003c/p\u003e\u003cul\u003e\u003cli\u003eGo to the \u003ca href=\"https://www.mongodb.com/try/download/community\"\u003eMongoDB Download Center\u003c/a\u003e\u003c/li\u003e\u003cli\u003eChoose a specific version of MongoDB to install if you wish, otherwise, just leave it on the default version\u003c/li\u003e\u003cli\u003eFor \u003cstrong\u003ePlatform\u003c/strong\u003e, choose \u003cstrong\u003eWindows\u003c/strong\u003e\u003c/li\u003e\u003cli\u003eFor \u003cstrong\u003ePackage\u003c/strong\u003e, choose \u003cstrong\u003eserver\u003c/strong\u003e\u003c/li\u003e\u003cli\u003eClick the Download button\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eOnce the installer has finished downloading, go ahead and run it.\u003c/p\u003e\u003cul\u003e\u003cli\u003eChoose your setup type - choose \u003cstrong\u003eComplete\u003c/strong\u003e if you don\u0026#39;t want to choose what gets installed. If you do want to choose, select \u003cstrong\u003eCustom\u003c/strong\u003e\u003c/li\u003e\u003cli\u003eFor the \u003cstrong\u003eService Configuration\u003c/strong\u003e, if you want MongoDB to be managed as a Windows Service and start automatically, tick the box for \u003cstrong\u003eInstall MongoDB as a Service\u003c/strong\u003e. ( I assume MongoDB is set up as a service for this tutorial)\u003c/li\u003e\u003c/ul\u003e\u003cblockquote\u003eYou can choose to have a default Window Network User manage the service or you can customize the service setup\u003c/blockquote\u003e\u003cul\u003e\u003cli\u003eIf you want to install \u003ca href=\"https://www.mongodb.com/products/compass\"\u003eMongo Compass\u003c/a\u003e, a GUI application for interacting with your MongoDB data, you can do so as well.\u003c/li\u003e\u003cli\u003eOnce installation is complete, MongoDB will already be running and accessible.\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eOnce MongoDB is running, it will be available at \u003ccode\u003emongodb://localhost:27017\u003c/code\u003e. You can connect to it using various tools such as \u003ca href=\"https://docs.mongodb.com/mongodb-shell/\"\u003emongosh\u003c/a\u003e, \u003ca href=\"https://www.mongodb.com/products/compass\"\u003eMongo Compass\u003c/a\u003e, or any programming language using a module for MongoDB.\u003c/p\u003e\u003chr/\u003e\u003cp\u003eDid you find this information useful? If so, consider heading over to my \u003ca href=\"https://donaldfeury.xyz/donate/\"\u003edonation\u003c/a\u003e page and drop me some support.\u003c/p\u003e\u003cp\u003eWant to ask a question or just chat? Contact me \u003ca href=\"https://donaldfeury.xyz/contact\"\u003ehere\u003c/a\u003e\u003c/p\u003e\n    \u003c/section\u003e",
  "Date": "2021-08-02T21:26:29Z",
  "Author": "Donald Feury"
}