{
  "Source": "donaldfeury.xyz",
  "Title": "Who even needs a GUI video editor when you have FFmpeg",
  "Link": "https://donaldfeury.xyz/who-even-needs-a-gui-video-editor-when-you-have-ffmpeg/",
  "Content": "\u003csection class=\"gh-content gh-canvas\"\u003e\n        \u003cp\u003eSo I\u0026#39;ve been messing around with FFmpeg a lot to see how much video editing I can do without using an actual GUI video editor, so far it turns out that the answer is quite a bit.\u003c/p\u003e\u003cp\u003eI go over three main common tasks I\u0026#39;ve needed to do recently with only FFmpeg:\u003c/p\u003e\u003cp\u003eCutting out a section of a video into its own file\u003c/p\u003e\u003cul\u003e\u003cli\u003eThe main benefit of this is that this process does not cause a re-encode, which saves an amazing amount of time. When I did the same thing in Davinci Resolve, it took 15ish minutes to render out the clip. FFmpeg took a whole 20 seconds.\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eCleaning up a video clip by removing \u0026#34;frozen frames\u0026#34;, using the FFmpeg filter called \u003cstrong\u003empdecimate\u003c/strong\u003e (Frozen frames are sections of a video where there appears to be nothing happening, hence it looks frozen)\u003c/p\u003e\u003cul\u003e\u003cli\u003eThis is really useful for making time lapses of processes, as you remove all the dead frames and you get only 100% action going on.\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eTaking the \u003cem\u003edecimated\u003c/em\u003e video and creating a time-lapse of any duration in seconds by calculating the value needed to adjust the presentation timestamps to get the desired duration.\u003c/p\u003e\u003cul\u003e\u003cli\u003eThis one has been really handy for making time lapses of my wife\u0026#39;s design work. I\u0026#39;ve used it so far to make versions for Instagram and Tiktok.\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eCheck out the video below for a visual demonstration and thank you for your time.\u003c/p\u003e\u003cfigure class=\"kg-card kg-embed-card\"\u003e\u003ciframe width=\"200\" height=\"113\" src=\"https://www.youtube.com/embed/simSapaQOCE?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\u003c/figure\u003e\u003chr/\u003e\u003cp\u003eDid you find this information useful? If so, consider heading over to my \u003ca href=\"https://donaldfeury.xyz/donate/\"\u003edonation\u003c/a\u003e page and drop me some support.\u003c/p\u003e\u003cp\u003eWant to ask a question or just chat? Contact me \u003ca href=\"https://donaldfeury.xyz/contact\"\u003ehere\u003c/a\u003e\u003c/p\u003e\n    \u003c/section\u003e",
  "Date": "2021-06-27T00:18:20Z",
  "Author": "Donald Feury"
}