{
  "Source": "donaldfeury.xyz",
  "Title": "Error Chains in Go 1.13",
  "Link": "https://donaldfeury.xyz/error-chains-in-go-1-13/",
  "Content": "\u003csection class=\"gh-content gh-canvas\"\u003e\n        \u003cp\u003eGo added a neat feature in 1.13 that they call \u003ccode\u003eerror chains\u003c/code\u003e\u003c/p\u003e\u003cp\u003eErrors can now implement a method called \u003ccode\u003eUnwrap\u003c/code\u003e that should return another error. Typically, this is an error that occurred further down in the call stack.\u003c/p\u003e\u003cp\u003eIt is very common in go to have errors get tossed further and further back up the call stack as functions resolve until it\u0026#39;s finally handled properly. Error chains allow you to carry a series of errors all the way back up the call stack more easily.\u003c/p\u003e\u003cp\u003eThey added two new functions in the \u003ccode\u003eerrors\u003c/code\u003e package to interact with this concept, \u003ccode\u003eIs\u003c/code\u003e and \u003ccode\u003eAs\u003c/code\u003e\u003c/p\u003e\u003cp\u003e\u003ccode\u003eIs\u003c/code\u003e takes an argument of an error and another error, returns true if any instance of the second error occurs in the first error\u0026#39;s chain, and false otherwise.\u003c/p\u003e\u003cp\u003e\u003ccode\u003eAs\u003c/code\u003e takes the same arguments, but sets the value of the second argument equal to the error that was found in the first error\u0026#39;s chain if it was present.\u003c/p\u003e\u003cp\u003eCheck out the video to see the concept in action.\u003c/p\u003e\u003cfigure class=\"kg-card kg-embed-card\"\u003e\u003ciframe width=\"200\" height=\"113\" src=\"https://www.youtube.com/embed/eeKCFg-d2UE?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\u003c/figure\u003e\u003cp\u003eIf you liked it and want to know when I post more, be sure to \u003ca href=\"https://www.youtube.com/channel/UCTHij3Ac5GizLsn5yB4IX_Q?sub_confirmation=1\"\u003esubscribe\u003c/a\u003e and thank y\u0026#39;all again for your time!\u003c/p\u003e\u003chr/\u003e\u003cp\u003eDid you find this information useful? If so, consider heading over to my \u003ca href=\"https://donaldfeury.xyz/donate/\"\u003edonation\u003c/a\u003e page and drop me some support.\u003c/p\u003e\u003cp\u003eWant to ask a question or just chat? Contact me \u003ca href=\"https://donaldfeury.xyz/contact\"\u003ehere\u003c/a\u003e\u003c/p\u003e\n    \u003c/section\u003e",
  "Date": "2021-06-27T18:55:41Z",
  "Author": "Donald Feury"
}