{
  "Source": "solidot",
  "Title": "科技公司的命运齿轮",
  "Link": "https://www.solidot.org/story?sid=65761",
  "Content": "\u003cdiv class=\"p_mainnew\"\u003e\n\t\t\t\t\t\n\n\u003cdiv style=\"text-align: center;\"\u003e作者：高飞\u003c/div\u003e\n\n\n\u003cp\u003e\u003ci\u003e\u0026lt;编者按\u0026gt; 此前，奇客Solidot进行了一次用户投票，问大家对发展方向的看法，其中排名前三的选项之一是专栏。于是，我们就先进行这样一个尝试，开设“奇客故事”专栏，本专栏将主要探讨“技术文化如何改变社会文化”话题。这是奇客solidot第一次尝试发布长文章，自然也是对专栏功能的试水。专栏文章只代表作者本人看法，不代表站方意见，如果大家也有兴趣在奇客solidot开设专栏，不妨联络站方。\u003c/i\u003e\u003c/p\u003e\n\n\u003cp\u003e中国的国庆节期间，科技公司进行了一系列的资本大操作。其中有AMD拟收购赛灵思这样的百亿美金大整合，也有IBM涉及百亿美金营收变动的世纪大分拆。\u003c/p\u003e\n\n\u003cp\u003e生存还是毁灭，作为一个问题，困扰了哈姆雷特很久。\u003c/p\u003e\n\n\u003cp\u003e动辄百亿美金的分拆还是收购，显然也是一个问题。但对科技公司而言，却是司空见惯的操作。除了这两起并购分拆案，英伟达和ARM的百亿美金收购案，早已悬在空中。\u003c/p\u003e\n\n\u003cp\u003e科技公司为什么热衷此项操作，需要从拆解「科技公司」四个字开始，我们先来谈一谈「科技」，再说一说「公司」。\u003c/p\u003e\n\n\u003cp style=\"text-align: center;\"\u003e\u003cimg src=\"https://img.solidot.org/0/980/lisIlPlnps.jpg\"/\u003e\u003c/p\u003e\n\n\u003cp\u003e\u003cb\u003e“科技”：天生不可“算命”\u003c/b\u003e\u003c/p\u003e\n\n\u003cp\u003e和其他传统行业不同，科技公司最大的特点是不确定性，更准确的说，是技术的不确定性。\u003c/p\u003e\n\n\u003cp\u003e技术的不确定性，会造成业务的不确定性。和其他公司相比，科技公司的产业格局，会发生逆转性的变化。\u003c/p\u003e\n\n\u003cp\u003e我们可以用汽车行业和科技公司做个比较。\u003c/p\u003e\n\n\u003cp\u003e德国工程师卡尔·本茨（即“奔驰”的谐音）被公认是汽车的发明者，美国人亨利·福特是廉价汽车的创造者（通过生产线制造）。距离本茨发明汽车已经过去130年，距离福特的第一条生产线已经过去107年，但是奔驰和福特汽车，依然是全球重要的汽车品牌。\u003c/p\u003e\n\n\u003cp\u003e同时，汽车的动力体系和主要形态，在超过百年的历史岁月中，也没有发生根本性的变化（直到埃隆·马斯克主导的特斯拉出现，我们会在稍后的奇客故事里，专门讨论特斯拉的问题）。\u003c/p\u003e\n\n\u003cp\u003e与之相比，科技产业的变化则日新月异。\u003c/p\u003e\n\n\u003cp\u003e以个人计算设备为例，我们经历了计算机到笔记本再到智能手机的三段式发展，但是故事中的角色如走马灯般变化。\u003c/p\u003e\n\n\u003cp\u003e第一个造出个人PC的IBM公司，已经将PC在16年前出售给联想，业务重点转向现在的混合云；第一个造出笔记本电脑的东芝公司，在今年的8月10日，将业务出售给夏普，信息通信业务只剩下数字复印印刷；第一个造出智能终端（诺基亚的塞班手机）的诺基亚，已经不再造手机，埋头研究系统网络；更不用说第一个将安卓手机搞的风生水起的HTC，早已经将业务重心放到了VR。\u003c/p\u003e\n\n\u003cp\u003e对汽车公司而言，其燃油发动机是其百年历史亘古不变的真理，但是对科技公司而言，它们的技术发动机，大概以二十年为周期就需要进行更换。而且换掉哪一个，换为哪一个，没有原则可循，无法预测。\u003c/p\u003e\n\n\u003cp\u003e正因为技术的不可预测性，所以在科技产业，留下了很多看似很蠢的名言，比如“我完全想不出个人可以用电脑干嘛用”、“世界有5台计算机恐怕就够了”、“iPhone这样的手机，其实并没有什么新鲜”等等等等。这些话现在看来很蠢，但是在当时，却再合理不过。\u003c/p\u003e\n\n\u003cp\u003e谈完「科技」二字，再来讲一下「公司」。\u003c/p\u003e\n\n\u003cp\u003e\u003cb\u003e“公司”：与生态相爱相杀\u003c/b\u003e\u003c/p\u003e\n\n\u003cp\u003e就像科技和其他产业存在巨大差别一样，科技公司作为组织实体，与传统行业公司在运行机制上，也有很大不同。\u003c/p\u003e\n\n\u003cp\u003e对科技公司而言，生态平台是至关重要的。\u003c/p\u003e\n\n\u003cp\u003e科技产业，一般不强调自己做所有事情。\u003c/p\u003e\n\n\u003cp\u003e拿个人电脑来说，IBM虽然有做个人电脑的念头，但是它一不造CPU，二不造操作系统，而是将其分别“外包”给微软和英特尔。\u003c/p\u003e\n\u003cp\u003e即使是苹果，这样看起来芯片设计和操作系统开发能力都有的公司，一来不造芯片，二来不怎么搞APP。相比较而言，你很难想象一个汽车公司，不造汽车（当然PPT造车另当别论）。\u003c/p\u003e\n\n\u003cp\u003e这些外部能力，对科技公司而言，就叫做生态平台。\u003c/p\u003e\n\n\u003cp\u003e相信，你对这些名字非常熟悉，比如X86生态、Windows生态、ARM生态、骁龙生态、iOS生态，国内如鲲鹏生态，等等。\u003c/p\u003e\n\n\u003cp\u003e科技公司虽然互有竞争，但是往往会在生态平台层面互相合作，甚至相互依存。\u003c/p\u003e\n\n\u003cp\u003e\u003cb\u003e“命运齿轮”：收购还是分拆\u003c/b\u003e\u003c/p\u003e\n\n\u003cp\u003e谈完「科技」与「公司」，我们最后终于可以谈一谈收购和分拆，其实道理已经不言而喻。\u003c/p\u003e\n\n\u003cp\u003e无论是分拆还是收购，最终都会服务五个目的，我们可以用一副齿轮图片，来更形象的展示说明。\u003c/p\u003e\n\n\u003cp style=\"text-align: center;\"\u003e\u003cimg src=\"https://img.solidot.org/0/982/li6x0RXCNx6U.jpg\"/\u003e\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u003cb\u003e目的一：更换发动机\u003c/b\u003e\n\u003c/li\u003e\u003c/ul\u003e\n\n\n\u003cp\u003e每个公司，都有一项核心业务，起到对公司整体业务的支撑推动作用，如同图中金色齿轮（核心业务），带动了其他银色齿轮（关联业务）。\u003c/p\u003e\n\n\u003cp\u003e因为技术的不可预测性，这项核心业务会经常性的变动，比如五十年前对IBM至关重要的PC，后来就变成了可有可无的业务。\u003c/p\u003e\n\n\u003cp\u003e所以尽管每个公司都需要一个金色齿轮，但这个齿轮也需要更换。\u003c/p\u003e\n\n\u003cp\u003e同样由于技术的不可预测性，科技公司难以保证金色齿轮总能从内部研发而成。\u003c/p\u003e\n\n\u003cp\u003e收购其他人的技术，作为自己的新金色齿轮，此为目的一。\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u003cb\u003e目的二：力争生态上游\u003c/b\u003e\n\u003c/li\u003e\u003c/ul\u003e\n\n\n\u003cp\u003e尽管科技公司倡导竞争合作并重。\u003c/p\u003e\n\n\u003cp\u003e但是所有人都清楚，主导生态平台，往往能获得产业利益链条中最核心的利益。\u003c/p\u003e\n\n\u003cp\u003e如同造出个人电脑的IBM，其实远不如掌握X86生态，和Windows生态的英特尔、微软利益来的更多一样。\u003c/p\u003e\n\n\u003cp\u003e所以，投资收购上游技术，切入生态平台，此为目的二。\u003c/p\u003e\n\n\n\u003cul\u003e\n\u003cli\u003e\u003cb\u003e目的三：重置业务独立性\u003c/b\u003e\n\u003c/li\u003e\u003c/ul\u003e\n\n\n\u003cp\u003e在齿轮组合中，金色齿轮是起带动作用的，银色齿轮是被带动的。\u003c/p\u003e\n\n\u003cp\u003e但是这种主次关系，不一定是持久的。现实情况中，很可能银色齿轮经过发展，具备了自我积蓄动能的作用。而金色齿轮因为各种各样的关系，需要新的动能组合。\u003c/p\u003e\n\n\u003cp\u003e此时，金色齿轮不仅不能带动银色齿轮，反而可能造成金色齿轮和银色齿轮之间的“差速”。\u003c/p\u003e\n\n\u003cp\u003e因此，将银色齿轮独立分拆，让其成为新业务的金色齿轮，为金色齿轮，匹配新的银色齿轮，此为目的三。\u003c/p\u003e\n\n\u003cp\u003eIBM分拆公司，投资红帽，可以看作是目的一与目的三的组合。\u003c/p\u003e\n\n\n\u003cul\u003e\n\u003cli\u003e\u003cb\u003e目的四：保障业务安全性\u003c/b\u003e\n\u003c/li\u003e\u003c/ul\u003e\n\n\n\u003cp\u003e尽管科技公司之间倡导竞合，生态互用。甚至有的公司本身就是一组银色齿轮，需要其他公司的生态作为其金色齿轮。\u003c/p\u003e\n\n\u003cp\u003e但是由于地缘政治、资本意志等关系，他人生态不见得一直可用，通过投资收购上游技术，保障自身业务连续性，为自己设置备用金色齿轮，此为目的四。\u003c/p\u003e\n\n\u003cp\u003e这方面，就不举例子，摘录一段懂得都懂的废话如下：\u003c/p\u003e\n\n\u003cp\u003e有一说一，这件事大家懂得都懂，不懂得，说了你也不明白，不如不说。你们也别来问我怎么了，利益牵扯太大，说了对你们也没什么好处，当不知道就行了，其余的我只能说这里面水很深，牵扯到很多大人物。详细资料你们自己找是很难找的，网上大部分已经删除干净了，所以我只能说懂得都懂，不懂得也没办法。\u003c/p\u003e\n\n\u003cp\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cb\u003e目的五：满足资本胃口\u003c/b\u003e\n\u003c/li\u003e\u003c/ul\u003e\n\n\n\u003cp\u003e由于技术的不确定性，科技公司往往需要资本支持，才能保证技术研发的持续性。风险投资的出现，就是伴随科技公司的发展出现的。而科技公司，往往又需要满足资本的高增长要求，所以通过收购，做大营业额，始终给资本市场一个好听的成长故事。与投资整合相反，持续卖掉一些增产不增收的业务，增加短期回报，做大每股盈利，同样可以实现这个目的。\u003c/p\u003e\n\n\u003cp\u003e这方面，也不需要举例了，同样懂得都懂。\u003c/p\u003e\n\n\u003cp\u003e著名经济学家科思在《厂商的本质》中指出，生产活动在市场交易中需要交易成本，如果这些交易活动在厂商内部进行的成本小于在外部市场中的交易成本，厂商就会出现，从而把原本的市场交易变为厂商内部配置，以达到节省交易成本的目的。\u003c/p\u003e\n\n\u003cp\u003e其实无论是整合还是分拆，所有的道理都可以用科思这段话作为解释。\u003c/p\u003e\n\n\u003cp\u003e如果用自己的东西（内部交易成本高），还不如用别人的东西、买别人的东西，这就是生态合作和投资收购（外部交易低）；如果自己的东西，与其放在手里贬值（内部交易成本高），不如任其自由发展（外部交易成本低），这就是分拆。这说的就是目的一、目的二和目的三的道理。\u003c/p\u003e\n\n\u003cp\u003e不过很多时候，资本上的事情，又不能只用技术来解释，特别是在2020年的当下，这就是目的四和目的五的道理了。\u003c/p\u003e\n\n\u003cp\u003e2008 年，联想1亿美金分拆卖掉了手机业务，一年后，又花2亿美金买回来手机业务，在目的一和目的三之间反复横跳。\u003c/p\u003e\n\n\u003cp\u003e就更显出命运的不可知了。\u003c/p\u003e\t\t\t\t\t                \u003c/div\u003e",
  "Date": "2020-10-10T07:20:07Z",
  "Author": "wanwan"
}