{
  "Source": "solidot",
  "Title": "“拜登政府”如何影响全球科技业？",
  "Link": "https://www.solidot.org/story?sid=66090",
  "Content": "\u003cdiv class=\"p_mainnew\"\u003e\n\t\t\t\t\t\n\u003cdiv style=\"text-align: center;\"\u003e作者｜高飞, 奇客故事（ID：cybergushi）\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e毫无疑问，美国总统选举是一项政治事件。不过，当美联社按照惯例宣布拜登将成为下一任美国总统的时候，不少其他国家元首并未按惯例第一时间向他发出贺信。原因不在拜登，而在于他的对手特朗普——这个被认定绝对不会按惯例出牌的人。选举日过后已经有段时日，惯例中的交接还未开始。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e不过，政治悬案不会悬置太久，也不影响我们在这里先分析未来的“拜登政府“将如何对科技产业造成哪些影响。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\u003cimg src=\"https://img.zhiding.cn/5/445/li1UbjDKsu4TQ.jpg\"/\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\u003cb\u003e巨头示爱\u003c/b\u003e\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e和稍显迟来的其他国家元首的表态不同，不少美国科技领袖第一时间表达了他们的态度，CNBC统计了一份长名单[注一]：\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e亚马逊公司CEO杰夫·贝索斯在特朗普总统的整个任期内一直与其关系紧张。他的表态是：拜登与哈里斯的胜出标志着“团结、同理心与得体的言行再次占据主流”。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e预言了新冠疫情的微软创始人比尔·盖茨则表态：希望“新一届政府能够与国会两党领导人一同努力，成功控制住这场流行病的蔓延。”\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003eFacebook公司COO谢丽·桑德伯格与妻子普莉希拉·陈向胜选副总统阿里斯表示祝贺：“这是231年以来，第一位以亚裔有色女性身份当选副总统的移民后代。美国曾经在无数个瞬间朝着更加多元化的政府组成迈出重要步伐，而今天正是其中之一。”\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e苹果公司创始人史蒂夫·乔布斯的遗孀、爱默生基金会创始人劳伦娜·鲍威尔·乔布斯同样对拜登和哈里斯的胜出表示祝贺：这位副总统的当选代表着“玻璃天花板终于被彻底粉碎”。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e思科公司CEO查克·罗宾斯的表态是：该公司与拜登及哈里斯一样，“坚信我们必须为所有人建立起更具包容性的未来。”\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e甚至上一代互联网巨头，Revolution公司CEO（美国在线AOL联合创始人）史蒂夫·凯斯直言不讳，对拜登当选第46届美国总统感到“非常高兴”。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\u003cb\u003e并非偏爱\u003c/b\u003e\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e科技公司对拜登爱从何来？难道民主党偏爱科技巨头？非也。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e尽管中美贸易出现纷争，但是大洋两岸，科技互联网平台公司都在成为政府眼中需要加强监管治理的对象。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e在中国，双11时，中国相关部门也发布了对平台电商公司的各项管控措施，持续多年的“电商平台促销二选一”或许将走进历史。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e在美国，根据科技媒体The Information的研究[注二]，针对大型科技企业的反垄断执法行动成为美国两党广泛支持的共同领域之一。目前正在对Facebook提起诉讼的美国司法部及联邦贸易委员会已经组建起由专业人士组成的反垄断小组，相关执法并不会受到政府换届的干扰。与特朗普政府一样，拜登政府可能会继续敦促反垄断机构以积极态度对科技企业提起诉讼。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e甚至，拜登政府对巨头态度还要更苛刻。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e比如，来自民主党支持州的新任司法部长很可能将谷歌的网络搜索引擎业务与合作伙伴关系纳入反垄断诉讼。拜登的胜利，也许还会令谷歌身陷非法利用市场支配力统治数字广告市场的指控。民主党总检察长甚至有可能借此机会将矛头指向亚马逊、苹果以及Facebook等潜在目标。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e更严重的，民主党人还希望在流程上加强对巨头监管。一方面，民主党人希望对反垄断法相关诉讼的执行流程进行改革。另一方面，民主党人还曾提出修改法律的申请，加大Facebook或谷歌等技术收购小型企业的难度。与之对应，共和党人虽然也支持依靠法律打击有违反托拉斯法的行为，但却大多反对修改现行法规。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e既然如此，科技公司对拜登的偏爱来自何方？首先排除错误答案，科技公司的偏爱不来自拜登和特朗普的主要分歧——税收。The Information分析认为，从执政策略来看，拜登与特朗普之间最显著的区别之一，体现在税收层面。特朗普推动了美国自上世纪八十年代以来最重大的税法改革之一，将企业的税率从35%降低至21%。特朗普的税制改革还下调了个人所得税率，将最高比例从39.6%下降至37%。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e特朗普的税收计划还将遗产税的免税额度上调了一倍，分别为个人1000万美元以及夫妻2000万美元。拜登的计划则是针对年收入超过40万美元的个人提高税率，并将遗产税恢复到之前的水平。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e先不说，如果参议院多数席位仍然掌握在共和党手中，拜登将很难甚至根本不可能通过任何有意义的税制调整。更何况，已经富可敌国的科技公司似乎也不会对更低的税率有什么方案。尽管巴菲特和盖茨都曾表态说“自己交的税太少了”。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e科技公司对拜登政府的偏爱，和美国内部财税政策无关，而是拜登政府的国际贸易政策有关。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e拜登政府理念，对美国科技公司更有利。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\u003cb\u003e喜从何来\u003c/b\u003e\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e原因何在，这要从科技公司的发展动能说起。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e现代科技公司的发展动能受三个主要因素影响，我们用下边这个齿轮图作为示意——政府监管（严厉程度）、人才储备（高低程度）和市场规模（大小程度）。其中，政府监管越少越少，人才储备越多越好，市场规模则越大越好。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e总体而言，拜登政府的政策对其中两项原则有利，对一项原则不利。有利的两项源自拜登政府外贸政策有利于科技公司招募人才，有利于科技公司扩大市场。不利的一方面我们刚才谈到了，就是更严格的监管。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e二大于一，拜登政府的政策，对美国科技公司利大于弊。这里分别做下两个有利因素的分析。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e首先是人才问题。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e科技公司是数字经济的赋能者，更是最典型不过的知识经济代表。每一个科技公司的成功，都离不开知识的创造者——人才。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e尽管马云讲过很多有争议的话，但是他讲“员工第一、客户第二、股东第三”这句话，对科技公司毫无疑问是对的。而在员工之中，高天赋员工又是最重要的。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e在科技业，有一个「rock-star principle（摇滚明星原则）」人才定律。该说法源自于加州圣莫尼卡的一个实验，一些程序员被要求在120分钟内完成一系列编程和排错任务，其中有高级人才，也有一般人才。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e研究人员起初估计，最出色程序员的效率大约是普通程序员的2-3倍，但结果是出人意料的。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e研究显示，最好的程序员的编程速度是最差的程序员的 20 倍，排除错误的速度是 25 倍，程序执行速度是 10 倍。网飞（Netflix）是美国硅谷在人才管理上最出色的公司之一，其CEO Reed Hastings 从业多年来的人才经验是，“摇滚明星程序员”的价值不是普通程序员的 10 倍，而是100倍甚至10000倍。实际上，这句话比尔·盖茨也讲过，最好的程序员的价值是普通程序员的一万倍。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e也就是说，对于科技公司而言，谁能招募到最顶尖的科技人才，谁就最可能获得成功。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e科技公司最需要的顶尖技术人才，要求有较强数学天赋，中国、印度等国在这方面是占据人才规模优势的。特朗普政府的政策，正在将这些人才挡在美国科技公司门外，而拜登政府则可能将这些人才请回来。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e拜登胜选，极大程度上得益于奥巴马势力的支持，而奥巴马前助手、目前专为科技企业提供建议的Jim Messina透露，拜登政府目前的头号要务，就是马上撤销特朗普政府设置的移民政策，同时拜登必须取消H-1B限制，H-1B为专门面向外国高级技术人才发放的临时工作签证。这项建议大概率会成为现实。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e拜登政府还有望支持诸如《高技能移民公平法》之类的立法倡议，帮助硅谷企业招募到更多技术人才。据称，该法案将向印度的大量技术人才敞开大门，帮助他们尽快获得美国的永久居留权。目前，美国面向印度民众提供的绿卡上限约为每个邦10000张。此法案将取消印度各邦的绿卡上限，确保美国科技行业快速吸纳大量持有绿卡的印度员工。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e如果拜登政府能解决了签证问题，就等于帮助美国科技公司解决了最基本的技术供给问题，他们焉能不开心？\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e再说市场规模问题。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e我们也要要先介绍两项概念，分别是「边际成本递减原则」和「梅特卡夫定律」。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e科技公司所提供的能力是无形的产品服务，完美符合经济学上的边际成本递减原则。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e科技公司开发一项技术需要极高的成本，而一旦开发成可上市的产品，多提供一项产品的生产成本则是极低的。拿微软当年的Windows操作系统举例，开发某个版本的Windows会耗费微软十数亿美金的成本，但是一旦开发完成，多生产一份Windows光盘的成本几乎可以忽略不计。因此，对科技公司来说，完全没有本地市场的概念，一出生市场就是星辰大海。如果不是语言版本、监管限制，任何一家公司的科技产品，可以第一时间卖到全球市场。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e其次是梅特卡夫定律。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e梅特卡夫定律是一个关于网络的价值和网络技术的发展的定律，由乔治·吉尔德于1993年提出，但以计算机网络先驱、3Com公司的创始人罗伯特·梅特卡夫的姓氏命名，以表彰他在以太网上的贡献。其内容是：一个网络的价值等于该网络内的节点数的平方，而且该网络的价值与联网的用户数的平方成正比。该定律指出，一个网络的用户数目越多，那么整个网络和该网络内的每台计算机的价值也就越大。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e对于科技公司而言，梅特卡夫定律就意味着使用其服务的用户越多，其服务本身的价值越大，且呈指数级关系。比如一个10000个用户的网络，比起100个用户的网络来说，价值不是基于人数规模大100倍，而是呈平方关系，扩大10000倍。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e特朗普政府的科技“断供”等行为，让科技公司无法再受益于两项定律：全球市场，少了一大块市场；断供损失销量后，又让产品服务网络的价值指数递减。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e这绝不是影响营收这么简单。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e也正因为这两点，特朗普的贸易保护政策，看起来是对美国经济的保护，但对美国科技公司来说，则是一剂七伤拳，损人而不利己。从这方面看，中国网民将特朗普称为“川建国”不无道理。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\u003cb\u003e连锁反应\u003c/b\u003e\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e比起人才和市场的获利而言，拜登政府可能会带来的更严格科技业监管的坏处，对科技公司而言，就是非常容易做的选择题了。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e我们在《无法监管的巨头》一文中分析过，科技巨头几乎是无法监管的，无论中美。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e对中国市场而言，尽管市场监管部门刚出台了对互联网平台公司的各种严厉限制措施。但是这种限制，一方面，并不会让其他中小科技企业得到更多的成长机会，另外一方面，也只是让平台的议价能力有所下降，不会改变平台公司对市场的根本控制。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e进一步说，打掉了这些互联网平台，消费者也不见得获益。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e我们在很多市场，也只能回到地方保护主义的旧模式，无法得到更优质的是市场服务。滴滴专车所提供的服务水准，和地方垄断牌照出租车公司所提供的服务水准差别，相信所有人都看得到。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e互联网垄断固然不好，地方保护主义等方式的垄断同样不好，科技互联网行业，已经是中国最市场化的领域之一。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e在中国，监管是难题，在美国，监管同样是难题。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e由于美国复杂的司法体系，一项反垄断诉讼将是旷日持久的。1984年，电信巨头AT\u0026amp;T分拆，经历了12年之久的反垄断诉讼。在技术进化不断加速的今天，如果一项官司搞到十年，市场还是现在的市场么？垄断者还是市场的垄断者么？答案显然是否定的。某种程度，这也是自AT\u0026amp;T之后，美国也再没能分拆任何一家科技巨头的原因。还没等反垄断分拆流程走完，市场上的巨头可能已经“城头变幻大王旗”了。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e因此，拜登政府监管带来的坏处，对科技公司而言，相比较其获得的人才、市场益处，就小到可以忽略不计了。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e所以，看起来拜登政府可能会改善美国科技业很多问题。但就对中国科技产业影响而言，则是有所不同的答案。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e无论是特朗普政府还是拜登政府，其实都是对现有WTO下的国际贸易规则不满的。特朗普政府换玩法，拜登政府也会换玩法，他固然认为特朗普的谈判伤害了美国人民的利益，但是他也不喜欢旧玩法。此前，拜登就已经表态“美国需要新的规则与新的程序以决定与外国的贸易关系”。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e说来有趣，当年我们加入WTO讨论更多的是担心开放过度“狼来了”，可实际情况是，狼的确来了，但我们也成了别国眼中的“狼”。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e新贸易规则应该如何定？特朗普选择的模式，退出群聊式贸易，和单一国家一私聊，谈新规则，谈不好，到极端的就“断供”。我们刚才分析了，这不会是拜登政府的优先选择。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e拜登政府会怎么做，这时应该回过头来看，特朗普政府上台之后，退出的第一个群聊，也就是跨太平洋伙伴关系协定（The Trans-Pacific Partnership，简写TPP）。这项协定最初是由亚太经济合作组织成员发起，从2002年开始酝酿的一组多边关系的自由贸易协定，得到了当时即将下台的奥巴马政府的大力支持。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e跨太平洋伙伴关系协定是有强烈的政治主张的，其第一条一款三项（Article 1.1.3）就规定：“本组织支持亚太经济合作组织，促进自由化进程，达成自由开放贸易之目的。”只不过特朗普认为搞群聊贸易不利于美国优先，上台后就直接退出TPP。[注三]\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e鉴于拜登政府和特朗普政府千丝万缕的关系，类TPP模式很可能会是拜登政府的贸易选项之一。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e特朗普政府的贸易政策我们不喜欢，可敌人的敌人就一定是朋友吗？大家可以搜索一下当年TPP出台后的各种分析论证，重新捡起来看一看。如果说特朗普的政策是退群，TPP的玩法则是建新群，答案不见得是乐观的。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e如果说在农业经济时代，贸易重点的是土地资源。在工业经济时代，贸易的重点是税率汇率。在数字经济时代，贸易的重点就成了意识形态。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e美国云存储公司Box公司CEO亚伦·列维，也是发布多条推文庆祝拜登与哈里斯胜利的科技高管之一，他说：拜登不会有那么多“神奇操作”，但这也正是他的最大优势，高科技公司需要稳定的市场，全球贸易关系更不应该一时一变，否则人才供求、长期规划以及持续性的布局都将无从谈起。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e其实这句话可以作为本文最好的总结，受编辑成本递减和梅特卡夫定律支配，科技公司可以说是人类历史以来最不喜欢监管，最不喜欢边界的商业团体，天然具备“反监管”基因。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e列维的话我们可以这样理解，其实对高科技公司而言，除了政府订单是需要的，其余什么都不需要。“不折腾”最好。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e创新会自然涌现，垄断会自然出现，垄断也会自然终结。除非，有非自然力量存在。\u003c/div\u003e\n\u003cdiv\u003e\u003cbr/\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\u003ci\u003e[注1] \u003c/i\u003e\u003c/div\u003e\n\u003cdiv\u003e\u003ci\u003ehttps://www.cnbc.com/2020/11/07/jeff-bezos-bill-gates-and-other-tech-luminaries-react-to-biden-win.html\u003c/i\u003e\u003c/div\u003e\n\u003cdiv\u003e\u003ci\u003e[注2]  \u003c/i\u003e\u003c/div\u003e\n\u003cdiv\u003e\u003ci\u003ehttps://www.theinformation.com/articles/what-bidens-victory-means-for-tech\u003c/i\u003e\u003c/div\u003e\n\u003cdiv\u003e\u003ci\u003e[注3]  \u003c/i\u003e\u003c/div\u003e\n\u003cdiv\u003e\u003ci\u003ehttps://www.cnet.com/news/biden-beats-trump-heres-what-it-means-for-tech/\u003c/i\u003e\u003c/div\u003e\t\t\t\t\t                \u003c/div\u003e",
  "Date": "2020-11-13T10:22:11Z",
  "Author": "wanwan"
}