{
  "Source": "cybart.ist",
  "Title": "簡單討論一下自我進步的原理",
  "Link": "https://cybart.ist/2021/04/05/the-principle-of-self-improvement.html",
  "Content": "\u003cdiv class=\"article__content\" itemprop=\"articleBody\"\u003e\u003ch2 id=\"先讓我們來聊聊政治\"\u003e先讓我們來聊聊政治\u003c/h2\u003e\n\n\u003cp\u003e在政治學上，我們一般有「左派」、「右派」的分類法，如果把這兩個極性做成一維座標的兩極，在最左端我們叫「極左」、最右端我們叫「極右」。\u003c/p\u003e\n\n\u003cp\u003e左邊是激進的、右邊是保守的。\u003c/p\u003e\n\n\u003cp\u003e我們可以近似地認為，「極左」意味著極端的推翻一切、打倒一切：\u003c/p\u003e\n\n\u003cp\u003e比如徹底去中心化的無政府主義、徹底推翻婚姻制度快進到「群 P 時代」並且實現社會化扶養——一種典型的反烏托邦世界觀⋯⋯\u003c/p\u003e\n\n\u003cp\u003e而「極右」意味著極端反動，維護一切、一成不變是最好的、視一切挑戰現有「規則」或「潛規則」的人或組織為「終極敵對勢力」：\u003c/p\u003e\n\n\u003cp\u003e比如在民國時代仍然不肯剪掉「豬辮子」的中國人、\u003cstrong\u003e在 2021 年仍然視 LGBTQ 為洪水猛獸的人、在 2021 年仍然為獨裁者搖旗吶喊並淪為其走狗的人\u003c/strong\u003e⋯⋯\u003c/p\u003e\n\n\u003cp\u003e看到這裡很多人可能會問了：「為什麼我要在討論自我進步的文章中先講講政治呢？」\u003c/p\u003e\n\n\u003cp\u003e這個答案很明顯，一個人，他的最基本的政治傾向，反應了他對於「外部」是否需要「進步」的「價值觀判斷」，如果他連「外部」都覺得不需要「進步」了，那麼基本上可以下一個診斷：這個人沒救了。\u003c/p\u003e\n\n\u003cp\u003e所以說，\u003cstrong\u003e想要取得自我進步，最基本中的最基本的東西就是：你不能右傾。\u003c/strong\u003e\u003c/p\u003e\n\n\u003cp\u003e反動是沒有前途的價值觀，價值觀是實現自我進步的基礎。\u003c/p\u003e\n\n\u003ch2 id=\"自我進步的原理一種面向內部面向自我的價值觀\"\u003e自我進步的原理——一種面向「內部」、面向「自我」的價值觀\u003c/h2\u003e\n\n\u003cp\u003e社會進步是面向「外部」的，而自我進步是面向「內部」的，這兩者可以說是緊密相關，在面向「外部」的時候如果能做到「左派」立場，那麼我相信，在面對「內部」的時候，人的立場，起碼不會完全站在與外部的反面對應的「右派」。\u003c/p\u003e\n\n\u003cp\u003e我們完全可以借用政治學上的「左」、「右」來稱呼我們面對「自我」時的價值判斷，先聊聊「左」的。\u003c/p\u003e\n\n\u003ch3 id=\"極左是不行的\"\u003e「極左」是不行的\u003c/h3\u003e\n\n\u003cp\u003e一種典型的奮鬥屄，經常會說這樣的屄話：\u003c/p\u003e\n\n\u003cp\u003e「檢驗自己有沒有成長的關鍵就是看你往回看自己，覺得自己說過的話，做過的事跟傻逼一樣，就說明你進步了。」\u003c/p\u003e\n\n\u003cp\u003e咋一聽好像沒有問題，但這個說法真的沒有問題嗎？\u003c/p\u003e\n\n\u003cp\u003e他們甚至提出了「傻逼速率」這樣一個聽起來很唬人的詞，但卻不敢和我一樣直面這個詞，把「逼」換成原本的那個字「屄」。（當然，這個是另一個問題了= =，這裡只是順便嘲諷一下（逃\u003c/p\u003e\n\n\u003cp\u003e這個說法的根本問題在於，把進步看成了「推倒重來」，站在了「左」的極點上。按他們的話來說，最好就每一天都認為昨天的我是「傻屄」。那麼問題來了，這麼說你除了臨死的最後一天之外，你當了一輩子「傻屄」是不是？雞巴都笑斷了。以為自己是在建高樓大廈，結果卻是每天用不同的泥土在玩過家家，從三歲玩到老，還說服了自己：我每天用的都是不同的泥巴呢！我～真～努～力～～～\u003c/p\u003e\n\n\u003ch3 id=\"極右也不行\"\u003e「極右」也不行\u003c/h3\u003e\n\n\u003cp\u003e堅持「知行合一」的人，也是不行的。「知行合一」其實就站在了「右」的極端，變成了一種天才，按照川普的話來講，穩定的天才。\u003c/p\u003e\n\n\u003cp\u003e一個進步的人的觀念每天都在發生改變，在刷新認知。我其實認同羅永浩\u003cstrong\u003e的幾句話\u003c/strong\u003e：「他在生命的每一個階段都說了他相信的東西，那你要他怎麼樣，什麼都沒有做錯」。\u003c/p\u003e\n\n\u003cp\u003e嘲笑羅永浩的人，一大半是因為可以「打臉」羅永浩，可我不喜歡羅永浩，但我也同樣，不喜歡「打臉」這個詞：「打臉」攻擊的是一個人的進步心，如果你害怕被「打臉」，你就會因此而「不敢」進步。否認過去的「做法」沒有問題，否認過去的「自己」，才是問題，人一定會犯錯，但犯錯不能給人「定性」。\u003c/p\u003e\n\n\u003cp\u003e跑題了，這個是「極右」的其中一種症狀，但前面討論的「知行合一」是另外一種：\u003c/p\u003e\n\n\u003cp\u003e你一旦「知行合一」，你怎麼去通過實踐檢驗自己現有認知的問題？特別是當一件事情只有「反證法」能證明有問題的時候？你堅持「知行合一」在實際上就是為了自我邏輯自洽而放棄了「客觀性」，變成了純粹的「形而上」，這樣真的不會走歪麼？\u003c/p\u003e\n\n\u003cp\u003e「真實世界」是一個混沌系統，任何的人類形成的認知，都不能等同於客觀本身，所以我們才要立足於當下，「實事求是」，儘管在這個路上可能有無數個「臨時」的workarounds 在支撐著你前進，但至少，你還在前進。你選擇不「知行合一」，恰恰是對「真實世界」的敬畏，是對自己的「認知」抱有進步可能性的一種體現。\u003c/p\u003e\n\n\u003cp\u003e堅持「知行合一」完全就是「極右」的價值觀，是不可取的。\u003c/p\u003e\n\n\u003ch2 id=\"總結\"\u003e總結\u003c/h2\u003e\n\n\u003cp\u003e經過上面的討論，可以得出總的觀點：\u003c/p\u003e\n\n\u003cp\u003e自我進步需要保持對自身抱有「左翼」價值觀，但不可以站在極點上，變成自我「否定」，更不能往「右」走，故步自封。\u003c/p\u003e\n\n\u003cp\u003e只要保持住這種健康的價值觀，就一定可以持續進步，無限進步。\u003c/p\u003e\n\n\u003cp\u003e這就是自我進步的原理。\u003c/p\u003e\n\u003c/div\u003e",
  "Date": "2021-04-05T00:00:00Z",
  "Author": "Cybartist"
}