{
  "Source": "liam.page",
  "Title": "羽毛球步伐①：启动步",
  "Link": "https://liam.page/2022/11/20/badminton-footwork-the-start-step/",
  "Content": "\u003cdiv class=\"post-body\" itemprop=\"articleBody\"\u003e\n\n      \n        \u003cp\u003e若想要打好羽毛球，能够打到羽毛球无疑是其前提；而想要打到羽毛球，就需要你能够在快速的羽毛球对抗中能够跑到位。因此说，步伐是羽毛球的基本功。在我看来，它的重要性要大于手上的各种花活。因为若你跑不到位，无法击球或是只能在被动情况下击球，无论你的手法技术有多么高明，大概都是无法发挥出来的。反过来讲，若是每球都能够跑到位，即便手法尚不成熟，只要能回击过往，也还有得打。\u003c/p\u003e\n\u003cp\u003e从此篇开始，我们讨论羽毛球的步伐。此篇从启动步开始讨论。\u003c/p\u003e\n\u003cspan id=\"more\"\u003e\u003c/span\u003e\n\n\u003ch2 id=\"为什么需要启动步\"\u003e\u003ca href=\"#为什么需要启动步\" class=\"headerlink\" title=\"为什么需要启动步\"\u003e\u003c/a\u003e为什么需要启动步\u003c/h2\u003e\u003cp\u003e羽毛球运动的特点、基本的物理学定律、人的生理结构，三者共同决定了启动步的重要性和必要性。\u003c/p\u003e\n\u003cp\u003e羽毛球是速度最快的球类运动之一。若是限定在初始速度的概念上，我们还可以将「之一」去掉。因其速度快、场地小，所以从你击球结束到下一次击球之间的间隔十分短暂。即便在较为缓和的对抗中，这一时间间隔通常也不会超过 3s。在这短暂的间隔中，你需要完成收拍、移动回位、移动到位、准备击球的若干步骤，时间紧迫。此外，在对手击球之前，你无法判断对手回球的落点位置。因此，羽毛球的步伐移动同时具有快速和方向不确定两个重要特点。\u003c/p\u003e\n\u003cp\u003e基本的物理学定律告诉我们：若你想要向前加速运动，则势必要让外界对你有向前的合力；向后同理。若你想要相左加速运动，则势必要让外界对你有相左的合力；向右同理。这一合力越大，加速度就越大。在运动上就体现为移动的爆发力越大、突然性越强。在不打滑的情况下，这一水平反向的合力由地面给脚的静摩擦力提供。而静摩擦力的极限大小可由公式 \u003ccode\u003e$f_{\\text{静}} = \\mu_{\\text{静}} \\cdot F_N$\u003c/code\u003e 给出。这也就是说，\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e穿一双好的羽毛球鞋（增大抓地力）有助于你快速移动；\u003c/li\u003e\n\u003cli\u003e你必须\u003cstrong\u003e向斜下方蹬地发力\u003c/strong\u003e，才能获得更大的静摩擦力和提供更大的加速度。\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e人的生理结构决定了，若要向斜下方蹬地发力，则必须让发力腿的小腿和地面呈现一个 30° 至 60° 的夹角。最典型的例子是 100 米短跑。跑步项目的一个特点是它永远向前跑。因此运动员们在起步阶段会采用蹲立式起跑的方式获得极大的向前的加速度。但羽毛球的启动方向不确定，于是你必须用合理的方式启动，以便能够照顾尽可能多的潜在移动方向。这种合理的方式，即是所谓的「启动步」；具体来说，又有细分：\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e当你预期主要向左右方向移动时，应做小跳/分腿动作，将腿左右分开，以便向斜下方蹬地发力获得左右方向的加速度。一般而言，起高球应对对方进攻时应采用这种方式。\u003c/li\u003e\n\u003cli\u003e当你预期主要向前后方向移动时，应做小跳/分腿动作，将腿前后分开，以便向斜下方蹬地发力获得前后方向的加速度。一般而言，自己处在仅供状态时应采用这种方式。\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e总结一下。由于羽毛球运动移动的快速和不定向的特性、向斜下方蹬地发力的原理、人的生理结构特点，羽毛球的启动步是重要且必要的。若无合理的启动步，则往往无法击打到球，或只能陷入被动击球。\u003c/p\u003e\n\u003ch2 id=\"启动步要领\"\u003e\u003ca href=\"#启动步要领\" class=\"headerlink\" title=\"启动步要领\"\u003e\u003c/a\u003e启动步要领\u003c/h2\u003e\u003cp\u003e此节我们讲解启动步的要领。首先我们从最简单的静止启动开始讲起，然后再过度到移动中的连贯启动步。\u003c/p\u003e\n\u003ch3 id=\"从静止启动\"\u003e\u003ca href=\"#从静止启动\" class=\"headerlink\" title=\"从静止启动\"\u003e\u003c/a\u003e从静止启动\u003c/h3\u003e\u003cp\u003e首先是准备动作。\u003c/p\u003e\n\u003cp\u003e在对手可能击出攻击性的下压球的情况（你发后场高球、挑高球、击平高球、击高远球等），你应当采取双脚左右分立的防守站姿。具体来说，应当\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e面向对手击球的方向，双腿左右分立与肩同宽，右脚可以适当向前半步；\u003c/li\u003e\n\u003cli\u003e双脚微踮，前脚掌着地、后脚跟微抬；\u003c/li\u003e\n\u003cli\u003e膝盖微屈、髋关节微屈；\u003c/li\u003e\n\u003cli\u003e上半身向前微弓；\u003c/li\u003e\n\u003cli\u003e左右大臂下垂、向外微张，持拍手在胸腹前，拍头在胸口正面前上方位置。\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e在对手大概率作出防守的情况，你应当采取双脚前后分立的进攻站姿。具体来说，应当侧身使持拍手在前，面向对手击球方向，双腿前后分立与肩同宽，脚尖朝向斜前方向。其余身体姿态与防守站姿基本相同。\u003c/p\u003e\n\u003cp\u003e在对手引拍即将击球的瞬间，开始启动。具体来说：\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e双腿分开（可以视情况带有一些小跳）到大约两倍肩宽；\u003c/li\u003e\n\u003cli\u003e膝盖弯曲、降低重心，以便观察对手击球球路；\u003c/li\u003e\n\u003cli\u003e前脚掌着地瞬间反方向蹬地、发力启动。\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e这里做一些额外说明。\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e双腿分开的目的，是为了让小腿与地面呈现的角度便于蹬地发力。因此双腿分开的幅度不应过大（导致发力不便），也不应过小（导致更大比例的发力是水平向上而非水平）。\u003c/li\u003e\n\u003cli\u003e分腿/小跳的瞬间，你尚未知晓对方的球路。因此\u003cul\u003e\n\u003cli\u003e在没有把握的情况下，不应做额外假设。也就是说，双腿分开应该基本呈现左右（防守站姿）或前后（进攻站姿），而非是斜前、斜后方向。若不然，将导致二次启动。\u003c/li\u003e\n\u003cli\u003e膝盖弯曲、降低重心的过程，需要紧盯对手击球动作和球路，迅速判断落点。\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003e前脚掌着地瞬间发力，不能迟疑。若不然，重心完全下沉后，反而不容易发力，造成二次启动。\u003cul\u003e\n\u003cli\u003e发力动作当是保证脚踝稳定性的前提下，使用小腿后侧肌肉群和大腿前侧肌肉群协同发力\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3 id=\"移动中连贯启动\"\u003e\u003ca href=\"#移动中连贯启动\" class=\"headerlink\" title=\"移动中连贯启动\"\u003e\u003c/a\u003e移动中连贯启动\u003c/h3\u003e\u003cp\u003e从静止启动是较为理想的情况，在实际对抗中较少出现。羽毛球球速极快，对手不可能等你回动到位后、站定后再击球。因此，更多的启动情况发生在回动的过程中的顺势连贯启动。\u003c/p\u003e\n\u003cp\u003e举例来说，当你在后场击出高远、平高球，你应当迅速回动至球场中部区域。在回动的过程，应密切注意观察对手击球情况，随时准备启动。此时，可能你尚在回动过程中。例如说，右手持拍的你，重心放在左腿上，而右腿正处在委屈膝盖向前迈步的阶段。此时你的启动应当是（其他情况类比即可）：\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e右腿发力，顺势向左垫出一小步；右腿同时协同分开，双腿分开到大约两倍肩宽；\u003c/li\u003e\n\u003cli\u003e膝盖弯曲、降低重心，以便观察对手击球球路；\u003c/li\u003e\n\u003cli\u003e前脚掌着地瞬间反方向蹬地、发力启动。\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e这里着重讲一下顺势的含义。顺势在此处有几层含义：\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e首先，你尚在从后向前回动的过程中，身体具有向前运动的惯性。因此，你主观上向左垫出的一小步，实际效果应当是向左前方垫出一小步。若是刻意在垫布的过程中改变方向向后垫步，则是一个容易导致受伤的动作。\u003c/li\u003e\n\u003cli\u003e其次，顺势表示不做过多调整。特别地，不能等待右脚落地，再从静止启动。这是因为你尚在向前回动过程中，若要让身体静止下来，势必要双脚着地、下沉重心。这实际上已经是一次启动，只不过是一次对抗自身惯性的一次启动而已。于是，这会事实上造成二次启动。\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e为了做到这一点，我个人总结了四个字：\u003cstrong\u003e快回·慢踩\u003c/strong\u003e。也就是，\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e在击球完成后瞬间，应当爆发式地回动。体现在后场正手击球上，就是（以右手持拍为例）左腿应该向后蹬直发力、同时收紧核心，以便快速抵消向后的冲力而后向前回动。这是「快回」。\u003c/li\u003e\n\u003cli\u003e「慢踩」是说，在回动的过程中，不用过于着急，而要保持重心稳定、适度慢踩，给移动中连贯启动留下空间。当然，「两步一冲」的李矛步除外。——那是杀上网、吊上网的连贯动作。\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2 id=\"训练方法\"\u003e\u003ca href=\"#训练方法\" class=\"headerlink\" title=\"训练方法\"\u003e\u003c/a\u003e训练方法\u003c/h2\u003e\u003cp\u003e启动步本身值得持续练习。以下是从入门到高阶的一些练习方式。\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e左右开合跳。\u003cul\u003e\n\u003cli\u003e起始姿势：双脚与肩同宽，前脚掌着地，膝盖微屈，双手向上合掌\u003c/li\u003e\n\u003cli\u003e动作（开跳）：发力向上跳，双脚分开至两倍肩宽，前脚掌着地，膝盖弯屈下沉重心，双手两侧分开平举\u003c/li\u003e\n\u003cli\u003e复位动作（合跳）：发力向上跳，双脚合拢至一倍肩宽，前脚掌着地，膝盖微屈，双手向上击掌\u003c/li\u003e\n\u003cli\u003e目的：强壮踝关节，锻炼小腿后侧肌肉群爆发力\u003c/li\u003e\n\u003cli\u003e30 个/组，间隔 20s 做 3 组\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003e防守站姿静止启动。\u003cul\u003e\n\u003cli\u003e起始姿势：防守站姿。\u003c/li\u003e\n\u003cli\u003e动作（启动步）：双腿分开至两倍肩宽，膝盖弯曲下沉重心。\u003c/li\u003e\n\u003cli\u003e复位动作：两脚前脚掌着地瞬间同时发力，双腿合拢至一倍肩宽，前脚掌着地，回归起始姿势。\u003c/li\u003e\n\u003cli\u003e目的：启动步肌肉记忆。\u003c/li\u003e\n\u003cli\u003e15 慢速 + 15 快速/组，间隔 20s 做 3 组\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003e防守站姿静止启动，左右蹬跨接杀步伐。\u003cul\u003e\n\u003cli\u003e起始姿势：防守站姿。\u003c/li\u003e\n\u003cli\u003e动作（启动步 + 蹬跨）：双腿分开至两倍肩宽，膝盖弯曲下沉重心；单侧腿发力，转髋蹬跨。（注意弓箭步着地动作，避免受伤）\u003c/li\u003e\n\u003cli\u003e复位动作：蹬转回位。\u003c/li\u003e\n\u003cli\u003e目的：启动步肌肉记忆 + 左右蹬跨肌肉记忆。\u003c/li\u003e\n\u003cli\u003e15 个/组，间隔 20s 做 3 组。\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003e交叉步行进间启动步（两步一启动为例，还可做一步一启动、交叉步后退中启动）。\u003cul\u003e\n\u003cli\u003e起始动作：先左后右分别迈步向前（击后场球回动）。\u003c/li\u003e\n\u003cli\u003e动作（行进间启动步）：重心在右腿，左腿微屈（第三步尚未踩下），右腿顺势向右垫半步，同时左脚分开做启动步。（注意重心下沉）\u003c/li\u003e\n\u003cli\u003e复位动作：两脚前脚掌着地瞬间同时发力，双腿合拢至一倍肩宽，前脚掌着地。换脚，继续向前迈步。\u003c/li\u003e\n\u003cli\u003e目的：交叉步行进间启动连贯。\u003c/li\u003e\n\u003cli\u003e10 次/组，间隔 20s 做 5 组。\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003e并步行进间启动步（两步一启动为例，还可做并步后退中启动）。\u003cul\u003e\n\u003cli\u003e起始动作：右脚在前，左脚在后，向前做一次并步（出右脚，左脚并步跟上）。\u003c/li\u003e\n\u003cli\u003e动作（行进间启动步）：第二次并步做一半，即是说出右脚，在左脚并步跟上的同时，右腿顺势向右垫半步，同时左脚分开做启动步。（注意重心下沉）\u003c/li\u003e\n\u003cli\u003e复位动作：两脚前脚掌着地瞬间同时发力，双腿合拢至一倍肩宽，前脚掌着地。换脚，继续向前迈步。\u003c/li\u003e\n\u003cli\u003e目的：并步行进间启动丽娜管。\u003c/li\u003e\n\u003cli\u003e10 次/组，间隔 20s 做 5 组。\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003c!-- 谨以此文，献给我曾爱过的刘曼沁女士，祝她 30 周岁生日快乐~！ --\u003e\n\n    \u003c/div\u003e",
  "Date": "2022-11-20T06:29:26Z",
  "Author": "Liam Huang"
}