{
  "Source": "liam.page",
  "Title": "《谈人生》读后感",
  "Link": "https://liam.page/2024/03/17/book-review-tanrensheng/",
  "Content": "\u003cdiv class=\"post-body\" itemprop=\"articleBody\"\u003e\n\n      \n        \u003cp\u003e最近读完了季羡林先生的《谈人生》。此处要感谢 Millie 赠书。\u003c/p\u003e\n\u003cp\u003e这是季先生万年在医院疗养期间亲自编选的作品集。文集收录了季先生在人生各个阶段的代表作品。从文体上说，涵盖散文、随笔、邮寄、回忆录、日记、讲演报告等。\u003c/p\u003e\n\u003cp\u003e在读书的过程中，遇到一些自觉有趣的文字，就随手摘录，并作感想。这里同季先生选编文集一样，将这些摘录和感想选编在一起，形成此文。\u003c/p\u003e\n\u003cspan id=\"more\"\u003e\u003c/span\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003e时光流逝，一转眼，自己已经到了望九之年，活得远远超过了我的预算。有人认为长寿是福，我看也不尽然。人活得大久了，对人生的种种相、众生的种种相，看得透透彻彻，反而鼓舞时少，叹息时多，远不如早一点离开人世这个是非之地，落一个耳根清净。\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003e话说到这里，我想把上面说的意思简短扼要地归纳一下：如果人生真有意义与价值的话，其意义与价值就在于对人类发展的承上启下、承前启后的责任感。\u003c/p\u003e\n\u003cp\u003e——《人生的意义与价值》 季羡林\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003e季先生的文字还是有趣的。\u003c/p\u003e\n\u003cp\u003e「活得超过了预算」初看到真的会笑死，然后反思自己好像没有做这样的预算，又继而想是否有必要做这样的预算？乐而又乐。\u003c/p\u003e\n\u003cp\u003e「被困于名缰，被缚于利索」这一句容易理解，但应该惊叹大师练字的本领。名缰利索算是一般常见的词。单独用，大体上也就感觉是有那么个东西。拆开使用平添不少意味，「作茧自缚」的感觉被加强，终知名缰利索是自困、自缚，而不是他困、他缚。\u003c/p\u003e\n\u003cp\u003e文末的总结很有中华文人的古典气质：追求传世，追求大同。\u003c/p\u003e\n\u003cp\u003e若说印度之类的国家修来世（做好事是为了来生转世得好缘法），沙漠三教修今世（做好事是为了今生赎罪得上天堂），那中华文化圈就是修传世。即是说，人总要留下或是血脉传承或是文脉传承的东西，为民族、人类的发展留下自己的印记。而若再进步一点者，可以推动人类向前，那便可以在生命最后一刻坦然地说「我已尽到责任」了。\u003c/p\u003e\n\u003chr/\u003e\n\u003cblockquote\u003e\n\u003cp\u003e现在杨女士却对我垂青，要我作“哲学思考”，侈谈“禅趣”，我焉得不诚惶诚恐呢？这就是我把来信搁置不答的真正原因。我的如意算盘是，我稍搁置，杨女士担当编辑重任，时间一久，就会把此事忘掉，我就可以逍遥自在了。\u003c/p\u003e\n\u003cp\u003e然而事实却大出我意料，她不但没有忘掉，而且打来长途电话，直捣黄龙，令我无所逃于天地之间。我有点惭愧，又有点惶恐。但是，心里想的却是：按既定方针办。我连忙解释，说我写惯了考据文章。关于“禅”，我只写过一篇东西，而且是被赶上了架才写的，当然属于“野狐”一类。我对她说了许多话，实际上却是“居心不良”，想推掉了事，还我一个逍遥自在身。\u003c/p\u003e\n\u003cp\u003e可是我万万没有想到，正当我颇为得意的时候，杨女士的长途电话又来了，而且还是两次。昔者刘先主三顾茅庐，躬请卧龙先生出山，共图霸业。藐予小子，焉敢望卧龙先生项背！三请而仍拒，岂不是太不识相了吗？我痛自谴责，要下决心认真对待此事了。我拟了一个初步选目。过后自己一看，觉得好笑，选的仍然多是考据的东西。我大概已经病入膏肓，脑袋瓜变成了花岗岩，已经快到不可救药的程度了。于是决心改弦更张，又得我多年的助手李铮先生之助，终于选成了现在这个样子。这里面不能说没有涉及禅趣，也不能说没有涉及人生。但是，把这些文章综合起来看，我自己的印象是一碗京海杂烩。可这种东西为什么竟然敢拿出来给人看呢？自己“藏拙”不是更好吗？我的回答是：我在任何文章中讲的都是真话，我不讲半句谎话。而且我已经到了耄耋之年，一生并不是老走阳光大道，独木小桥我也走过不少。因此，酸、甜、苦、辣，悲、欢、离、合，我都尝了个够。发为文章，也许对读者，特别是青年读者，不无帮助。这就是我斗胆拿出来的原因。倘若读者—不管是老中青年—真正能从我在长达八十多年对生活的感悟中学到一点有益的东西，那我就十分满意了。至于杨女士来信中提到的那一些想法或者要求，我能否满足或者满足到什么程度，那就只好请杨女士自己来下判断了。\u003c/p\u003e\n\u003cp\u003e——《禅趣人生》 季羡林\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003e如先前所说，季先生的文字属实有趣。今日始知这份有趣来自「不作伪」。\u003c/p\u003e\n\u003cp\u003e大师也有七情六欲，遇事也会有退缩逃避，然后打起如意算盘。\u003cbr/\u003e大师在如意算盘被瞧破之后，也会有惶恐（也许心虚脸红？）。\u003cbr/\u003e大师也会有思维定式，然后感叹自己的脑袋瓜变成了花岗岩。\u003c/p\u003e\n\u003cp\u003e真诚而不作伪是打动读者的「大杀器」，写文十年深以为然。然则想要真诚而不作伪，需得首先与自己握手言和，内照己心而圆融无碍。若不然，为了所谓的「面子」或者时下流行的「人设」，则难免带上偏见，从而在自知或者不自知的情况下作伪。\u003c/p\u003e\n\u003chr/\u003e\n\u003cblockquote\u003e\n\u003cp\u003e敌兵压境，应当振作起来，鼓励士兵，同仇敌忾，可是苻坚自己却先泄了气。这样的人不称为孱头，又称之为什么呢？结果留下了两句著名的话：“风声鹤唳，草木皆兵。”至今还流传在人民的口中，也可以说是流什么千古了。\u003c/p\u003e\n\u003cp\u003e——《论恐惧》季羡林\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003e我快要被「流什么千古」笑死了。\u003c/p\u003e\n\u003cp\u003e文人笔墨，果然有趣。放着有「遗臭万年」不用，偏生要去用「流什么千古」（显然这里的什么代指臭）。用这种小朋友也能懂的小手法表达「遗臭万年」的含义，有多出俏皮和趣味。\u003c/p\u003e\n\u003chr/\u003e\n\u003cblockquote\u003e\n\u003cp\u003e对此我有自己的哲学基础：吃饭是为了自己，而穿衣则是为了别人。道理自明，不用辩证。哪有一个人穿着华丽，珠光宝气，天天坐在菱花镜前，顾影自怜？如果真正有的话，他或她距入疯人院的日期也不会远了。\u003c/p\u003e\n\u003cp\u003e——《衣着的款式》季羡林\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cblockquote\u003e\n\u003cp\u003e至于衣着，更不在我考虑之列。在这方面，我是一个“利己主义者”。衣足以蔽体而已，何必追求豪华。一个人穿衣服，是给别人看的。如果一个人穿上十分豪华的衣服，打扮得珠光宝气，天天坐在穿衣镜前，自我欣赏，他（她）不是一个疯子，就是一个傻子。如果只是给别人去看，则观看者的审美能力和审美标准，千差万别，你满足了这一帮人，必然开罪于另一帮人，绝不能使人人都高兴，皆大欢喜。反不如我行我素，我就是这一身打扮，你爱看不看，反正我不能让你指挥我，我是个完全自由自主的人。\u003c/p\u003e\n\u003cp\u003e——《漫谈消费》季羡林\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003e看到前一篇文章部分时候，我还在诧异什么叫做「穿衣是为了别人」。这与我心中所想相差颇大，也与认知中的季老影响相去甚远。\u003c/p\u003e\n\u003cp\u003e继续读到后一篇文章才明白季老想表达的意思。这个「给别人看的」其实是说，别人看看就好，至于看过之后意见如何则不必在意。\u003c/p\u003e\n\u003cp\u003e穿衣服嘛，蔽体、得体即可。\u003c/p\u003e\n\u003chr/\u003e\n\u003cblockquote\u003e\n\u003cp\u003e不管你意识到还是没有意识到，大自然还是把虚无缥缈的时间用具体的东西暗示给了人们。比如用日出日落标志出一天，用月亮的圆缺标志出一月，用四季（在印度是六季或者两季）标志出一年。\u003c/p\u003e\n\u003cp\u003e——《时间》季羡林\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003e印度居然有六季的说法。原来蟪蛄不知春秋不只是说说。若在印度，我岂不就是阿成不知雨风吗？\u003c/p\u003e\n\u003cp\u003e查阅得印度一年分为六个季节，这六个季节分别是春季、夏季、雨季、秋季、风季、冬季。\u003cbr/\u003e春季（3月20——5月19）  金星主宰\u003cbr/\u003e夏季（5月20——7月19）  太阳与火星主宰\u003cbr/\u003e雨季（7月20——9月19）  月亮主宰\u003cbr/\u003e秋季（9月20——11月19） 水星主宰\u003cbr/\u003e风季（11月20——1月19）  木星主宰\u003cbr/\u003e冬季（1月20——3月19）  土星主宰\u003c/p\u003e\n\n    \u003c/div\u003e",
  "Date": "2024-03-17T05:32:33Z",
  "Author": "Liam Huang"
}