{
  "Source": "liam.page",
  "Title": "Dalio 经济学 ①：支出、收入和信贷",
  "Link": "https://liam.page/2021/02/20/expenditure-receipt-credit/",
  "Content": "\u003cdiv class=\"post-body\" itemprop=\"articleBody\"\u003e\n\n      \n        \u003cp\u003e这是一个新的系列，讨论桥水基金创始人 Ray Dalio 的经济学理论。这些内容是我在读 Dalio 的书《A Template for Understanding BIG DEBT CRISES》之后，结合书中内容和自我思考总结出来的内容。\u003c/p\u003e\n\u003cspan id=\"more\"\u003e\u003c/span\u003e\n\n\u003ch2 id=\"支出和收入\"\u003e\u003ca href=\"#支出和收入\" class=\"headerlink\" title=\"支出和收入\"\u003e\u003c/a\u003e支出和收入\u003c/h2\u003e\u003cp\u003e整个经济是由无数的交易组成的。\u003c/p\u003e\n\u003cp\u003e交易涉及到的双方，一方支出购买力，收获标的物；另一方付出标的物，收获另一方支出的购买力。因此我们可以得到几个简单的结论：\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e一个人的支出是另一个人的收入。\u003c/li\u003e\n\u003cli\u003e如果经济体中，大多数人减少支出，那么整体的收入就会减少，从而\u003cul\u003e\n\u003cli\u003e降低大家的生产积极性，导致通缩预期。\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003e如果经济体中，大多数人增加支出，那么整体的收入就会增加。\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e交易涉及到的标的物分成三类：1. 商品，2. 服务，3. 金融资产。考虑到持有金融资产的人，是在将来能够变现，化为购买力；因此，金融资产的本质是将来的购买力。\u003c/p\u003e\n\u003cp\u003e在交易中，标的物的另一面，是起到交易媒介作用的货币或者信贷。货币很好理解，于是重点在信贷。\u003c/p\u003e\n\u003ch2 id=\"信贷\"\u003e\u003ca href=\"#信贷\" class=\"headerlink\" title=\"信贷\"\u003e\u003c/a\u003e信贷\u003c/h2\u003e\u003cp\u003e信贷的双方，贷款人评估借款人的信用，使用自己暂时用不到的钱，购买债务资产，以期将来能获得利息收入；借款人凭借自己的信用，以将来提供利息汇报的代价，「购买」贷款人现金当下的使用权。\u003c/p\u003e\n\u003cp\u003e从贷款人的角度，他将自己暂时不用的钱借出，得到了将来的回报。如果相应货币发生通胀，那么将来的回报在购买力上会贬值，贷款人就会承受损失。不过，利息收入能对这种损失进行对冲。只要利息收入足够大，因通胀带来的损失就能被弥补。\u003c/p\u003e\n\u003cp\u003e从借款人的角度，他用未来的收入「购买」现金当下的使用权。这种行为看似是向他人借钱，实际是对自己的未来有良好预期，向未来的自己借钱。\u003c/p\u003e\n\u003cp\u003e如果借款人将通过信贷得来的现金用于扩大再生产，提高自己的生产效率，那么借款人将来能获得更多的收入。另一方面，贷款人也能确信在将来能够收回贷款。这种情况下，本不会流通的钱（贷款人暂时不用的钱）进入市场流通，并扩大了经济体总的生产力。于是，这是一件好事——贷款人、借款人、经济体加在一起赢了三次。\u003c/p\u003e\n\u003cp\u003e如果借款人将通过信贷得来的先进用于购买商品或服务；由于一个人的支出是另一个人的收入，提供商品或服务的人得到更多的收入，可用于扩大再生产，提高经济体总的生产力。只要借款人将来能够偿还债务，那么，这也是一件好事。从经济利益的角度来说，贷款人、经济体加在一起赢了两次；借款人获得商品或服务，也有所收获。\u003c/p\u003e\n\u003cp\u003e糟糕的情况在于，如果借款人没有将借贷得到的现金直接或间接地投入扩大再生产，且最终无力偿还债务，那就成了「全输」的局面。当这种问题大量发生，就会形成债务危机。\u003c/p\u003e\n\u003ch2 id=\"信贷天然产生周期\"\u003e\u003ca href=\"#信贷天然产生周期\" class=\"headerlink\" title=\"信贷天然产生周期\"\u003e\u003c/a\u003e信贷天然产生周期\u003c/h2\u003e\u003cp\u003e从借款人的角度来说，在信贷凭空产生的那一瞬间，借款人获得了在当前时间超出自身收入水平的消费能力。但也意味着，在未来的一段时间，借款人必须控制自己的消费水平低于收入水平，以便偿还债务。因为借贷，借款人的消费能力的起伏，自然就构成了一个周期。\u003c/p\u003e\n\u003cp\u003e将经济体中所有的借款人当做一个整体，那么，在周期的早些阶段，大家的购买力都很强，于是：\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e一个人的支出是另一个人的收入，商品的生产者和服务的提供者的收入增加，倾向于扩大再生产；\u003c/li\u003e\n\u003cli\u003e相对有限的金融资产涌入相对更多的资金（其实很大程度是信贷），金融资产价格被推高；\u003c/li\u003e\n\u003cli\u003e上述过程让借款人的「信用水平」提升，于是能借到更多的资金，也倾向于接入更多的资金，形成自我增强的正循环。\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e但若没有生产力水平的提升，这种正循环是不可持续的。随着债务陆续到期、偿债负担日益增加，整个经济体必然进入周期的后半阶段。在周期的后半阶段，大家的购买力都减弱，于是：\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e一个人的支出是另一个人的收入，商品的生产者和服务的提供者的收入减少，倾向于减少生产；\u003c/li\u003e\n\u003cli\u003e人们倾向于卖出金融资产，获得现金以偿债，这使得金融资产价格被拉低；\u003c/li\u003e\n\u003cli\u003e上述过程让借款人的「信用水平」降低，于是愈发难以接到足够资金，购买力水平进一步下降，形成自我增强的负循环。\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e周期的前半部分和后半部分，都会形成自我加强的循环。若不加以控制，最终必然导致债务危机。央行和中央政府的责任之一，就是要运用自身的货币政策和财政政策，使得经济体总体的债务水平增长的幅度，不会显著偏离整体生产力水平的提升幅度。\u003c/p\u003e\n\u003cp\u003e这就引出了央行和中央政府的调控政策相关问题。\u003c/p\u003e\n\n    \u003c/div\u003e",
  "Date": "2021-02-20T15:22:25Z",
  "Author": "Liam Huang"
}