{
  "Source": "liam.page",
  "Title": "英语语法之⑨：忘记长难句，欢迎来到复合句的世界",
  "Link": "https://liam.page/2021/05/07/introduction-to-compound-sentence-and-complex-sentence/",
  "Content": "\u003cdiv class=\"post-body\" itemprop=\"articleBody\"\u003e\n\n      \n        \u003cp\u003e这是\u003ca href=\"/series/#%E8%8B%B1%E6%96%87%E6%96%87%E6%B3%95\"\u003e系列\u003c/a\u003e文章的第⑨篇。\u003ca href=\"/2021/05/06/model-verbs-and-moods-in-English/\"\u003e前作\u003c/a\u003e处理了情态动词与虚拟语气，解决了简单句当中最后一个较大的问题。在简单句中，还剩下一些重要的问题没有处理（例如介词）。这些问题虽然重要，但十分零碎，无法用通常的办法以简御繁，更多地是要依靠大量阅读输入来解决。因此，这些问题不放在这一系列文章中，待将来另开一系列，专门解决各类小毛病。\u003c/p\u003e\n\u003cp\u003e从此篇开始，我们要进入复合句的世界。\u003c/p\u003e\n\u003cspan id=\"more\"\u003e\u003c/span\u003e\n\n\u003ch2 id=\"忘记长难句\"\u003e\u003ca href=\"#忘记长难句\" class=\"headerlink\" title=\"忘记长难句\"\u003e\u003c/a\u003e忘记长难句\u003c/h2\u003e\u003cp\u003e前北京新东方 GMAT 名师杨鹏著有《GRE\u0026amp;GMAT 阅读难句教程》一书。因书中对 GRE 和 GMAT 考试阅读题中常常出现的长句难句做了一些解读，故而被坊间惯称为「杨鹏长难句」。然而，以数学系学生的视角，我对这本书是不甚满意的。这种不满在于它没有很好地解决一个基本问题：到底多长算长句，又到底多难算难句？对于难句，是你觉得难算难，还是我觉得难算难？因为缺少一个客观稳定的标准，在我的视角，它很难提出一个完备的方案去处理所有的情况。\u003c/p\u003e\n\u003cp\u003e因此，虽然《长难句》一书仍可一看，但忘记「长难句」这一概念却是必要的。\u003c/p\u003e\n\u003ch2 id=\"破而立……什么？\"\u003e\u003ca href=\"#破而立……什么？\" class=\"headerlink\" title=\"破而立……什么？\"\u003e\u003c/a\u003e破而立……什么？\u003c/h2\u003e\u003cp\u003e或曰：「你不能光顾着破坏，还要负责建设」。\u003c/p\u003e\n\u003cp\u003e忘记长难句，我们要以怎样的视角去切入英文中那些看起来很长又很难的句子呢？答案是，以简单句和复合句的视角。\u003c/p\u003e\n\u003cp\u003e我们在系列第一篇介绍了五种基本句型，在系列第五篇（非谓语动词篇）里又提到了独立子句（independent clause）的概念。据此，我们可以给出一个明确的结论：有且只有一套主谓结构的句子，是独立子句。独立子句必属于五种基本句型之一。独立子句单独成句时，就是简单句。\u003c/p\u003e\n\u003cp\u003e在简单句的定义基础上，我们又能「非此即彼」地定义出复合句：不是简单句的句子，就是复合句。复合句由若干个独立子句组合而成。独立子句组成复合句又有两种方式。一是由 and/or/but 等连接词连接的两个并列子句组成的合句（compound sentence）；二是由各种从句与主句连接而成的复句（complex sentence）。\u003c/p\u003e\n\u003cp\u003e你看，按照这样的定义，绝不会有一个句子被遗漏。于是我们有信心能处理所有的情况。\u003c/p\u003e\n\u003ch2 id=\"怎样分析和练习复合句？\"\u003e\u003ca href=\"#怎样分析和练习复合句？\" class=\"headerlink\" title=\"怎样分析和练习复合句？\"\u003e\u003c/a\u003e怎样分析和练习复合句？\u003c/h2\u003e\u003cp\u003e系列的后续文章，会处理各种类型的复合句。这里提前讲一讲，在理解各种类型复合句的基础上，如何分析和练习。在这里，分析是为了解决阅读方面的问题，让你在阅读遇到复合句时不至于抓瞎；练习是为了解决写作方面的问题，让你在写作时能自如地应用复合句。\u003c/p\u003e\n\u003cp\u003e这里总结整理了一个四步分析法：\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003e标记出复合句当中的各个独立子句。\u003c/li\u003e\n\u003cli\u003e对于每个独立子句，识别其应用的基本句型，而后标出其中的主要成分。\u003c/li\u003e\n\u003cli\u003e对于每个独立子句，翻译之。\u003c/li\u003e\n\u003cli\u003e将独立子句的翻译组合起来，得到整个复合句的翻译。——注意，一定要写下来翻译成通顺的人话（可以打字）。\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003e反复应用这一分析法，按我这等笨人的经验，每天坚持分析五个句子并坚持一个月能在阅读 GRE/GMAT/LSAT 级别的文章上有一个质的飞跃。（当然 GRE 级别的文章不只是复合句一个问题需要解决就是了。）相信读者老爷们这么聪明，应当相比当年的我，能更快获得提升。\u003c/p\u003e\n\u003cp\u003e分析完成之后，就要练习。练习的方法也很简单：模仿造句——牙牙学语嘛！对每个你初时感到困难的复合句进行三到五次模仿造句——模仿它的句子结构，也模仿子句之间的逻辑关系。\u003c/p\u003e\n\u003cp\u003e按照这样分析和练习的方法，每天花费大概半个小时的时间，你将能一劳永逸地征服英语复合句。它不香吗？\u003c/p\u003e\n\n    \u003c/div\u003e",
  "Date": "2021-05-07T14:46:19Z",
  "Author": "Liam Huang"
}