{
  "Source": "liam.page",
  "Title": "重读「病梅馆记」",
  "Link": "https://liam.page/2016/12/12/review-of-bingmeiguanji/",
  "Content": "\u003cdiv class=\"post-body\" itemprop=\"articleBody\"\u003e\n\n      \n        \u003cp\u003e今天有人在群里讲，大意是「我就喜欢 CJK，不喜欢 CTeX 宏集，不够通用」。我对此的评价是「啥也不懂，瞎搞胡搞」，然后摘了龚自珍的「病梅馆记」中的一段话作为评论。\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003e梅以曲为美，直则无姿；以欹为美，正则无景；以疏为美，密则无态。\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003e后有人惊奇，曰：「这么偏的中学古文，你居然还记得」。答曰：「大约因为吾与龚自珍同类也」。\u003c/p\u003e\n\u003cspan id=\"more\"\u003e\u003c/span\u003e\n\n\u003ch2 id=\"原文\"\u003e\u003ca href=\"#原文\" class=\"headerlink\" title=\"原文\"\u003e\u003c/a\u003e原文\u003c/h2\u003e\u003cblockquote\u003e\n\u003cp\u003e江宁之龙蟠，苏州之邓尉，杭州之西溪，皆产梅。或曰：“梅以曲为美，直则无姿；以欹为美，正则无景；以疏为美，密则无态。”固也。此文人画士，心知其意，未可明诏大号以绳天下之梅也；又不可以使天下之民斫直，删密，锄正，以夭梅病梅为业以求钱也。梅之欹之疏之曲，又非蠢蠢求钱之民能以其智力为也。有以文人画士孤癖之隐明告鬻梅者，斫其正，养其旁条，删其密，夭其稚枝，锄其直，遏其生气，以求重价，而江浙之梅皆病。文人画士之祸之烈至此哉！\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cblockquote\u003e\n\u003cp\u003e予购三百盆，皆病者，无一完者。既泣之三日，乃誓疗之：纵之顺之，毁其盆，悉埋于地，解其棕缚；以五年为期，必复之全之。予本非文人画士，甘受诟厉，辟病梅之馆以贮之。\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cblockquote\u003e\n\u003cp\u003e呜呼！安得使予多暇日，又多闲田，以广贮江宁、杭州、苏州之病梅，穷予生之光阴以疗梅也哉！\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003ch2 id=\"重新读它\"\u003e\u003ca href=\"#重新读它\" class=\"headerlink\" title=\"重新读它\"\u003e\u003c/a\u003e重新读它\u003c/h2\u003e\u003cp\u003e不管是读古文，还是读英文，我都是反对通篇翻译的。你是来读文章的，不是来翻译它自虐的。所以我不翻译它，只是说说它讲了啥，以及我们该如何做。\u003c/p\u003e\n\u003cp\u003e文章第一段，用时下的粗话讲，就是：「你们这些脑残，胡搞瞎搞，好好的东西非得整坏了使」。怎么说呢？且看。\u003c/p\u003e\n\u003cp\u003e文章说，A/B/C 三个地方，都出产梅。然而好好的梅花，一帮子穷酸书呆子认为非得歪七扭八，才「别致」才「有韵味」。这帮心理变态瞎搞胡闹，惹得买梅花的人辛苦栽好了梅花，为了卖个好价钱，非得把树枝折了才好。这多脑残啊！\u003c/p\u003e\n\u003cp\u003e文章第二段，用时下的话讲，就是：「梅花多可怜，我要拯救它。你们不喜欢，我就开一个『病梅馆』，故意跟你们对着干。怼死你！」\u003c/p\u003e\n\u003cp\u003e文章第三段，又急转直下，说：「脑残太多啊，药不够了啊！」\u003c/p\u003e\n\u003ch2 id=\"我们应该学到什么\"\u003e\u003ca href=\"#我们应该学到什么\" class=\"headerlink\" title=\"我们应该学到什么\"\u003e\u003c/a\u003e我们应该学到什么\u003c/h2\u003e\u003ch3 id=\"用适合的工具做合适的事\"\u003e\u003ca href=\"#用适合的工具做合适的事\" class=\"headerlink\" title=\"用适合的工具做合适的事\"\u003e\u003c/a\u003e用适合的工具做合适的事\u003c/h3\u003e\u003cp\u003eVim 很好，Emacs 很好。可是，它们不是万能的。作为通用编辑器，它们在编写的过程中，能提供很多快捷键、宏，来加快编辑速度。但是，在其他很多功能上，它们终究比不上以 Visual Studio 为代表的 IDE。\u003c/p\u003e\n\u003cp\u003eLaTeX 很好。可是，它也不是万能的。对于中文竖排、对于各种幻灯片特效的制作，它都不擅长。\u003c/p\u003e\n\u003cp\u003e可能有人会说：「Vim 加上 XX 插件也能完成 YY 任务」，或者「LaTeX 也可以做幻灯片的，有这样或那样的技巧」。\u003c/p\u003e\n\u003cp\u003e是，你们说的都没错。但是，我有更好的选择，能够又好又快地达成我的目标，\u003cstrong\u003e我干嘛要浪费时间和生命在折腾这些工具上\u003c/strong\u003e？要知道，\u003cstrong\u003e我的目的是用工具来创造价值，而不是去研究工具本身\u003c/strong\u003e。非得用工具做它不擅长的事情，就和那些穷酸书生非得对着梅花胡搞瞎搞，一个样。\u003c/p\u003e\n\u003ch3 id=\"要深入了解，不要轻易妄言\"\u003e\u003ca href=\"#要深入了解，不要轻易妄言\" class=\"headerlink\" title=\"要深入了解，不要轻易妄言\"\u003e\u003c/a\u003e要深入了解，不要轻易妄言\u003c/h3\u003e\u003cp\u003e什么是好？这个问题太大，一般人没法回答。但是，对于生物来说，所谓的「好」，就是健康地生活下去，最终传递自己的基因给下一代。穷酸书生，为了自己扭曲的审美，把梅花这里折断，那里掰弯，把梅花弄得奄奄一息——哦，要不是梅花这么坚韧的植物，还经不起这番折腾呢。这不是好，这就是名副其实地胡搞瞎搞。\u003c/p\u003e\n\u003cp\u003e究其本质，是这些穷酸书生没有深入去了解梅花的习性，自以为是又轻易妄言。\u003c/p\u003e\n\u003cp\u003e对于 CJK 来说，它取代了天元、CCT 等 LaTeX 中文支持方案。在那个时代是好的。这主要是因为，CJK 方案省去了将中文 \u003ccode\u003e.tex\u003c/code\u003e 文件预处理的步骤，可以直接编译。然而，使用 CJK 需要先将中文字体切成许多分子字体，然后制作成 TeX 能够识别的字体。这个过程本身繁琐，在任何平台上使用，都要做这么个操作，因此根本一点都不通用。\u003c/p\u003e\n\u003cp\u003e随着 XeTeX/LuaTeX 的开发完善，并随着 LuaTeX-ja/xeCJK/CTeX 宏包（宏集）的完善，CJK 已经完成了它的历史使命，应该说仅作为兼容性保留了。如果对 CJK 有过一些深入的了解，就知道它麻烦且排版效果不好了。说它通用性好，更是无稽之谈。\u003c/p\u003e\n\u003cp\u003e总之，\u003cstrong\u003e要深入了解，不要妄下判断，甚至抱残守缺\u003c/strong\u003e。\u003c/p\u003e\n\n    \u003c/div\u003e",
  "Date": "2016-12-12T14:21:26Z",
  "Author": "Liam Huang"
}