{
  "Source": "liam.page",
  "Title": "何谓「内卷化」",
  "Link": "https://liam.page/2020/07/22/what-is-involution/",
  "Content": "\u003cdiv class=\"post-body\" itemprop=\"articleBody\"\u003e\n\n      \n        \u003cp\u003e最近互联网上经常说内卷。特别是识得的一些清华大学的小同学们经常在我耳边卷啊卷。作为一个跟不上时代的过气年轻人，我无法理解内卷是什么意思，于是有上网检索。\u003c/p\u003e\n\u003cspan id=\"more\"\u003e\u003c/span\u003e\n\n\u003ch2 id=\"他山之石\"\u003e\u003ca href=\"#他山之石\" class=\"headerlink\" title=\"他山之石\"\u003e\u003c/a\u003e他山之石\u003c/h2\u003e\u003ch3 id=\"词典\"\u003e\u003ca href=\"#词典\" class=\"headerlink\" title=\"词典\"\u003e\u003c/a\u003e词典\u003c/h3\u003e\u003cp\u003e内卷的英文是 involution。在医学上，它表示萎缩或者退化。在 AHD 当中，它的解释是：\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA decrease in size of an organ, as of the uterus following childbirth.（器官在大小上的萎缩，例如生育之后女性子宫的萎缩。）\u003c/li\u003e\n\u003cli\u003eA progressive decline or degeneration of normal physiological functioning occurring as a result of the aging process.（因年龄增长而出现的身体正常功能的持续衰退或退化。）\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3 id=\"百度百科\"\u003e\u003ca href=\"#百度百科\" class=\"headerlink\" title=\"百度百科\"\u003e\u003c/a\u003e百度百科\u003c/h3\u003e\u003cp\u003e\u003ca target=\"_blank\" rel=\"noopener\" href=\"https://baike.baidu.com/item/%E5%86%85%E5%8D%B7%E5%8C%96\"\u003e百度百科\u003c/a\u003e对内卷化的描述中，有如下内容：\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003e内卷化一词源于美国人类学家吉尔茨（Clifford Geertz）《农业内卷化——印度尼西亚的生态变化过程》（Agricultural Involution: The Processes of Ecological Change in Indonesia）。根据吉尔茨的定义，「内卷化」是指一种社会或文化模式在某一发展阶段达到一种确定的形式后，便停滞不前或无法转化为另一种高级模式的现象。这一概念最早是用来研究爪哇的水稻农业。在殖民地时代和后殖民地时代的爪哇，农业生产长期以来原地不动，未曾发展，只是不断地重复简单再生产。不能提高单位人均产值。\u003c/p\u003e\n\u003cp\u003e黄宗智在《长江三角洲小农家庭与乡村发展》中，把内卷化这一概念用于中国经济发展与社会变迁的研究，他把通过在有限的土地上投入大量的劳动力来获得总产量增长的方式，即边际效益递减的方式，称为没有发展的增长即「内卷化」。\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003ch3 id=\"小结\"\u003e\u003ca href=\"#小结\" class=\"headerlink\" title=\"小结\"\u003e\u003c/a\u003e小结\u003c/h3\u003e\u003cp\u003e从词典和百度百科的描述来看，内卷用在社会现象上时，表达的大概有几层含义：\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e在宏观上，发展停滞不前，甚至在规模上萎缩退化。\u003c/li\u003e\n\u003cli\u003e在微观上，努力的效用停滞不前，甚至在边际效用上萎缩退化。\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e用数学的语言来表述，就是社会发展水平和经济规模，一阶导数和二阶导数均为负数。\u003c/p\u003e\n\u003ch2 id=\"生活化的理解\"\u003e\u003ca href=\"#生活化的理解\" class=\"headerlink\" title=\"生活化的理解\"\u003e\u003c/a\u003e生活化的理解\u003c/h2\u003e\u003cp\u003e上面的解释，都是比较学术派的解释，普通老百姓是不会满意于这种解释的。\u003c/p\u003e\n\u003ch3 id=\"思维实验的结论\"\u003e\u003ca href=\"#思维实验的结论\" class=\"headerlink\" title=\"思维实验的结论\"\u003e\u003c/a\u003e思维实验的结论\u003c/h3\u003e\u003cblockquote\u003e\n\u003cp\u003e以下没有参考来源，纯粹是不可靠的思维实验得出的结论。请谨慎参考。\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003e就我的观察，我理解内卷化现象是一种恶性循环。在恶性循环当中，大多数人的边际效用极低（因而获利极少）而极少数人边际效用极高（因而获利极大）。造成这种现象的原因主要是恶性竞争。而这种恶性竞争的起因至少有二：资源压力、信息不对称。用一句话说，内卷化现象是\u003cstrong\u003e资源压力下信息不对称导致的恶性竞争导致大多数人边际效用极低而极少数人赚取到大量利益并陷入恶性循环\u003c/strong\u003e。\u003c/p\u003e\n\u003cp\u003e这里有几个关键点。\u003c/p\u003e\n\u003cp\u003e首先是资源压力。\u003c/p\u003e\n\u003cp\u003e这里说的资源，是广义的资源。可以是钢铁、石油之类的实体资源；也可以是医疗、教育之类的社会资源；也可以是其它利用信息不对称，构建的心理资源。在发展的早期，社会整体资源利用率相对较低，并且人口数量也较少，因而人们感受不到资源压力。但发展到一定水平之后，资源的瓶颈就出现了。此时，社会内部的竞争就存在从良性竞争转向恶性竞争的趋势。\u003c/p\u003e\n\u003cp\u003e而后是信息不对称导致的边际效用的歧化。\u003c/p\u003e\n\u003cp\u003e某种意义上，对信息的全面了解，是作出正确决定的基石。当社会存在明显的信息不对称时，可能出现歧化现象：信息优势者，轻易作出正确决定，从而极大地提升生产效率；信息劣势者，容易作出错误决定，从而投入大量资源在低效的生产方式上。当歧化现象趋于严重且长期持续时，信息劣势者之间发生恶性竞争的可能性就会放大，从而出现「劣币驱逐良币」的现象。\u003c/p\u003e\n\u003cp\u003e最后是恶性循环。\u003c/p\u003e\n\u003cp\u003e信息不对称可能因正反馈而出现马太效应，从而使群体陷入恶性循环。假设在群体中，初始情况下人们对信息的了解程度是随机的。那么，具有相对信息优势的人，就容易做出正确决定，从而极大地提升生产效率，赚取大量利益。而当利益成为资本沉淀，又会相对更容易地获取信息优势，从而形成正反馈。简单来说，就是在信息优劣上，强者恒强、强者更强。在人性恶的一面被放大的情况下（毕竟，「资本永不眠」），具有绝对信息优势者，可能主动引导甚至加剧信息劣势者之间的恶性竞争，从而稳固自身的信息优势。\u003c/p\u003e\n\u003cp\u003e在内卷化的进程中，最令人感觉不公的，大概就是随机的初始条件。——最早你可能只是因为运气好，然后不断放大自己的优势，以至于现在无法逾越的优势鸿沟。\u003c/p\u003e\n\u003ch3 id=\"破局之法\"\u003e\u003ca href=\"#破局之法\" class=\"headerlink\" title=\"破局之法\"\u003e\u003c/a\u003e破局之法\u003c/h3\u003e\u003cp\u003e内卷的产生，有几个先决条件：\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e资源压力；\u003c/li\u003e\n\u003cli\u003e信息不对称；\u003c/li\u003e\n\u003cli\u003e恶性竞争。\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e这里，基于我们尚未实现「世界大同」，因而在感受到资源压力且存在信息不对称现象的社会中，某种意义上，恶性竞争是人性的必然结果。因此，避免或减轻内卷，就要从资源压力和信息不对称上下手。我们有如下一些解法：\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e知识和技术升级。通过技术升级，提升资源利用率，从而使有限的资源提供更大的社会生产，进而降低整体资源压力。\u003c/li\u003e\n\u003cli\u003e信息公平化。通过强制手段，维护和加强信息公平，避免信息为资本所控制。\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e这里，知识和技术的升级是手段，而信息公平化是基石。之所以这样说，是因为在资本的加持下，知识和技术的升级会更容易和快速，若无信息公平，则知识和技术的升级反而可能会加剧内卷。在这个意义上，当今世界两种制度及其背后的意识形态之优劣，就很明显了。只可惜，「自由化」的糖衣炮弹太厉害，很多人是看不清的。\u003c/p\u003e\n\n    \u003c/div\u003e",
  "Date": "2020-07-22T03:30:02Z",
  "Author": "Liam Huang"
}