{
  "Source": "liam.page",
  "Title": "利用穷人乐理论撰写精准营销类文章",
  "Link": "https://liam.page/2019/11/06/writing-marketing-articles-based-on-the-theory-of-poor-but-happy/",
  "Content": "\u003cdiv class=\"post-body\" itemprop=\"articleBody\"\u003e\n\n      \n        \u003cp\u003e中国互联网历史中，要论最成功的精准营销类文章写手，咪蒙必在其中无疑。咪蒙本名马凌，说起来还是我山东大学的校友。2015 年时，马凌注册了名为咪蒙的微信公众号。该微信公众号以发表精准定位现代女性的营销类文章而出名，一度有超过千万的关注量和阅读量。\u003c/p\u003e\n\u003cp\u003e时至今日，\u003ca target=\"_blank\" rel=\"noopener\" href=\"https://www.zhihu.com/question/318167756\"\u003e咪蒙已经「毕业」\u003c/a\u003e，但互联网江湖上一直流传着咪蒙的传说。大家乐此不疲地讨论和思考，咪蒙为什么会成功？咪蒙的文章为什么会有这种奇怪的魔力，让无数具有良好教育的现代女性为之着魔。\u003c/p\u003e\n\u003cp\u003e此篇讲一讲我的一些思考。\u003c/p\u003e\n\u003cspan id=\"more\"\u003e\u003c/span\u003e\n\n\u003ch2 id=\"人穷但快乐\"\u003e\u003ca href=\"#人穷但快乐\" class=\"headerlink\" title=\"人穷但快乐\"\u003e\u003c/a\u003e人穷但快乐\u003c/h2\u003e\u003cp\u003e世界上有一种奇怪的现象。\u003c/p\u003e\n\u003cp\u003e有一些人，生活水平和物质基础低于平均水平，我们称之为穷人。在追逐更高生活水平和物质基础的过程中，穷人往往会凭着自己的想象，设想出心目中富人的样子。这些穷人为了平衡自己落后的物质基础，会认为富人的精神世界是单调的、空洞的、乏味的。也就是说：这部分穷人承认自己穷，但是认为自己活得开心快乐；认为富人虽然富，但是富人精神空虚。\u003c/p\u003e\n\u003cp\u003e我们说，在这个过程中，这些穷人不仅会表现出物质上的穷，还会表现了精神世界层面的穷。我们把这种现象称之为「人穷但快乐」，简称「穷人乐」。\u003c/p\u003e\n\u003ch2 id=\"分裂的人性\"\u003e\u003ca href=\"#分裂的人性\" class=\"headerlink\" title=\"分裂的人性\"\u003e\u003c/a\u003e分裂的人性\u003c/h2\u003e\u003cp\u003e读完上面这一段，如果你很穷，你大概会很生气；如果你比较富裕，你大概心里长处一口气。但别着急，读完这一段，可能不论你穷困还是富裕，你可能都会胸有愤愤。\u003c/p\u003e\n\u003cp\u003e上面这一段说的穷人，主要说的是经济实力上问题。但实际上，这种穷，可以扩展到很多方面。穷人的穷，实际上说的是经济实力上的「不如人意」。于是，我们可以把这种现象，扩展到任何层面上的不如人意上。\u003c/p\u003e\n\u003cp\u003e比如：\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e谢顶者可能会心想：你虽然头发浓密，但是你肯定学习不用功。\u003c/li\u003e\n\u003cli\u003e学习差者可能会心想：你虽然学习好，但你将来也就是个打工者。\u003c/li\u003e\n\u003cli\u003e打工者可能会心想：你虽然当老板，但是你老婆肯定会背叛你。\u003c/li\u003e\n\u003cli\u003e夫妻不和睦的人可能会心想：你虽然家庭幸福，但你肯定每天精疲力尽。（\u003ccode\u003e←_←\u003c/code\u003e）\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e看！多么分裂的人性！\u003c/p\u003e\n\u003cp\u003e顺着这个思路往下走，你猜给下面这些文章点赞的人，是处于什么感情状态：\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e我一个人活得好好的，为什么要结婚？\u003c/li\u003e\n\u003cli\u003e女人好好打扮就是为了取悦男人？瞎扯！\u003c/li\u003e\n\u003cli\u003e对不起，你的病，爱情治不了\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2 id=\"精准营销\"\u003e\u003ca href=\"#精准营销\" class=\"headerlink\" title=\"精准营销\"\u003e\u003c/a\u003e精准营销\u003c/h2\u003e\u003cp\u003e好了，所以你大概已经想明白了。如果你要瞄准一个在某方面过得不如意的人，撰写一篇精准营销文章应该怎么写呢？\u003c/p\u003e\n\u003cp\u003e首先，你得有一个抓住这些人眼球的标题。怎样才能抓住这些人的眼球呢？答案很简单：如果这个人在某方面过得不如意，就批判贬低这方面过得如意的人，或者力挺这方面过得不如意的人。\u003c/p\u003e\n\u003cp\u003e比如对于在感情中受过伤，再也不相信爱情的女性：\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e我一个人活得好好的，为什么要结婚？——力挺在感情中不如意的人\u003c/li\u003e\n\u003cli\u003e女人好好打扮就是为了取悦男人？瞎扯！——批判感情中如意的人（有男人可取悦）\u003c/li\u003e\n\u003cli\u003e有一种礼物，叫男朋友送的礼物——男朋友送的礼物肯定都是狗屁不通的呗，这是在贬低有男朋友的女的也收不到什么像样的礼物\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e还有其他一些例子：\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e我，一个矮子的史诗——你看，都「史诗」了，这不就是力挺矮子么\u003c/li\u003e\n\u003cli\u003e如何把大牌穿成地摊货？——你看，那些有钱人居然能把大牌穿成地摊货，这不就是批判有钱人么\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e而后，你得编造一个故事，核心还是：批判如意者，发现不如意者其他方面的闪光点。总而言之，一大碗毒鸡汤就这么狠狠灌下去。\u003c/p\u003e\n\u003cp\u003e最后，如果你要营销带货，最好在文章的末尾来一个反转。比如，对于「我，一个矮子的史诗」这篇文章，如果要带货卖增高鞋垫，我会在大篇幅批判那些高个子人之后来这么一句：\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003e后来，我才知道，XX 看起来高，实际上只不过是在鞋子中悄悄放了一块 XX 品牌 3cm 的增高鞋垫罢了。\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003e你看，情绪上还是对高个子人的嘲讽鄙视，但不经意间，一个反转，点出了需要营销的东西。\u003c/p\u003e\n\u003cp\u003e\u003ccode\u003eo(*￣︶￣*)o\u003c/code\u003e\u003c/p\u003e\n\n    \u003c/div\u003e",
  "Date": "2019-11-06T09:47:12Z",
  "Author": "Liam Huang"
}