{
  "Source": "liam.page",
  "Title": "写博客的动机",
  "Link": "https://liam.page/2017/12/27/motivation-to-blogs/",
  "Content": "\u003cdiv class=\"post-body\" itemprop=\"articleBody\"\u003e\n\n      \n        \u003cp\u003e作为一个偏科严重的理工男，高中时期，我可以在数学和理综考试中拿到满分或者接近满分的成绩，但我也可以在语文和英语两门科目当中考出刚及格甚至不及格的成绩。因此，迷上写博客文章，以及出版一本 GRE 的练习册对我而言也算是很神奇的事情了。\u003c/p\u003e\n\u003cspan id=\"more\"\u003e\u003c/span\u003e\n\n\u003cp\u003e刚开始写类似博客的文章，是本科快毕业的时候。那时候人人网还没有变成现在这副死样子；于是，作为一个技术弱鸡，我没能耐自己搭建博客，就选择在校内日志上撰写偏技术的文章。坦率地说，虽然写博文的原因可以有很多，但归根到底回忆最早初始的动机其实只有两个：\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e作为一个记忆力极差的人，将自己好不容易理解记住的东西写下来，给自己备查；\u003c/li\u003e\n\u003cli\u003e作为一个害怕被遗忘的人，将自己觉得有些意思的东西写下来，刷新自己的存在感。\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e因此，直白点说，一是为了防蠢，二是为了装屄。\u003c/p\u003e\n\u003cp\u003e后来，写了一些文章之后，我发现写文章一方面改变了我，一方面这件事情本身也发生了些许改变。\u003c/p\u003e\n\u003cp\u003e如刚才所说，我是一个在中学阶段语文非常差的学生。特别地，在「作文」方面，我是历任老师眼里不折不扣的「问题少年」。于我自己而言，中学时写作文是非常痛苦的事情。一方面我写字速度很慢，每次练习都耗时耗力；另一方面我在写作文这件事情上实在「难产」——每次要求 800 字的作文，都要「憋」许久才行。然而，坚持写文章一段时间之后，「如泉涌」的状态取代了「难产」的状态，变成我写文章时更普遍的感受。这也就是说，写文章这件事情在一定程度上改变了我「不会写文章」的状态。\u003c/p\u003e\n\u003cp\u003e我虽然一直自诩是一个理智有逻辑的人，但我发现那都是「自己以为」。因为我发现，如果不能把自己所思所想用「他人」能够理解的方式，有逻辑地讲解出来，那么所谓的「有逻辑」都是幻觉。这就引出了写作对我的第二个改变。为了使自己写的文章能让「别人」明白，不论是行文还是平时说话时，我都会以超脱自己的立场，将事情的前因后果讲述清楚。这第二个改变，也让我时时苦恼。在很多问答场景下，我发现向我提问的人并没有这种将事情前因后果讲述清楚的能力；更多的时候，是类似「头疼砍头给医生、脚疼剁脚给大夫」的求问方式。因此，为了「如何讲清楚问题」这件事情，我又写了一些文章，但目前看来收效甚微。\u003c/p\u003e\n\u003cp\u003e写文章当然不止给我带来了这些变化。工作之后我发现，因为这样那样的原因，雇员会经常需要写文章。例如说平日周期性的周报、组内分享；又例如说时不时会需要的述职、评级、汇报。我不敢说我长期坚持写作在这方面给我带来了多少收益，但至少相比我能看到的同事，在这些方面我花费的时间、消耗的脑力是要少得多了。\u003c/p\u003e\n\u003cp\u003e在坚持的过程中，写文章改变了我，也改变了这件事情本身。\u003c/p\u003e\n\u003cp\u003e如前所述，最初开始写文章，一是为了防蠢，二是为了装屄。经历了这些改变之后，写文章于我已经慢慢变成了一种日常的习惯——不写就不舒服。特别地，我慢慢发现，因为「一定要把某件事情讲清楚」，所以我必须现在动笔之前把某件事情的前因后果以及潜在的坑理解透彻。因此，写文章实际上在「防蠢」和「装屄」之外，还多了「督促我进步」这样的功能。当我感受到写作这件事情本身有了这样的改变之后，当时的我给自己定下了这样的小目标：平均每周必须要写一篇原创文章。所幸，这个小目标已经变成了自然而然的习惯，并一直坚持至今。\u003c/p\u003e\n\u003cp\u003e所以，你愿意开始坚持写博客了吗？\u003c/p\u003e\n\u003cp\u003e另有早些时候的文章一篇：\u003ca href=\"/2015/03/19/why-i-love-to-share/\"\u003e为什么我乐于分享？\u003c/a\u003e。\u003c/p\u003e\n\n    \u003c/div\u003e",
  "Date": "2017-12-27T05:24:59Z",
  "Author": "Liam Huang"
}