{
  "Source": "liam.page",
  "Title": "期权价格与领口策略",
  "Link": "https://liam.page/2021/03/15/price-of-option-and-the-collar-strategy/",
  "Content": "\u003cdiv class=\"post-body\" itemprop=\"articleBody\"\u003e\n\n      \n        \u003cp\u003e\u003ca href=\"https://liam.page/2019/11/24/option-and-hedge/\"\u003e前作\u003c/a\u003e简单讨论了期权，也提及了卖权价格变化的影响因素。不过，对于这些影响因素背后的原理并未深究。\u003c/p\u003e\n\u003cp\u003e此外，我们已经知道，合理利用期权可以对冲股票价格下跌的风险。但简单地买入卖权（long put options），也会对应增加持仓成本。\u003c/p\u003e\n\u003cp\u003e针对这两个话题，此篇做进一步讨论。\u003c/p\u003e\n\u003cspan id=\"more\"\u003e\u003c/span\u003e\n\n\u003ch2 id=\"期权的价格\"\u003e\u003ca href=\"#期权的价格\" class=\"headerlink\" title=\"期权的价格\"\u003e\u003c/a\u003e期权的价格\u003c/h2\u003e\u003cp\u003e要讨论期权的价格，就要搞清楚期权的本质究竟是什么。\u003c/p\u003e\n\u003cp\u003e可能你已经买过期权，或者打算买期权。那么，既然又买，就一定有卖。你有没有考虑过，究竟是谁在卖给你呢？以及，卖给你期权的人，究竟和你做了怎样一笔交易？\u003c/p\u003e\n\u003cp\u003e我们拿买权来说。假定你以 5 元的价格，购买了一份 3 个月后行权的看涨期权。期权的行权价是 100 元。显然，你之所以买这一期权，是有一定把握认为对应标的物的价格，在 3 个月后（内）会上涨超过 105 元（break-even price）。因为如此，你买入的看涨期权才会为你带来收益。相对应的，卖给你期权的那个人（虽然你不知道是谁），肯定认为 3 个月后（内），标的物的价格不会超过 100 元。因为这样一来，它就能稳赚这 5 元的期权权利金。\u003c/p\u003e\n\u003cp\u003e从这里出发，不难看出：期权的买卖双方，实际是在通过自己的认知，对标的物未来的价格进行判断，而后以期权合约做做媒介进行赌博。也就是说，期权实际是一种对赌。\u003c/p\u003e\n\u003cp\u003e既然是对赌，就涉及到概率（赌徒获胜的概率）和赔率（赌徒获胜的收益）。显然，赌徒获胜的概率越高，庄家设定的赔率就会越低。若不然，庄家肯定亏死了。在期权的语境里，期权的买方是赌徒，卖方是庄家。因此，对于买方来说，越容易赚钱的期权，其价格就越高。\u003c/p\u003e\n\u003cp\u003e因此，其他条件不变的情况下，不难有分析：\u003c/p\u003e\n\u003cp\u003e对于买权（call option）\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e行权价格越高，正股价格上涨超过行权价的可能性越小，因此买权价格越低；——买权的内涵价值随行权价上升而减小\u003c/li\u003e\n\u003cli\u003e截止日期越近，正股价格上涨超过某个行权价需要的日均涨幅越大，因而可能性越小，因此买权价格越低；——期权的时间价值随到期日临近而衰减\u003c/li\u003e\n\u003cli\u003e标的物（预期）波动越大，正股价格上涨超过某个行权价格（哪怕只是一瞬间）的可能性越大，因而买权价格越高。\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e对于卖权（put option）\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e行权价格越高，正股价格下跌低于行权价的可能性越大，因此买权价格越高；——卖权的内涵价值随行权价上升而上升\u003c/li\u003e\n\u003cli\u003e截止日期越近，正股价格下跌低于某个行权价需要的日均跌幅越大，因而可能性越小，因此买权价格越低；——期权的时间价值随到期日临近而衰减\u003c/li\u003e\n\u003cli\u003e标的物（预期）波动越大，正股价格下跌低于某个行权价格（哪怕只是一瞬间）的可能性越大，因而买权价格越高。\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2 id=\"领口策略（the-Collar-Strategy）\"\u003e\u003ca href=\"#领口策略（the-Collar-Strategy）\" class=\"headerlink\" title=\"领口策略（the Collar Strategy）\"\u003e\u003c/a\u003e领口策略（the Collar Strategy）\u003c/h2\u003e\u003cp\u003e市场行情不确定性高时，买股票是会有很大风险的。合理地利用期权，可以有效地对冲风险。当然，对冲风险的同时，不可避免地会让收益也有所缩减。这是因为，购买看跌期权以锁定亏损上限是有成本的。将标的物（比如正股）和期权看做一个整体时，计算收益时，应当把购买看跌期权的成本计算在内。比如你以 100 元的价格购入 1 股正股，然后以 2 元的价格购入行权价为 95 元的看跌期权。此时，你锁定了亏损上限，但同时拉高了持仓成本。此时你的持仓成本是买入股价与期权价格之和，即 102 元。\u003c/p\u003e\n\u003cp\u003e为了抵消因购入看跌期权带来的成本上升，很自然地，我们会想：要不我们卖点期权出去？显然，如果同样是卖出看跌期权是没意义的，所以，我们考虑卖出看涨期权。亦即，我们在买入正股的同时，买入一份虚值看跌期权（行权价比现价低的看跌期权），卖出一份虚值看涨期权（行权价比现价高的看涨期权）。其中看跌期权用来保护股价下跌，看涨期权则用来低消对冲成本。这种运用期权的策略，就是领口策略。\u003c/p\u003e\n\u003cp\u003e领口策略如何运用呢？我们来看一个例子：\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003e假定现在 01/01 正股价格是 100 元。此时，买入正股 1 股；卖出行权价 105 的 call（04/01），收入 20 元；买入行权价 95 的 put（04/01），成本 17.5 元。这样一来，实际成本 97.5 元（100 - 20 + 17.5）。\u003c/p\u003e\n\u003cp\u003e04/01，期权到期。\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e若正股价格大于 105，卖出的 call 被行权，收入 105 元。净赚 7.5 元。\u003c/li\u003e\n\u003cli\u003e若正股价格小于 95，对买入的 put 行权，收入 95 元。净亏 2.5 元。\u003c/li\u003e\n\u003cli\u003e若正股价格位于 95 和 105 之间，期权失效，但持仓成本被策略从 100 拉低到 97.5 元，纸面收益（paper profit）是当前股价与 97.5 元之间的差值。\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/blockquote\u003e\n\u003cp\u003e在这样的场景当中，如果正股价格疯涨，那么由于卖出的看涨期权被对家行权，相当于放弃了正股价格在 105 元之上的收益；如果正股价格暴跌，你可以选择行权买入的看跌期权，锁住最大亏损。因此，领口策略最适用的场景是：\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e操作人\u003cstrong\u003e不追求暴涨带来的超额收益\u003c/strong\u003e（因为超额收益被 call option 截去）；\u003c/li\u003e\n\u003cli\u003e操作人\u003cstrong\u003e长期看好标的价格上涨\u003c/strong\u003e（因为如果标的物价格持续下跌，持续触发 put option，终将产生可观亏损）。\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e因此，在上例中，若你是操作人，且依然长期看好标的物，那么你应该：\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e如果期权被行权，你的正股被卖出，你应该重新建仓并建立领口策略；\u003c/li\u003e\n\u003cli\u003e如果期权没有被行权，你应该围绕最新的价格，继续建立领口策略。\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e这样往复操作下去，如果通过合理的操作，最终将综合成本降低到看跌期权的行权价之下；那么，实际上在期权到期之前，策略就是稳赚不赔的了。\u003c/p\u003e\n\n    \u003c/div\u003e",
  "Date": "2021-03-15T12:00:35Z",
  "Author": "Liam Huang"
}