{
  "Source": "liam.page",
  "Title": "论善良",
  "Link": "https://liam.page/2021/06/17/discussion-on-kind/",
  "Content": "\u003cdiv class=\"post-body\" itemprop=\"articleBody\"\u003e\n\n      \n        \u003cp\u003e博客虽以技术文章为主，但仍夹杂有不少杂文。此篇讨论善良。\u003c/p\u003e\n\u003cspan id=\"more\"\u003e\u003c/span\u003e\n\n\u003ch2 id=\"善良是什么？\"\u003e\u003ca href=\"#善良是什么？\" class=\"headerlink\" title=\"善良是什么？\"\u003e\u003c/a\u003e善良是什么？\u003c/h2\u003e\u003cp\u003e善良一词，与我所见最早者，当出自《礼记·学记》。曰：「发虑宪，求善良，足以謏闻，不足以动众。」\u003c/p\u003e\n\u003cp\u003e按文言一贯作风，善良虽在现代汉语中成词已久，但在文言中大概是分别表意的。在文言文词典中，\u003ca target=\"_blank\" rel=\"noopener\" href=\"https://wyw.hwxnet.com/view/hwxE5hwx96hwx84.html\"\u003e善\u003c/a\u003e作名词表示「好的行为」，作形容词表示「赞许的」或是「熟悉」。显然，此处应取「值得赞许的」的含义。\u003ca target=\"_blank\" rel=\"noopener\" href=\"https://wyw.hwxnet.com/view/hwxE8hwx89hwxAF.html\"\u003e良\u003c/a\u003e作形容词表示「好」。因此，讲白了，文言中的「善良」大约就是人类品德中所有好的品德的集合体。\u003c/p\u003e\n\u003cp\u003e在现代汉语中，善良的表意某种意义上被圈定在「和善」、「心地好」这样的意思上了。\u003c/p\u003e\n\u003ch2 id=\"人善被人欺？\"\u003e\u003ca href=\"#人善被人欺？\" class=\"headerlink\" title=\"人善被人欺？\"\u003e\u003c/a\u003e人善被人欺？\u003c/h2\u003e\u003cp\u003e大多数生长于传统中国家庭的孩子，大都从小被教育「要善良」。与之相应，孩子被要求「爱分享」、「乐于助人」等。\u003c/p\u003e\n\u003cp\u003e然而，步入社会之后，或多或少地，这些从小被教育要善良的孩子，都因「善良」吃过亏。其中不乏「屡教不改」抑或是「执迷不悔」的人，当然也有些人从此「黑化」或是抑郁。\u003c/p\u003e\n\u003cp\u003e这些时候，「孩子们」大约会想起父母的另一句话「害人之心不可有，防人之心不可无」。可是，爸爸妈妈，你们从来没教过我们要如何才能「防人」呀……\u003c/p\u003e\n\u003cp\u003e所以，到底要怎么办？\u003c/p\u003e\n\u003ch2 id=\"善心？善举？\"\u003e\u003ca href=\"#善心？善举？\" class=\"headerlink\" title=\"善心？善举？\"\u003e\u003c/a\u003e善心？善举？\u003c/h2\u003e\u003cp\u003e面对这个问题，我们不能逃避。因为你能逃一次，但将来不断发生的事情，会不断质疑你的内心。最终逃无可逃，必须直面。\u003c/p\u003e\n\u003cp\u003e为了解决这个问题，我们将善良分为两个部分，或者说两个层次：善心和善举。善心是无条件的，行善举是有条件的。若是行善举会危害到自己的核心利益，那便要慎重。世人多被要求善良，却不分善举和善心。无差别的善举最终往往害人害己。\u003c/p\u003e\n\u003cp\u003e对于以善良为代表的一切「美好的德行」，都有\u003cstrong\u003e论心不论迹\u003c/strong\u003e。也就是说，我们要将善心和善举区分开来；而后，常怀善心，擅行善举。\u003c/p\u003e\n\u003ch2 id=\"何时行善举？\"\u003e\u003ca href=\"#何时行善举？\" class=\"headerlink\" title=\"何时行善举？\"\u003e\u003c/a\u003e何时行善举？\u003c/h2\u003e\u003cp\u003e是否要行善举，这其实是一个选择题。\u003c/p\u003e\n\u003cp\u003e在我看来，这一选择题理当无有特殊性。也就是说，人生中其他类似的选择题如何做，这一道选择题就如何做。亦即，人自身的一切行为，都要有统一的标准去考量。不能因为善举于道德地位更高，就降低评判标准，而后决定施行，而不顾其可能带来的负面影响。\u003c/p\u003e\n\u003cp\u003e操作层面上，当意图行善时，脑回路里加一个步骤：这事儿做了之后最坏的结果自己能不能接受。如果不能接受的话，哪怕是善举，也慎重一些。\u003c/p\u003e\n\u003ch2 id=\"不为善其与为恶异乎？\"\u003e\u003ca href=\"#不为善其与为恶异乎？\" class=\"headerlink\" title=\"不为善其与为恶异乎？\"\u003e\u003c/a\u003e不为善其与为恶异乎？\u003c/h2\u003e\u003cp\u003e或曰：「不为善者与为恶者，无异也」。曰：「道德绑架者也。」\u003c/p\u003e\n\u003cp\u003e有人认为，善而不为，其与恶无异。此类谬误有二。一者，忽略世界的多样性，将善恶二元对立，认为非善即恶。他们认为，不做善事就是恶；不作恶事就是善。二者，将善良至于绝对片面的语境之下，忽略实际情况，忽略自身自我，将善良狭隘化为一个放之四海而皆准的道德标尺。殊不知，因为行善举，而将自己置于无法承受的危险之下，实际上是忽略了自我。「我」都没有了，还谈什么善良呢？这不是善良，而是伪善。\u003c/p\u003e\n\u003cp\u003e这些人可能也会拿汉昭烈帝的「勿以善小而不为」来做例证。然而，刘备遗诏中的意思，是强调善举大小、影响范围，却没有教刘禅不分青红皂白应当一律行善。\u003c/p\u003e\n\u003cp\u003e因此，认为不行善举即是作恶的人，其实就是道德绑架罢了。\u003c/p\u003e\n\u003ch2 id=\"真正的英雄主义\"\u003e\u003ca href=\"#真正的英雄主义\" class=\"headerlink\" title=\"真正的英雄主义\"\u003e\u003c/a\u003e真正的英雄主义\u003c/h2\u003e\u003cp\u003e罗曼·罗兰说：「世界上只有一种真正的英雄主义，就是认清了生活的真相后还依然热爱它」。\u003c/p\u003e\n\u003cp\u003e如何能做到这一点？\u003c/p\u003e\n\u003cp\u003e自己的善举可能为自己带来危害，这也是生活的真相之一。被伤害过后，你还愿意保持善良吗？被伤害过后，你能控制自己不去伤害别人吗？换言之，被伤害过后，你还热爱这个世界吗？\u003c/p\u003e\n\u003cp\u003e广义地看待善良，将善心和善举分开，常怀善心、擅行善举，则哪怕不能成为真的英雄，也常在成为英雄的路上了。\u003c/p\u003e\n\n    \u003c/div\u003e",
  "Date": "2021-06-17T13:07:31Z",
  "Author": "Liam Huang"
}