{
  "Source": "liam.page",
  "Title": "古诗词文赏析：鹊桥仙·纤云弄巧",
  "Link": "https://liam.page/2019/03/03/Queqiaoxian-Xianyunnongqiao/",
  "Content": "\u003cdiv class=\"post-body\" itemprop=\"articleBody\"\u003e\n\n      \n        \u003cp\u003e作为一个纯正的理工科学生，虽然在读书时代语文成绩不好，却在这些年随着阅历的增长，慢慢地能够感受到古诗词文传递的情绪、情感、力量甚至中国古代士子的精神追求。每次读到横渠四句，也会忍不住想要「为天地立心，为生民立命，为往圣继绝学，为万世开太平」。这大概是与中国人的文化血脉分不开的什么东西——说不清道不明，但又确实存在。于是，就这么带着不少冲动，决定开启古诗词文赏析这个系列的大坑，试着要去填一填。——哪怕填不好，哪怕会贻笑大方。但我写的是我自己的理解，希望能带给读者一些以前未有过的感受。\u003c/p\u003e\n\u003cp\u003e此篇谈谈秦观的佳作：鹊桥仙·纤云弄巧。\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003e纤云弄巧，飞星传恨，银汉迢迢暗渡。金风玉露一相逢，便胜却人间无数。\u003cbr/\u003e柔情似水，佳期如梦，忍顾鹊桥归路。两情若是久长时，又岂在朝朝暮暮？\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cspan id=\"more\"\u003e\u003c/span\u003e\n\n\u003ch2 id=\"背景\"\u003e\u003ca href=\"#背景\" class=\"headerlink\" title=\"背景\"\u003e\u003c/a\u003e背景\u003c/h2\u003e\u003cp\u003e这首鹊桥仙的背景，作为中国人大概再熟悉不过了。这是一首七夕词，说的是牛郎和织女的故事。\u003c/p\u003e\n\u003cp\u003e作为中国最著名的爱情故事——可能没有之一，牛郎和织女的故事不一定是一个悲剧，但一定是充满了\u003cstrong\u003e遗憾\u003c/strong\u003e色彩的故事。而遗憾，正是男女情感之间，最令人感怀的一种情绪。正因如此，在中国古代，有不少诗词曲以七夕和牛郎织女的故事为题，寄托诗词作者自己的情感。其中传唱最久远的，大概是汉乐府的一首古诗：\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003e汉乐府·古诗十九首之一\u003cbr/\u003e迢迢牵牛星，皎皎河汉女。\u003cbr/\u003e纤纤擢素手，札札弄机杼。\u003cbr/\u003e终日不成章，泣涕零如雨。\u003cbr/\u003e河汉清且浅，相去复几许。\u003cbr/\u003e盈盈一水间，脉脉不得语。\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003e也许是因为牛郎织女故事中的遗憾，七夕诗词曲大多逃不开「痴男怨女」的基调。例如此处汉乐府的古诗就细致地描写了织女因相似而不成章、泣涕如雨的样子，又讲银河就那么清浅，却与情郎不得相见叙说的苦闷。\u003c/p\u003e\n\u003cp\u003e秦观的鹊桥仙却别出机杼，堪称七夕诗词之最。\u003c/p\u003e\n\u003ch2 id=\"赏析\"\u003e\u003ca href=\"#赏析\" class=\"headerlink\" title=\"赏析\"\u003e\u003c/a\u003e赏析\u003c/h2\u003e\u003cblockquote\u003e\n\u003cp\u003e纤云弄巧，飞星传恨，银汉迢迢暗渡。\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003e上阙开头的第一句极其巧妙。\u003c/p\u003e\n\u003cp\u003e首先，牛郎织女是两颗星星。于是讲七夕的故事，肯定是晚上天空里的事情。写「纤云弄巧」，描写天上云彩的变化，就必须要「抬头看天」；写「飞星传恨」，描写一闪而逝的流星，就暗示了「夜晚」的场景。其次，牛郎织女一年一会，分开之后相会之前，肯定有数不尽的思绪要说，说不出来就变成恨。思绪万千就如同天上的云朵变换，思绪不得传达，就恨不得能如流星那样快点传达给对方。最后，「迢迢」和「暗渡」又体现了爱人相见之前的情绪。迢迢是「悄悄地」的意思：爱人相会自然是悄悄地私会，又要避开「王母」。暗渡中的「暗」字承接了「迢迢」悄悄的义项，「渡」字又承接「弄巧」、「传恨」，透出急迫的心情。\u003c/p\u003e\n\u003cp\u003e不过，上阙第一句巧妙有余，但其余不足。第一句仅仅是叙事，传达出的作者的情感态度却很少。若凭此就能成为七夕词之最，未免名不副实。我们接下来看第二句。\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003e金风玉露一相逢，便胜却人间无数。\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003e上阙第二句乃是一绝。这句没有七夕之哀愁，化恨为惜、化恨为喜。秋风秋露原本是平平一见的事物，但到了七夕这一天，在牛郎织女的眼里，那便是金风玉露。足以衬托出牛郎织女相见的不易。爱人之间，一年才能见一次，见到了难道不珍惜？悲了一年，难道不喜？如此难道不胜过人间万事？\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003e柔情似水，佳期如梦，忍顾鹊桥归路。\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003e下阙第一句写两人相见时互诉情深，其柔情似水，又写这短暂相会的「假期」如梦一样短暂，离开时不敢看鹊桥。这似乎又回到了悲恨交织的轨道了，看起来大煞风景。要知道，描写这种情绪，再怎么也妙不过「盈盈一水间，脉脉不得语」的画面感。但是，秦观在下一句却峰回路转、神来之笔，传唱天下。\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003e两情若是久长时，尤其在朝朝暮暮？\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003e人人都知道牛郎织女感情深，但这么多七夕诗词却摆脱不了怨憎的窠臼。整首词写牛郎织女：见前恨，见时喜，离别悲。而后在最后一句又看破离别苦恨难分难舍，讲「有情人不怕千山万水之隔」。这句饱含的感情至真至善，一举超越千万七夕诗词，传唱天下。\u003c/p\u003e\n\n    \u003c/div\u003e",
  "Date": "2019-03-03T07:50:32Z",
  "Author": "Liam Huang"
}