{
  "Source": "bou.ke",
  "Title": "How to automatically send RSS articles to Kindle",
  "Link": "https://bou.ke/blog/rss-to-kindle/",
  "Content": "\u003cdiv class=\"content\"\u003e\n\u003cdiv class=\"post\"\u003e\n  \u003ch1\u003eHow to automatically send RSS articles to Kindle\u003c/h1\u003e\n  \u003cp\u003eI really love my \u003ca href=\"https://amzn.to/2ritsr1\" target=\"_blank\"\u003eKindle Paperwhite\u003c/a\u003e and try to do as much of my reading on it as possible. One thing that was missing though is some blogs I enjoy reading, which I wanted to do on my Kindle too, and I wanted to automate it fully. There are some services available that offer exactly that, but I have figured out a way that leads to high-quality Kindle documents for free.\u003c/p\u003e\n\n\u003ch2 id=\"step-1-sign-up-for-instapaper\"\u003eStep 1: Sign up for Instapaper\u003c/h2\u003e\n\n\u003cp\u003eThe most high-quality way to submit articles to Kindle that I’ve found is \u003ca href=\"https://www.instapaper.com\" target=\"_blank\"\u003eInstapaper\u003c/a\u003e. Instapaper has been made completely free of charge since they were acquired by Pinterest, so just go ahead and sign up for it.\u003c/p\u003e\n\n\u003ch2 id=\"step-2-configure-the-kindle-integration\"\u003eStep 2: Configure the Kindle integration\u003c/h2\u003e\n\n\u003cp\u003eAfter signing up, go to \u003ca href=\"https://www.instapaper.com/user\" target=\"_blank\"\u003ethe settings page\u003c/a\u003e for Instapaper and scroll to ‘Kindle’ to connect your Instapaper account to your Kindle. Make sure to click on the \u003ccode class=\"language-plaintext highlighter-rouge\"\u003ewhat\u0026#39;s this?\u003c/code\u003e link and follow the instructions to make sure you can receive the documents sent by Instapaper. And enable automatic delivery.\u003c/p\u003e\n\n\u003cimg src=\"/images/instapaper.png\" alt=\"\" style=\"max-height: min(100vh, 688px)\" loading=\"lazy\"/\u003e\n\u003cp\u003eAs an added goodie, you should copy the Kindle Bookmarklet into your bookmarks, which is useful for any random articles on the web you might want to read on your Kindle.\u003c/p\u003e\n\n\u003ch2 id=\"step-3-sign-up-for-zapier\"\u003eStep 3: Sign up for Zapier\u003c/h2\u003e\n\n\u003cp\u003e\u003ca href=\"https://zapier.com/app/explore\" target=\"_blank\"\u003eZapier\u003c/a\u003e is a neat app that makes it possible to hook almost every web application into every other web application. This makes it possible to create integrations that normally wouldn’t exist. Create an account for it if you don’t have one already.\u003c/p\u003e\n\n\u003ch2 id=\"step-4-create-zap\"\u003eStep 4: Create Zap\u003c/h2\u003e\n\n\u003cp\u003eOpen up \u003ca href=\"https://zapier.com/app/editor/template/7474\" target=\"_blank\"\u003ethis Zap template\u003c/a\u003e and add it to your account, all you need to do is fill in the RSS feed address. Here I filled in the address for the excellent \u003ca href=\"https://waitbutwhy.com/\" target=\"_blank\"\u003eWait But Why\u003c/a\u003e blog.\u003c/p\u003e\n\n\u003cimg src=\"/images/zap.png\" alt=\"\" style=\"max-height: min(100vh, 529px)\" loading=\"lazy\"/\u003e\n\u003cp\u003eJust make sure to enable the Zap at the end of the set-up.\u003c/p\u003e\n\n\u003ch2 id=\"enjoy\"\u003eEnjoy!\u003c/h2\u003e\n\n\u003cp\u003eThat’s it! Enjoy receiving blog posts on your Kindle. If you have a premium Zapier account you could even augment your Zap and send yourself an email or something every time an article is added to Instapaper.\u003c/p\u003e\n\n  \u003cp\u003e\u003cspan class=\"date\"\u003eMay 2017\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e",
  "Date": "2017-05-01T00:00:00Z",
  "Author": "bou.ke"
}