{
  "Source": "bou.ke",
  "Title": "Books 2022",
  "Link": "https://bou.ke/blog/books-2022/",
  "Content": "\u003cdiv class=\"content\"\u003e\n\u003cdiv class=\"post\"\u003e\n  \u003ch1\u003eBooks 2022\u003c/h1\u003e\n  \u003cp\u003eLast year wasn’t the best for books for me—the first 3 months I didn’t finish any at all. In the end I did read a couple I enjoyed.\u003c/p\u003e\n\n\u003ch2 id=\"project-hail-mary\"\u003eProject Hail Mary\u003c/h2\u003e\n\n\u003cp\u003eAndy Weir got famous for writing \u003ca href=\"https://www.goodreads.com/book/show/18007564-the-martian\" target=\"_blank\"\u003eThe Martian\u003c/a\u003e—it was turned into a movie. I did not enjoy his second book (Artemis) at all, but with Project Hail Mary he’s totally back—it has everything that made The Martian great: lots of hard sci-fi, a visceral writing style and lots of action. I like that there’s not too many crazy things that are introduced—a couple little things that are sci-fi but not too many.\u003c/p\u003e\n\n\u003ch2 id=\"the-founders\"\u003eThe Founders\u003c/h2\u003e\n\n\u003cp\u003eAbout the history of PayPal, I was surprised to read that Confinity’s product was a way to send money over the Palm Pilot IR sensor (???) and that x.com was trying to be what Revolut and other Neobanks are doing right now—offering all the financial services but with a nice user experience.\u003c/p\u003e\n\n\u003cp\u003eI just wish the book went more into what happened to the less well-known people after PayPal e.g. Yelp and other companies were also founded by people from there but you don’t read much about those people.\u003c/p\u003e\n\n\u003ch2 id=\"sywerts-miljoenen\"\u003eSywerts Miljoenen\u003c/h2\u003e\n\n\u003cp\u003eAll right this one’s in Dutch but it’s a category I really love: books about white-collar criminals. Sywert van Lienden was a rising star in Dutch public life and leveraged his connections and clout to make millions during the Corona pandemic. The book is amazing investigative journalism and lays out how they lied and bluffed their way into getting a super lucrative deal from the government while pretending they were doing it for free.\u003c/p\u003e\n\n\u003cp\u003ePlease send any books my way that involve white-collar crime.\u003c/p\u003e\n\n  \u003cp\u003e\u003cspan class=\"date\"\u003eFeb 2023\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e",
  "Date": "2023-02-01T00:00:00Z",
  "Author": "bou.ke"
}