{
  "Source": "bou.ke",
  "Title": "Clubhouse",
  "Link": "https://bou.ke/blog/clubhouse/",
  "Content": "\u003cdiv class=\"content\"\u003e\n\u003cdiv class=\"post\"\u003e\n  \u003ch1\u003eClubhouse\u003c/h1\u003e\n  \u003cp\u003eI made an account and tried \u003ca href=\"https://www.joinclubhouse.com\" target=\"_blank\"\u003eClubhouse\u003c/a\u003e a little bit. The concept is that anyone can start a live ‘show’ where they chat, kind of like a live podcast except it’s not recorded. Anyone can drop-in and listen, and raise their hand to ask questions or contribute. The intriguing thing is that it’s all ephemeral—if you don’t catch the discussion live, you’re going to miss it forever.\u003c/p\u003e\n\n\u003cp\u003eUnfortunately it seems the app is completely overrun by productivity/hustle people, with many of the chats seeming to be about how to \u003cem\u003eHack Your Business to $1M in Revenue\u003c/em\u003e and bullshit like that. But I also hopped into a casual chat where people had a topic they were discussing and were asking ‘the audience’ (which was just 10 people at peak) if they had any stories they wanted to share. This felt very intimate, like you were on a group call with these people. I didn’t quite feel comfortable enough yet to join in, but I might in the future. It seems like a good way to make new connections with others.\u003c/p\u003e\n\n\u003cp\u003eMy first impression is that the app feels fun because there’s the allure of something exciting happening, if only you browse through enough rooms and listen into enough conversations. But right now I couldn’t actually find any of those conversations—maybe it was the time—and it seems the app is on the verge of being overrun with spammy topics. So hopefully they can avoid the wave of spam while also getting more interesting people onto the platform and fostering communities.\u003c/p\u003e\n\n\u003cp\u003eWhat kind of discussions is Clubhouse appropriate for? It is kind of in-between a private and public place. Some things that you’re comfortable talking about in private but not on a public social medium like Twitter might be appropriate on Clubhouse. Think money, religion, politics even. Things that are taboo at family dinners but you also don’t want recorded.\u003c/p\u003e\n\n  \u003cp\u003e\u003cspan class=\"date\"\u003eFeb 2021\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e",
  "Date": "2021-02-01T00:00:00Z",
  "Author": "bou.ke"
}