{
  "Source": "bou.ke",
  "Title": "Volunteering for the Informatics Olympiad",
  "Link": "https://bou.ke/blog/olympiad/",
  "Content": "\u003cdiv class=\"content\"\u003e\n\u003cdiv class=\"post\"\u003e\n  \u003ch1\u003eVolunteering for the Informatics Olympiad\u003c/h1\u003e\n  \u003cp\u003eIn high school \u003ca href=\"https://bou.ke/blog/ioi-2012/\" target=\"_blank\"\u003eI participated\u003c/a\u003e in the International Olympiad in Informatics, which had an incredible effect on my life: it made me get serious about programming, exposed me to people who were enthusiastic about software engineering and pulled me out of the boring desert that is school. Through people I met at the olympiad I also ended up getting a job at \u003ca href=\"https://www.shopify.com\" target=\"_blank\"\u003eShopify\u003c/a\u003e, which now has at least 25× as many people working there as when I started—and still growing rapidly 🤯. I ended up living in Ottawa for 3.5 years working at Shopify, meeting many fantastic people and making close friends. Needless to say, participating in the Informatics Olympiad had an enormous effect on my life.\u003c/p\u003e\n\n\u003ch2 id=\"what-can-participating-get-you\"\u003eWhat can participating get you?\u003c/h2\u003e\n\n\u003cp\u003eThe international round has about 80 countries participating, with 4 kids per country. After the two competition days everyone has a final score, and is stacked into a final ranking with 1/12th getting gold, 2/12th silver and 3/12th bronze. If I had to put some color into the doors this opens, I’d judge the value of these medals as follows:\u003c/p\u003e\n\n\u003col\u003e\n  \u003cli\u003e🥇 Gold gets you the red carpet treatment to basically any university or internship you want. Want to study at MIT all expenses paid? No problem. The people who get gold all become very successful academically or professionally.\u003c/li\u003e\n  \u003cli\u003e🥈 Silver will have many companies contact you to try and get you to intern with them, Google is well-known for going down the list of all gold and silver winners and reaching out to them to get the winners to do an internship with them.\u003c/li\u003e\n  \u003cli\u003e🥉 Bronze won’t have people knocking on your door to get you to work with them, but you will still be eligible for some scholarships—for example the \u003cem\u003eMichael and Ophelia Lazaridis Olympiad Scholarship\u003c/em\u003e which fully pays you to study at uWaterloo, one of the best universities for software engineering in the world.\u003c/li\u003e\n\u003c/ol\u003e\n\n\u003cp\u003eI didn’t end up going to university at all. With my bronze medal I could’ve studied at uWaterloo, which probably would’ve ended with me interning at Shopify anyways—funny to think about how that could’ve ended up.\u003c/p\u003e\n\n\u003ch2 id=\"paying-it-forward\"\u003ePaying it forward\u003c/h2\u003e\n\n\u003cp\u003eThe last couple of years I’ve gotten more involved in the olympiads again, this time as a volunteer coach and trainer instead of a participant. I’m working with the \u003ca href=\"https://www.informaticaolympiade.nl\" target=\"_blank\"\u003eDutch Informatics Olympiad\u003c/a\u003e, where I’m coaching Dutch high schoolers and helping organise our yearly algorithms training—think graph theory, data structures, some geometry. This has been very fun and fulfilling and it also gets me to some interesting places like Azerbaijan.\u003c/p\u003e\n\n\u003cfigure\u003e\n\n\u003cimg src=\"/images/azerbaijan.jpg\"/\u003e\n\n\u003cfigcaption\u003eSure, why not.\u003c/figcaption\u003e\n\u003c/figure\u003e\n\n\u003cp\u003eIn 2020 the IOI was remote, of course. It was supposed to be in Singapore, the organizers rose to the occasion and were able to create a good competition over the internet. It’s not the same for the kids, there’s not much of an opportunity for them to meet competitors from other countries. Hopefully we can have a real on-site competition in 2022 again!\u003c/p\u003e\n\n  \u003cp\u003e\u003cspan class=\"date\"\u003eMay 2021\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e",
  "Date": "2021-05-01T00:00:00Z",
  "Author": "bou.ke"
}