{
  "Source": "bou.ke",
  "Title": "Launching GizmoPack",
  "Link": "https://bou.ke/blog/gizmopack/",
  "Content": "\u003cdiv class=\"content\"\u003e\n\u003cdiv class=\"post\"\u003e\n  \u003ch1\u003eLaunching GizmoPack\u003c/h1\u003e\n  \u003cp\u003eOn May 11th I launched \u003ca href=\"https://gizmopack.app\" target=\"_blank\"\u003eGizmoPack\u003c/a\u003e for iPhone and iPad. GizmoPack is a utilities app for \u003ca href=\"https://apps.apple.com/us/app/shortcuts/id1462947752?l=en\" target=\"_blank\"\u003eShortcuts\u003c/a\u003e, an app that allows you to write little ‘programs’ that run on your phone. It allows you to connect various things on your phone with each other. Here’s an example of something you can do with my app:\u003c/p\u003e\n\n\u003cimg src=\"/images/shortcuts.png\" alt=\"\" style=\"max-height: min(100vh, 890px)\" loading=\"lazy\"/\u003e\n\u003cp\u003eThis shortcut uses the built-in action to fetch a CSV-file, followed by my ‘Query with SQL’ action to retrieve the most common last names of US legislators.\u003c/p\u003e\n\n\u003ch2 id=\"origin\"\u003eOrigin\u003c/h2\u003e\n\n\u003cp\u003eI was playing around with Shortcuts, when at some point I reached a wall—I realized I wanted to interpret some XML files (without resorting to regexes), and I was missing something akin to \u003ca href=\"https://github.com/junegunn/fzf\" target=\"_blank\"\u003efzf\u003c/a\u003e, which I use quite extensively on the command line. So I decided to take a stab at creating an \u003ca href=\"https://developer.apple.com/documentation/sirikit/creating_an_intents_app_extension\" target=\"_blank\"\u003eIntents Extension\u003c/a\u003e. With an Intents Extension you can extend the available actions by providing some with your app. Thankfully I spent some time at Shopify working on the mobile app—I was already familiar with Xcode and its quirks.\u003c/p\u003e\n\n\u003cp\u003eI started working on GizmoPack in early March, the week before everything started shutting down in Western Europe. I worked on it on and off for the next two months, before launching it in May. In that time I added 17 different actions to the app. Turns out being locked inside for two months leaves you with a lot of extra time.\u003c/p\u003e\n\n\u003ch2 id=\"pre-launch-woes\"\u003ePre-Launch Woes\u003c/h2\u003e\n\n\u003cp\u003eOn May 3rd \u003ca href=\"https://twitter.com/GizmoPack/status/1257004004128718854\" target=\"_blank\"\u003eI announced\u003c/a\u003e that I would be launching GizmoPack on May 11th, naively thinking it would be easy to just slap on an in-app purchase and get the app accepted by Apple. I proceeded to go through an incredibly annoying back-and-forth with App Store review, because my in-app purchase would work locally, but kept failing for the reviewer. I begged the reviewer to please provide me with some logs or any kind of information to go on, but they only provided me with the copy and pasted reply that my app failed.\u003c/p\u003e\n\n\u003cimg src=\"/images/iap-review.png\" alt=\"\" style=\"max-height: min(100vh, 293px)\" loading=\"lazy\"/\u003e\n\u003cp\u003eI ended up filing a \u003ca href=\"https://developer.apple.com/support/technical/\" target=\"_blank\"\u003eTechnical Support Incident\u003c/a\u003e which ended up being pretty great. I described my issue, and the support engineer provided me with an immediate solution. The problem in the end was that I attached the \u003ca href=\"https://developer.apple.com/documentation/storekit/in-app_purchase/setting_up_the_transaction_observer_for_the_payment_queue\" target=\"_blank\"\u003eTransaction Observer\u003c/a\u003e in the wrong location, doing it in a static variable instead of in the \u003ccode class=\"language-plaintext highlighter-rouge\"\u003edidFinishLaunching\u003c/code\u003e method. This caused StoreKit to get into a weird state where all transactions would fail—but only while reviewing of course, never locally. In the end I came out disappointed with the App Store review process, but pleasantly surprised with the Technical Support engineer. Only thing to note is that you have two TSIs included with you Apple Developer subscription, after which they cost $50 per incident. This seems easily worth it if you’re running into a blocker before a launch.\u003c/p\u003e\n\n\u003ch3 id=\"screenshots-and-press-material\"\u003eScreenshots and Press Material\u003c/h3\u003e\n\n\u003cp\u003eCreating all the screenshots and stuff was a total pain in the ass. Having an app that has essentially no UI didn’t help either. In the end I used \u003ca href=\"https://fastlane.tools\" target=\"_blank\"\u003efastlane\u003c/a\u003e to automatically set up simulators and take screenshots. I also \u003ca href=\"https://github.com/fastlane/fastlane/pull/16419\" target=\"_blank\"\u003econtributed\u003c/a\u003e to add a built-in config option to reset the status bar to show \u003ca href=\"https://www.inc.com/minda-zetlin/apple-products-time-941-photos-jon-manning-scott-forstall-steve-jobs.html\" target=\"_blank\"\u003e9:41\u003c/a\u003e and full reception. In the end I’m not that happy with the shots, but I’m not sure it matters too much. I doubt there’s a lot of people who randomly stumble on my app, reckon it’s mostly people who read about it somewhere and know what they’re getting into. My app just doesn’t have that much of a visual component right now so it’s hard to come up with some good screenshots.\u003c/p\u003e\n\n\u003ch2 id=\"launching\"\u003eLaunching\u003c/h2\u003e\n\n\u003cp\u003eWhen I said earlier that I launched on May 11th, I kinda lied. I sneakily uploaded the app onto the App Store on Saturday May 9th, just to make sure that everything went according to plan, and then didn’t announce it until Monday. The launch went smoothly, only one minor bug came up, which was that a custom icon I added last-minute didn’t work on iPad. Otherwise it was smooth sailing.\u003c/p\u003e\n\n\u003ch2 id=\"how-did-it-do\"\u003eHow did it do?\u003c/h2\u003e\n\n\u003cp\u003eOn the first day of release, I got a total of 893 downloads and 94 purchases, which I’m very happy with! I’m quite happy with how the app performed, although the interest dropped quite quickly. Right now I think the app has quite a niche appeal, since a lot of the actions I’m adding are only for power users—you basically need programming experience to figure out a use case for them. Which brings me to the next topic!\u003c/p\u003e\n\n\u003ch2 id=\"future-things\"\u003eFuture things\u003c/h2\u003e\n\n\u003cp\u003eThis year I watched \u003ca href=\"/blog/wwdc-2020/\"\u003eWWDC\u003c/a\u003e closely, trying to pick out anything they announced which I could integrate into my app. The biggest announcement was widgets, which I’m working to add support for in GizmoPack.\u003c/p\u003e\n\n\u003ciframe id=\"twitter-widget-0\" scrolling=\"no\" frameborder=\"0\" allowtransparency=\"true\" allowfullscreen=\"true\" style=\"position: static; visibility: visible; max-width: 100%; width: 550px; display: block; flex-grow: 1;\" src=\"https://platform.twitter.com/embed/index.html?dnt=true\u0026amp;embedId=twitter-widget-0\u0026amp;frame=false\u0026amp;hideCard=false\u0026amp;hideThread=false\u0026amp;id=1281308899933552640\u0026amp;lang=en\u0026amp;theme=light\"\u003e\u003c/iframe\u003e\n\n\u003cp\u003eWith this new feature it’ll be possible for anyone to create their own homescreen widgets powered by Shortcuts. I can’t wait to see what people build with it.\u003c/p\u003e\n\n\u003ch2 id=\"thanks\"\u003eThanks\u003c/h2\u003e\n\n\u003cp\u003eThanks to \u003ca href=\"https://twitter.com/mralexhay\" target=\"_blank\"\u003eAlex\u003c/a\u003e for inspiring me with Toolbox Pro, and to \u003ca href=\"https://twitter.com/rodrigoaraujo\" target=\"_blank\"\u003eRodrigo\u003c/a\u003e for talking me down when I was about to send an \u003cem\u003eimpolite\u003c/em\u003e email to Apple.\u003c/p\u003e\n\n  \u003cp\u003e\u003cspan class=\"date\"\u003eJul 2020\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e",
  "Date": "2020-07-01T00:00:00Z",
  "Author": "bou.ke"
}