{
  "Source": "bou.ke",
  "Title": "Reflecting on 2018",
  "Link": "https://bou.ke/blog/2018/",
  "Content": "\u003cdiv class=\"content\"\u003e\n\u003cdiv class=\"post\"\u003e\n  \u003ch1\u003eReflecting on 2018\u003c/h1\u003e\n  \u003cp\u003e2018 was a year where I continued making some big changes in my life. I started the year in Berlin, where I was working at the time. I quit that job and Berlin in March, embarking on a couple months of travel.\u003c/p\u003e\n\n\u003cimg src=\"/images/bundestag.jpg\" alt=\"\" style=\"max-height: min(100vh, 400px)\" loading=\"lazy\"/\u003e\n\u003cp\u003eIn October I started a new job at DigitalOcean, which has been great so far. The best perk is being able to work remotely. It means I can live in the Netherlands, work on bigger projects, in the field I’m interested in, with great people. Finding a job that combines all these things would be almost impossible here, but remote work makes it possible. Starting January I’ll also have my own apartment again. This means that after almost two years of temporary living arrangements I’ll finally have a permanent place once more. I’m looking forward to have a bit of stability in my life for a change, instead of constantly thinking about where I’ll be sleeping one week from now.\u003c/p\u003e\n\n\u003ch2 id=\"travel\"\u003eTravel\u003c/h2\u003e\n\n\u003cp\u003eI was in 17 different countries this year, including work and vacation trips.\u003c/p\u003e\n\n\u003col\u003e\n  \u003cli\u003eBelgium\u003c/li\u003e\n  \u003cli\u003eCambodia\u003c/li\u003e\n  \u003cli\u003eCanada\u003c/li\u003e\n  \u003cli\u003eCzechia\u003c/li\u003e\n  \u003cli\u003eFrance\u003c/li\u003e\n  \u003cli\u003eGermany\u003c/li\u003e\n  \u003cli\u003eHong Kong\u003c/li\u003e\n  \u003cli\u003eIreland\u003c/li\u003e\n  \u003cli\u003eKenya\u003c/li\u003e\n  \u003cli\u003eMyanmar\u003c/li\u003e\n  \u003cli\u003eNetherlands\u003c/li\u003e\n  \u003cli\u003ePortugal\u003c/li\u003e\n  \u003cli\u003eRwanda\u003c/li\u003e\n  \u003cli\u003eSingapore\u003c/li\u003e\n  \u003cli\u003eThailand\u003c/li\u003e\n  \u003cli\u003eUSA\u003c/li\u003e\n  \u003cli\u003eVietnam\u003c/li\u003e\n\u003c/ol\u003e\n\n\u003cimg src=\"/images/road.jpg\" alt=\"\" style=\"max-height: min(100vh, 400px)\" loading=\"lazy\"/\u003e\n\u003cp\u003eThis was quite a lot for one year. Not something I’ll surpass for a long time, if ever. Taking half a year off work to bum around and enjoy myself was a great idea, and I recommend it to those that have the means to do so. It puts you into a very different mindset, where all you’re thinking about is what you’re going to do that day. Are there any cool things to see in the area? What foods do I want to try out today? Where will I go tomorrow, and where will I sleep?\u003c/p\u003e\n\n\u003cimg src=\"/images/train.jpg\" alt=\"\" style=\"max-height: min(100vh, 400px)\" loading=\"lazy\"/\u003e\n\u003cp\u003eIt was fun while it lasted, although I do think I burned out a little from visiting so many places after each other. For my next sabbatical I could see myself going to a place like Thailand again and spending a couple months there to get better at Muay Thai or whatever, instead of spending a couple weeks here and there.\u003c/p\u003e\n\n\u003cp\u003eBeing a digital nomad is something I’ve seen some people do, but I don’t think I would want to, not on my own at least. I’ve already found it hard to live and work in three different countries in two years, and increasing the pace of moving wouldn’t make that any better. I do intend to take advantage of remote work and spend a couple weeks or a month in a different country once or twice a year and work from there, but for now I’m very happy to have a home in the Netherlands.\u003c/p\u003e\n\n\u003ch2 id=\"work\"\u003eWork\u003c/h2\u003e\n\n\u003cp\u003eRight now at DigitalOcean I’m working on the Kubernetes team, where we are working on making it as easy as possible for people to set up a cluster. I’ve been realizing that Kubernetes is not the answer for most people. A new developer needs to learn an insane number of different concepts just to be able to deploy an application ‘properly’ these days. It used to be the case that you chucked some PHP files onto a server over FTP and that was it, these days you first need to understand Docker and Kubernetes and write YAML files and do all these crazy things for the simplest project. We can do better, not by creating Yet Another new tool but by simplifying things.\u003c/p\u003e\n\n\u003ch2 id=\"fitness\"\u003eFitness\u003c/h2\u003e\n\n\u003cp\u003e2018 has not been a very good year for my fitness. Moving around and traveling a lot is not good for building up a habit, which is what you need to get good at physical exercise. I am going to get back into the habit of going to the gym 3x a week again to regain some strength, I hope to do yoga more often to improve my posture and flexibility, and I’m planning some long-distance cycling trips within Europe this year. A lot of ambitions, so let’s hope I can realize most of them.\u003c/p\u003e\n\n\u003ch2 id=\"reading\"\u003eReading\u003c/h2\u003e\n\n\u003cp\u003eIt was another productive year for reading. For this year I’ll recommend three books that I enjoyed this year and I think you would enjoy too.\u003c/p\u003e\n\n\u003ch3 id=\"countdown-to-zero-day\"\u003e\u003ca href=\"https://www.goodreads.com/book/show/23546276-countdown-to-zero-day\" target=\"_blank\"\u003eCountdown to Zero Day\u003c/a\u003e\u003c/h3\u003e\n\n\u003cimg src=\"/images/books/2018/ctzd.png\" class=\"cover\"/\u003e\n\u003cp\u003eThrilling book, with a lot of terrifying information about the Iran nuclear program, and the ‘cyber’ capabilities of the US and Israel. It also includes a lot of examples of how poorly secured a lot of infrastructure is in the US. It is surprising that no major hacks of power plants and things like that have happened yet. The book reads like a spy novel!\u003c/p\u003e\n\n\u003ch3 id=\"factfulness\"\u003e\u003ca href=\"https://www.goodreads.com/book/show/36185940-factfulness\" target=\"_blank\"\u003eFactfulness\u003c/a\u003e\u003c/h3\u003e\n\n\u003cimg src=\"/images/books/2018/fact.png\" class=\"cover\"/\u003e\n\u003cp\u003eThis book was very popular this year and for good reasons. I’ve gotten more interested in effective altruism, economic development, and standards of living this year, and this book fits that topic nicely.\u003c/p\u003e\n\n\u003cp\u003eIt encourages you to look at ‘the rest of the world’ in a fact-based manner, and to depart from such knee jerk falsities as ‘Africa is bad, has always been and will always be’ when in fact a lot of progress is happening. It is also no longer true that there is such a thing as ‘the west’ and ‘the rest’, instead the countries of the world are now on a scale. We need to acknowledge that things can be bad and getting better at the same time, and look at the world as it is to determine what we can do to make it better.\u003c/p\u003e\n\n\u003ch3 id=\"the-three-body-problem\"\u003e\u003ca href=\"https://www.goodreads.com/book/show/18245960-the-three-body-problem\" target=\"_blank\"\u003eThe Three-Body Problem\u003c/a\u003e\u003c/h3\u003e\n\n\u003cimg src=\"/images/books/2018/three.png\" class=\"cover\"/\u003e\n\u003cp\u003eScience-fiction books are interesting because they allow the writer to paint worlds and invent technologies using things that don’t exist (yet). The reason I found this book so compelling is that it introduces a number of different crazy ideas that I haven’t seen used anywhere else. This is the first time I’ve read a book that is authored in Chinese, something which I suspect will happen more often over the coming decades as China gets richer and more of its culture flows out to the rest of the world.\u003c/p\u003e\n\n\u003cp\u003eSomething I’ve noticed in this book and The Expanse series is that science fiction lends itself well to shifts in the stage on which the story plays. A science fiction series can take place on earth in the first book, the solar system the second, the galaxy the third, and another dimension in the fourth one no problem. This is because the author can travel through space and time without technical reasons tying him down to a certain place.\u003c/p\u003e\n\n\u003ch2 id=\"conclusion\"\u003eConclusion\u003c/h2\u003e\n\n\u003cp\u003eI’m looking forward to 2019. I think it’ll be a good year where I can get back into the stability of routine and everyday life.\u003c/p\u003e\n\n\u003cstyle\u003e\nimg.cover { max-height: 200px; float: left; padding: 0.5em 1em 0.5em 0; }\n\u003c/style\u003e\n\n\n  \u003cp\u003e\u003cspan class=\"date\"\u003eDec 2018\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e",
  "Date": "2018-12-01T00:00:00Z",
  "Author": "bou.ke"
}