{
  "Source": "bou.ke",
  "Title": "Quote Books",
  "Link": "https://bou.ke/blog/quote-books/",
  "Content": "\u003cdiv class=\"content\"\u003e\n\u003cdiv class=\"post\"\u003e\n  \u003ch1\u003eQuote Books\u003c/h1\u003e\n  \u003cp\u003eThere’s a trope in literature of \u003cem\u003eQuote Books\u003c/em\u003e — books that simply aggregate mildly inspiring stories from the past and use them to construct a new book. The format is something like this:\u003c/p\u003e\n\n\u003cblockquote\u003e\n  \u003cp\u003eSuccessful emperor Augustus always got up at 5am every morning and went on a walk. He loved walks. So did Winston Churchill. Therefore you should also go on a walk every morning to truly be successful.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003eThis is of course a bunch of nonsense. You can’t just take one aspect of someone’s life, magnify it, and conclude that this is why this person was great and we should all follow their example. There are some authors who have built a whole career on compiling quotes from people who actually did things into books, like \u003ca href=\"https://twitter.com/RyanHoliday\" target=\"_blank\"\u003eRyan Holiday\u003c/a\u003e (note that his Twitter is literally just a bunch of quotes).\u003c/p\u003e\n\n\u003cp\u003eWhy does this matter? It’s just so bland and unoriginal.  It’s better to go to the source of things and actually read the things people are saying in their own context instead of this aggregation layer that tries to just ‘pick out the best parts’ of different people’s lives to try and create something meaningful. This is also why a service like \u003ca href=\"https://www.blinkist.com\" target=\"_blank\"\u003eBlinkist\u003c/a\u003e is aesthetically appalling—the idea that you can somehow extract the meaningful juices out of a book by squeezing it. For English class in High School I had to read a lot of books, but because I was lazy I only read the summaries and used those to get a passing grade. I can guarantee you that those books did not ‘stick’ with me. Then again the non-fiction books Blinkist is summarizing probably have not much to say in the first place—being Quote Books themselves.\u003c/p\u003e\n\n\u003cp\u003eI am of course not the first to have this thought, I’m just a quoting ideas from others myself, like a post about the \u003ca href=\"https://99u.adobe.com/articles/55974/the-creative-worlds-bullshit-industrial-complex\" target=\"_blank\"\u003eBullshit Industrial Complex\u003c/a\u003e I read the other day. Maybe I should write a Quote Book myself, aggregating Quote Books into a meta Quote Book that tells you how to live your life by looking at the lives of Quote Book authors. Then you too, my reader, can be a successful Quote Book author.\u003c/p\u003e\n\n  \u003cp\u003e\u003cspan class=\"date\"\u003eFeb 2021\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e",
  "Date": "2021-02-01T00:00:00Z",
  "Author": "bou.ke"
}