{
  "Source": "bou.ke",
  "Title": "My favorite books of 2017",
  "Link": "https://bou.ke/blog/books-2017/",
  "Content": "\u003cdiv class=\"content\"\u003e\n\u003cdiv class=\"post\"\u003e\n  \u003ch1\u003eMy favorite books of 2017\u003c/h1\u003e\n  \u003cp\u003eI read a lot of books this year. A gobsmacking amount of books. So much in fact, that I more than doubled my original aim of reading 25 books and am currently (with two weeks to go in the year) at about 55 read in total. This year I was more deliberate in tracking the books I read in \u003ca href=\"https://www.goodreads.com\" target=\"_blank\"\u003eGoodreads\u003c/a\u003e and tried to write reviews for most, not only to help my friends in their decision about which to start on, but also so I can leaf through my past reviews and remember what the books were about.\u003c/p\u003e\n\n\u003cp\u003eSo without further ado, here is a selection of some of my favorite books of 2017.\u003c/p\u003e\n\n\u003ch2 id=\"life-30-by-max-tegmark\"\u003eLife 3.0 by Max Tegmark\u003c/h2\u003e\n\n\u003cimg src=\"/images/books/life-3.png\" alt=\"\" style=\"max-height: min(100vh, 236px)\" loading=\"lazy\"/\u003e\n\u003cp\u003e\u003cem\u003eLife 3.0\u003c/em\u003e, despite the terrible title, is a very thorough book about the last invention humanity will make: human-level artificial intelligence. AI has enormous potential ramifications and this book very clearly goes through all of them, this book explains what AI is and how it will be built, and what the benefits to risks are to humanity. It’s written by someone with a lot of involvement in the field, and ends with a solid philosophical exploration of what intelligence and consciousness are.\u003c/p\u003e\n\n\u003ch2 id=\"het-achterhuis-by-anne-frank\"\u003eHet Achterhuis by Anne Frank\u003c/h2\u003e\n\n\u003cimg src=\"/images/books/het-achterhuis.png\" alt=\"\" style=\"max-height: min(100vh, 237px)\" loading=\"lazy\"/\u003e\n\u003cp\u003eI try to read Dutch books every now and then, and the one at the top of my list for this year was \u003cem\u003eHet Achterhuis\u003c/em\u003e, the diary of Anne Frank.\u003c/p\u003e\n\n\u003cp\u003eThe book is required reading for anyone. The despair you feel as you read the happy parts of her diary, while knowing her imminent demise, is hard to describe. Her thoughts and feelings as a young girl were also interesting to read.\u003c/p\u003e\n\n\u003ch2 id=\"nausea-by-jean-paul-sarte\"\u003eNausea by Jean-Paul Sarte\u003c/h2\u003e\n\n\u003cimg src=\"/images/books/nausea.png\" alt=\"\" style=\"max-height: min(100vh, 237px)\" loading=\"lazy\"/\u003e\n\u003cp\u003e\u003cem\u003eNausea\u003c/em\u003e is my favorite book by a philosopher of the year, and highly recommended for anyone who wants to get into existential philosophy. It’s about a person who ‘wakes up’ from the daily routine and becomes disgusted by himself and everyone around him. Sartre portrays normal human life and behavior in such a disgustingly accurate way that you are guaranteed to be left with a sense of discomfort after reading this book. I actually had to put it down a couple times while reading because it made me so uncomfortable, but that is a testament to the writing of Sartre.\u003c/p\u003e\n\n\u003ch2 id=\"irresistible-by-adam-alter\"\u003eIrresistible by Adam Alter\u003c/h2\u003e\n\n\u003cimg src=\"/images/books/irresistible.png\" alt=\"\" style=\"max-height: min(100vh, 237px)\" loading=\"lazy\"/\u003e\n\u003cp\u003eI’ve been thinking a lot about internet addiction over the past year. There is a hidden societal cost on our population’s obsession with smartphones and social media, that is not talked about and poorly understood. This book explores behavioural addiction, how it compares to previous addictions (like substance addiction) and what causes it. There’s a good mix of research and anecdotes in this book, and the book is very easy to devour in a couple days.\u003c/p\u003e\n\n\u003cp\u003eI think there’s going to be a lot more discussion in the next couple years about the mass addiction to likes and shares, and this book prepares you fairly well on the subject. I’ll be exploring it more, and hoping to create systems or apps to make sure I don’t get sucked into the hole of social media/video games/VR/whatever people come up with next.\u003c/p\u003e\n\n\u003ch2 id=\"a-man-for-all-markets-by-edward-o-thorp\"\u003eA Man for All Markets by Edward O. Thorp\u003c/h2\u003e\n\n\u003cimg src=\"/images/books/thorp.png\" alt=\"\" style=\"max-height: min(100vh, 200px)\" loading=\"lazy\"/\u003e\n\u003cp\u003eEdward Thorp was a hacker \u003ca href=\"https://www.youtube.com/watch?v=GD6TD1v17eM\" target=\"_blank\"\u003eavant la lettre\u003c/a\u003e. He pioneered various techniques for beating the house in casinos, including the first ‘wearable’ device to predict where a ball will land in a roulette game, and is the inventor of card counting for Black Jack. He later became really wealthy by being the first of what we now consider a ‘quant’ on Wall Street. Just a really enjoyable book of someone who did a lot of interesting things in their life.\u003c/p\u003e\n\n\u003ch2 id=\"sapiens--homo-deus-by-yuval-noah-harrari\"\u003eSapiens \u0026amp; Homo Deus by Yuval Noah Harrari\u003c/h2\u003e\n\n\u003cp\u003eThese two books go hand-in-hand, and were a nice addition to my favorite book of last year, \u003cem\u003eGuns Germs and Steel\u003c/em\u003e. Both are written by the same author, and \u003cem\u003eHomo Deus\u003c/em\u003e is kind of a sequel to \u003cem\u003eSapiens\u003c/em\u003e which is why I grouped them together.\u003c/p\u003e\n\n\u003ch3 id=\"sapiens\"\u003eSapiens\u003c/h3\u003e\n\n\u003cimg src=\"/images/books/sapiens.png\" alt=\"\" style=\"max-height: min(100vh, 237px)\" loading=\"lazy\"/\u003e\n\u003cp\u003eWonderful exploration of the history and evolution of Homo Sapiens. It is essentially a whirl-wind tour through the history of humanity, by analysing how we came to be in this situation. What gave rise to kings and nations? Are we better off in cities than we were as hunter-gatherers? If not, why did our ancestors form cities? Recommended for anyone interested in history, biology, anthropology, humans.\u003c/p\u003e\n\n\u003ch3 id=\"homo-deus\"\u003eHomo Deus\u003c/h3\u003e\n\n\u003cimg src=\"/images/books/homo-deus.png\" alt=\"\" style=\"max-height: min(100vh, 237px)\" loading=\"lazy\"/\u003e\n\u003cp\u003eFantastic book about the current state and future of humanity. Very balanced in that it’s not just like ‘we’re all going to die!’ Or ‘we will be in nanospacemachineAIelectricfuture soon!’ But rather explores what the consequences would be of a future without jobs, what it would do to the worth of a human. The book explores what humanism is and what comes next. Humanism is our current doctrine in which we believe that our human feelings and emotions should be our guiding principle. Humanism replaced religion in a lot of ways, replacing the word of god with doing what ‘feels right’. The writer foresees that we are replacing humanism with ‘data-ism’, which is a utilitarian approach that puts trust in the mysterious decree of an algorithm, telling us to follow it because it is empirically right, and knows more about us and everything else than we could ever do.\u003c/p\u003e\n\n\u003ch2 id=\"designing-data-intensive-applications-by-martin-kleppman\"\u003eDesigning Data-Intensive Applications by Martin Kleppman\u003c/h2\u003e\n\n\u003cimg src=\"/images/books/data-intensive.png\" alt=\"\" style=\"max-height: min(100vh, 208px)\" loading=\"lazy\"/\u003e\n\u003cp\u003eAnd now for something completely different: an educational O’Reilly book!\u003c/p\u003e\n\n\u003cp\u003eThis book is incredibly useful if you spend time engineering software systems that process data (AKA all systems). In my career at Shopify I’ve spent time as a Data Engineer working on Hadoop/Spark batch processing systems, on the ‘Merchant Analytics’ team working on a stream processing and real-time analytics database, and as an application developer working on standard Rails apps. Having this book available to me would’ve been incredibly useful, and it contains many many lessons I’ve learned over the past couple of years, but written down in a way that’s way clearer than I could ever formulate it.\u003c/p\u003e\n\n\u003cp\u003eIt will be useful as a reference for years to come.\u003c/p\u003e\n\n\u003ch2 id=\"conclusion\"\u003eConclusion\u003c/h2\u003e\n\n\u003cp\u003eI hope this post added something to your reading list! If you want to follow my reading progress, or have a book to recommend to me, \u003ca href=\"https://www.goodreads.com/user/show/26517939-bouke\" target=\"_blank\"\u003eadd me on Goodreads\u003c/a\u003e!\u003c/p\u003e\n\n\u003cstyle\u003e\nimg { max-height: 200px; float: left; padding: 0.5em 1em 0.5em 0; }\n\u003c/style\u003e\n\n\n  \u003cp\u003e\u003cspan class=\"date\"\u003eDec 2017\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e",
  "Date": "2017-12-01T00:00:00Z",
  "Author": "bou.ke"
}