{
  "Source": "bou.ke",
  "Title": "2021",
  "Link": "https://bou.ke/blog/2021/",
  "Content": "\u003cdiv class=\"content\"\u003e\n\u003cdiv class=\"post\"\u003e\n  \u003ch1\u003e2021\u003c/h1\u003e\n  \u003cimg src=\"/images/view.jpg\" alt=\"\" style=\"max-height: min(100vh, 756px)\" loading=\"lazy\"/\u003e\n\u003cp\u003eThis year has been one with quite a lot of changes again: I’ve moved to Amsterdam, a city I’ve wanted to live in for a long time. The last couple of years I’ve tried to keep a daily diary, which I keep up with a \u003ca href=\"https://support.apple.com/en-us/HT209055\" target=\"_blank\"\u003eShortcut\u003c/a\u003e that I run. The shortcut populates a text file with the date and my current location and then I can just start typing.\u003c/p\u003e\n\n\u003cp\u003eSearching through my old diary entries I found that I wrote multiple times about my desire for living in Amsterdam over the years, so I’m happy I finally made the jump. I also bought a home for the first time—which is where my \u003ca href=\"/blog/formulas/\"\u003eformulas\u003c/a\u003e blogpost came from. Buying a home in Amsterdam was quite stressful, I got to view my apartment for about 10 minutes, immediately called my real estate agent and the deal was done by the end of the day. If you wait longer than that you don’t have a  chance.\u003c/p\u003e\n\n\u003cp\u003eOwning a home is quite different from renting one. All of a sudden every little dent in the wall and smudge on the ceiling is your own problem, you don’t have a landlord that you can hold  responsible. There is a fun side to it too because you can have a lot of ‘projects’ that you can take on to improve your home but at the same time it can be a little overwhelming. When you visit other people’s houses you only see the good parts but when it’s your own, you only see the flaws. Overall I’m satisfied with my decision—the place I bought did not need a lot of work and all the big tasks I’ve completed. I also picked up some new practical skills, I installed pot lights into the ceiling for example because getting a contractor would’ve been crazy expensive.\u003c/p\u003e\n\n\u003ch2 id=\"books\"\u003eBooks\u003c/h2\u003e\n\n\u003cp\u003eThis year was \u003cem\u003eokay\u003c/em\u003e for reading books, I had a bit of trouble finding books that grabbed me, with a couple that I started and put down because I didn’t enjoy them. Then at the end of the year my reading slowed down a bit because of other distractions e.g. buying and furnishing a home. These books did stick out for me:\u003c/p\u003e\n\n\u003ch3 id=\"nassim-talebs-books\"\u003eNassim Taleb’s books\u003c/h3\u003e\n\n\u003cp\u003eI read \u003cem\u003eFooled by Randomness\u003c/em\u003e, \u003cem\u003eThe Black Swan\u003c/em\u003e, \u003cem\u003eSkin in the Game\u003c/em\u003e and \u003cem\u003eAntifragile\u003c/em\u003e one after another this year. These books are highly enjoyable on one hand because they bring you some insights into how the world works and useful mental models to navigate it, but mostly because Nassim Taleb’s writing style oozes an attitude of \u003cem\u003e“Why is everyone so stupid except me?”\u003c/em\u003e. To get a bit of an idea of what this man is like, you should read this \u003ca href=\"https://www.theguardian.com/books/2012/nov/24/nassim-taleb-antifragile-finance-interview\" target=\"_blank\"\u003ehilarious interview from The Guardian\u003c/a\u003e.\u003c/p\u003e\n\n\u003cblockquote\u003e\n  \u003cp\u003eBut then, having read his latest book, I actually know an awful lot about his diet. How he doesn’t eat sugar, any fruits which “don’t have a Greek or Hebrew name” or any liquid which is less than 1,000 years old. Just as I know that he doesn’t like air-conditioning, soccer moms, sunscreen and copy editors. That he believes the “non-natural” has to prove its harmlessness. That America tranquillises its children with drugs and pathologises sadness. That he values honour above all things, banging on about it so much that at times he comes across as a medieval knight who’s got lost somewhere in the space-time continuum. And that several times a week he goes and lifts weights in a basement gym with a bunch of doormen.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003ch3 id=\"de-architecten-van-asml\"\u003eDe architecten van ASML\u003c/h3\u003e\n\n\u003cp\u003eThis one I read in Dutch, in English it’s called \u003cem\u003eASML’s architects\u003c/em\u003e. It’s a very detailed history book on ASML, the Dutch company that produces the most advanced lithography machines in the world, which are used in factories that manufacture microchips. It’s an incredible book because it combines in-depth technical details on the innovations that made the company possible with intriguing backgrounds on the characters that made it all happen and the business deals that ensured the company stayed afloat.\u003c/p\u003e\n\n\u003cp\u003eIt’s interesting to learn that one of the hardest things with making these chips is alignment: you have to etch multiple layers onto the ‘die’—you can see it as having to print multiple colors one by one onto a piece of paper. If there’s a little bit of error it’s fine, but if the offset is too great then the picture doesn’t make sense any more. One of ASML’s innovations was their alignment table: the device that moves the projection surface on the X and Y-axis. Theirs was much more precise, which allowed more details to be created.\u003c/p\u003e\n\n\u003ch2 id=\"travel--covid\"\u003eTravel \u0026amp; COVID\u003c/h2\u003e\n\n\u003cp\u003eThis year I traveled less than in past years again, as expected. I did not leave Europe for the first time in at least 10 years, but that doesn’t mean I did not have some great trips—I spent three weeks on holiday in various regions of France doing hiking and windsurfing (highly recommend!) and also went on an extended weekend to Italy.\u003c/p\u003e\n\n\u003cimg src=\"/images/lago.jpg\" alt=\"\" style=\"max-height: min(100vh, 756px)\" loading=\"lazy\"/\u003e\n\u003cp\u003eTowards the end of the year after I got my second vaccination I was feeling quite hopeful that—for the rich countries—the COVID pandemic would be basically over.\u003c/p\u003e\n\n\u003cimg src=\"/images/rona.png\" alt=\"\" style=\"max-height: min(100vh, 420px)\" loading=\"lazy\"/\u003e\n\u003cp\u003eThat was—\u003cem\u003eis\u003c/em\u003e—not the case obviously. The case count is still peaking higher every week and the ceiling is not yet in sight. I do think that things will keep getting better. Unless deadlier variants start emerging the pandemic will be quite manageable—in Europe—going forward. This also means I’ll go on some more trips again, although I expect I’ll keep to European countries for now. I will also make the prediction that the current lockdown I’m in will be my last, but I’ll give that only 75% confidence.\u003c/p\u003e\n\n\u003ch2 id=\"hobby\"\u003eHobby\u003c/h2\u003e\n\n\u003cp\u003eI picked up a new hobby: improvisational theatre. The format is quite similar to the show \u003cem\u003eWhose line is it anyways\u003c/em\u003e where we have a guide that gives us topics and scene formats and we take turns doing scenes. It’s something I’ve wanted to do for a while as a way to meet people and as a fun activity. And it’s been great! It’s the perfect counterpart to my job, which involves a lot of deep thought and planning. With improv you need to ‘get out of your head’ as much as possible and mostly react to what the other people are doing. If you try to ‘plan ahead’ what you want to happen in the scene you will start thinking too much and stall. If this sounds great, I’d recommend you participate in an introductory workshop some time.\u003c/p\u003e\n\n\u003ch2 id=\"2022\"\u003e2022\u003c/h2\u003e\n\n\u003cp\u003eI’m feeling more optimistic than I was \u003ca href=\"/blog/2020/\"\u003elast year\u003c/a\u003e. The height of my optimism was after I received my first vaccination, which truly felt liberating. In that moment I thought the whole pandemic would be over soon which was \u003cem\u003etoo\u003c/em\u003e optimistic but 2022 will be better than the years before. It’s becoming easier to make plans again without fearing they will be yanked at the last moment. Good days are ahead!\u003c/p\u003e\n\n  \u003cp\u003e\u003cspan class=\"date\"\u003eDec 2021\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e",
  "Date": "2021-12-01T00:00:00Z",
  "Author": "bou.ke"
}