{
  "Source": "bou.ke",
  "Title": "My road to the International Olympiad in Informatics 2012",
  "Link": "https://bou.ke/blog/ioi-2012/",
  "Content": "\u003cdiv class=\"content\"\u003e\n\u003cdiv class=\"post\"\u003e\n  \u003ch1\u003eMy road to the International Olympiad in Informatics 2012\u003c/h1\u003e\n  \u003cp\u003eMy name is Bouke van der Bijl, a 17 year old Dutch computer enthusiast. In the coming september I will be participating in the International Olympiad in Informatics. This is how I qualified.\u003c/p\u003e\n\u003cp\u003eAt my school everyone is encouraged to participate in the Dutch Mathematics Olympiad and like every year, I joined and this year I happened to make it to the second round. It was there that I found a brochure that portrayed all the Dutch Olympiads, including the Informatics one. The \u003ca href=\"http://www.informaticaolympiade.nl/\" target=\"_blank\"\u003eNederlandse Informatica Olympiade\u003c/a\u003e or NIO has three rounds: one online round in which all secondary students can participate, a second on-site round for the best of those and a third final round to decide who will represent The Netherlands at the IOI, with only four people qualifying!\u003c/p\u003e\n\u003ch3\u003eOnline qualifications (Q4 2011 - Q1 2012)\u003c/h3\u003e\n\u003cp\u003eThe first round consisted of a few tasks including a game of battleships in which your program would be pitted against that of other participants and you would be awarded points based on your relative performance. For this particular program I went the lazy route: I copied the behavior of the example implementation and improved it a little bit. I managed to achieve an almost perfect score, with my program defeating the majority of the competition. \u003ca href=\"https://docs.google.com/open?id=0Bz1ITcpSnkcqYzI3ZGdlWmtkeDg \" target=\"_blank\"\u003eYou can read the description of the problem here\u003c/a\u003e \u003ca href=\"https://gist.github.com/3326251\" target=\"_blank\"\u003eand my solution in Python here, including a description of the algorithm\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eOne of the other problems in the first round was the game Bao, for this your program also had to battle it out against the other programs. I only implemented the rules and let my AI decide at random, this in combination with the first problem and the others (which I frankly have forgotten about) gave me 212 of 300 points which was enough to advance to the second round.\u003c/p\u003e\n\u003ch3\u003eThe first on-site round (24th of March 2012 at the \u003ca href=\"http://www.utwente.nl/\" target=\"_blank\"\u003eUT\u003c/a\u003e)\u003c/h3\u003e\n\u003cp\u003eThe second round took place at the \u003ca href=\"http://www.utwente.nl/\" target=\"_blank\"\u003eUniversity of Twente\u003c/a\u003e, featuring the 20 best students from the online qualification round. This round consisted of two categories consisting of multiple each.\u003c/p\u003e\n\u003cp\u003eThe first category was the division of items where each item has a specific value, known as the \u003ca href=\"http://en.wikipedia.org/wiki/Partition_problem\" target=\"_blank\"\u003e\u0026#34;Partition problem\u0026#34;\u003c/a\u003e. The first few problems gave you the description of an algorithm which you then had to implement yourself, with points being awarded based on how well your implementation followed the instructions.\u003c/p\u003e\n\u003cp\u003eFor the last problem in this category you had to think of an algorithm yourself that would find a fair division. Experienced (competitive) programmers would immediately know that this is a \u003ca href=\"http://en.wikipedia.org/wiki/Np_hard\" target=\"_blank\"\u003eNP-hard\u003c/a\u003e problem with a \u003ca href=\"http://en.wikipedia.org/wiki/Pseudo-polynomial_time\" target=\"_blank\"\u003epseudo-polynomial\u003c/a\u003e solution. At this point I did not know about this (or even what these terms mean) so I tried implementing a naive algorithm (which I later found out is called \u003ca href=\"http://en.wikipedia.org/wiki/Greedy_algorithm\" target=\"_blank\"\u003eGreedy\u003c/a\u003e) but due to mistakes my solution did not fare that well.\u003c/p\u003e\n\u003cp\u003eThe second category was string processing consisting of problems like checking whether a string is in a dictionary, finding the amount of syllables and finding overlapping words. I ended fifth in this round and got to the finals with 11 other students!\u003c/p\u003e\n\u003ch3\u003ePreparations for the final round\u003c/h3\u003e\n\u003cp\u003eIn preparation of the final round we got three days of algorithmic training. This included topics like Greedy algorithms, Dynamic Programming, Graph theory, recursive backtracking etc. This training was really interesting and I felt it really stepped up my programming game. Before this training I knew nothing about algorithms or time complexity but after I got a very good base from which I could expand my programming knowledge.\u003c/p\u003e\n\u003cp\u003eAn example of stuff with a \u0026#39;practical\u0026#39; use are \u003ca href=\"http://en.wikipedia.org/wiki/Trie\" target=\"_blank\"\u003eTries\u003c/a\u003e to find the best words in the game \u003ca href=\"http://www.rumble-app.com/\" target=\"_blank\"\u003eRumble\u003c/a\u003e and display them from longest to shortest, you can find the code \u003ca href=\"https://github.com/boukevanderbijl/rumble-solver\" target=\"_blank\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eThe weeks leading up to the final competition day I tried my very best to solve one or more problems every single day on the \u003ca href=\"http://ace.delos.com/usacogate\" target=\"_blank\"\u003eUSACO training page\u003c/a\u003e.\u003c/p\u003e\n\u003ch3\u003eThe final on-site round (11th of June 2012 at the \u003ca href=\"http://www.tue.nl/\" target=\"_blank\"\u003eTU/e\u003c/a\u003e)\u003c/h3\u003e\n\u003cp\u003eThe final round itself was kind of a disaster. I thought it went really bad for me, but so did the rest which kind of gave me hope, although I didn\u0026#39;t expect much pf it. But when we received the results it turned out I actually scored best!\u003c/p\u003e\n\u003cp\u003eApparently the final round was much harder than usual, with half of the students scoring only 10 points or less, while I scored 135/400 putting me first and earning me a trophy that I can keep for one year.\u003c/p\u003e\n\u003cp\u003e\u003cimg align=\"middle\" height=\"400\" src=\"https://i.imgur.com/sPfA2l.jpg\"/\u003e\u003c/p\u003e\n\u003ch3\u003eNext\u003c/h3\u003e\n\u003cp\u003eIn September I will be flying to Italy, joining about 400 other students at the IOI \u003ca href=\"http://www.ioi2012.org/\"\u003ehttp://www.ioi2012.org/\u003c/a\u003e, hoping to win a medal at one of the largest and hardest programming competitions out there. Back to training!\u003c/p\u003e\n\n\u003cp\u003e\u003ca href=\"http://www.reddit.com/r/programming/comments/y3f51/my_road_to_the_ioi_2012/\" target=\"_blank\"\u003eReddit comments\u003c/a\u003e\u003cbr/\u003e\u003ca href=\"http://news.ycombinator.com/item?id=4372645\" target=\"_blank\"\u003eHN comments\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eIf you found this article interesting, consider reading \u003ca href=\"http://sirupsen.com/my-journey-to-the-international-olympiad-in-informatics/\" target=\"_blank\"\u003eMy journey to the International Olympiad in Informatics\u003c/a\u003e by \u003ca href=\"https://twitter.com/Sirupsen\" target=\"_blank\"\u003eSirupsen\u003c/a\u003e too!\u003c/p\u003e\n\n  \u003cp\u003e\u003cspan class=\"date\"\u003eAug 2012\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e",
  "Date": "2012-08-01T00:00:00Z",
  "Author": "bou.ke"
}