{
  "Source": "bou.ke",
  "Title": "Learning from old code",
  "Link": "https://bou.ke/blog/learning-from-old-code/",
  "Content": "\u003cdiv class=\"content\"\u003e\n\u003cdiv class=\"post\"\u003e\n  \u003ch1\u003eLearning from old code\u003c/h1\u003e\n  \u003cp\u003eRecently \u003ca href=\"https://github.com/blog/2164-introducing-unlimited-private-repositories\" target=\"_blank\"\u003eGitHub announced\u003c/a\u003e that any paying personal user will now have unlimited private repositories. I immediately started migrating some of my old private repos of dead projects that I had on Bitbucket, and in the process I found two old PHP projects that I wrote about 5 years ago.\u003c/p\u003e\n\n\u003ch2 id=\"tophyvers\"\u003e\u003ca href=\"https://github.com/bouk/hyves-stats\" target=\"_blank\"\u003eTopHyvers\u003c/a\u003e\u003c/h2\u003e\n\n\u003cp\u003eThis is a project I made when I was 16, and I have vague memories of working on it in my grandma’s attic. It was a site that showed the top users for a now-defunct social network called \u003ca href=\"https://en.wikipedia.org/wiki/Hyves\" target=\"_blank\"\u003eHyves\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp\u003ePeople could add their own profiles to the site and come back daily to see how their views and friend count progressed over time. The Hyves website contained a list of all the celebrities that had profiles on the site, so I remember scraping that page and mass-importing all the profiles, to make sure my site had some interesting content from the beginning on.\u003c/p\u003e\n\n\u003cp\u003eHow it worked is that I would request the profile of all the registered users every 24 hours and insert the number of followers and pageviews into the database. I made a very primitive \u003ca href=\"https://github.com/bouk/hyves-stats/blob/master/webapp/classes/Webapp.class.php\" target=\"_blank\"\u003eWebapp framework\u003c/a\u003e that allowed for \u003ca href=\"https://github.com/bouk/hyves-stats/blob/master/bootstrap.php\" target=\"_blank\"\u003edefining routes\u003c/a\u003e which would then be routed to the correct ‘\u003ca href=\"https://github.com/bouk/hyves-stats/tree/master/handlers\" target=\"_blank\"\u003ehandlers\u003c/a\u003e’. I couldn’t get cron to work correctly with commandline PHP, so I remember just setting it up to curl my \u003ca href=\"https://github.com/bouk/hyves-stats/blob/master/handlers/UpdateHyversCron.php#L7\" target=\"_blank\"\u003eupdate handler\u003c/a\u003e every minute.\u003c/p\u003e\n\n\u003cp\u003eAt one point I could see the demise of Hyves, with all the top users losing tonnes of ‘followers’ every single day. I’ve decided to open source \u003ca href=\"https://github.com/bouk/hyves-stats\" target=\"_blank\"\u003ethis project\u003c/a\u003e, hardcoded secrets and all, so others might gain some wisdom from my crappy PHP code. If you’re interested in the history of Hyves (and know Dutch) I suggest you read ‘van 3 naar 10 miljoen vrienden’, about the history of Hyves and how it exploded in popularity in The Netherlands.\u003c/p\u003e\n\n\u003cp\u003eI remember the design of the site being pretty cutting-edge, with rounded corners and gradients and everything. This is what it looked like:\u003c/p\u003e\n\n\u003cimg src=\"/images/tophyvers.png\" style=\"max-width:1010px;\"/\u003e\n\u003ch2 id=\"ishetkutweer\"\u003e\u003ca href=\"https://github.com/bouk/ishetkutweer\" target=\"_blank\"\u003eIshetkutweer\u003c/a\u003e\u003c/h2\u003e\n\n\u003cp\u003eThe second project I found was one I made for fun which showed you the weather for your current location in a rude way (the name roughly translates to “Is the weather a bitch?”. Depending on the weather, it would either be complaining about the heat or the cold.\u003c/p\u003e\n\n\u003cp\u003eOne thing I remember being proud of for this project is \u003ca href=\"https://github.com/bouk/ishetkutweer/blob/master/classes/Tools.class.php#L9\" target=\"_blank\"\u003ea cache\u003c/a\u003e I built in to make sure I don’t do multiple API requests within the same hour for a certain IP address.\u003c/p\u003e\n\n\u003cp\u003eThe spirit of the project still lives on at the current \u003ca href=\"https://ishetkutweer.nl/\" target=\"_blank\"\u003eishetkutweer.nl\u003c/a\u003e site, which I transferred the domain over to since they asked me for it.\u003c/p\u003e\n\n\u003ch2 id=\"conclusion\"\u003eConclusion\u003c/h2\u003e\n\n\u003cp\u003eWhile the code has lots of obvious issues, it’s still a fun exercise to go through it and look at what I knew then and what I’ve learned since. It also reminds me that while PHP has a lot of… imperfections, it still can’t be beat for rapid prototyping and ease of deployment. I was able to put up and run these sites on super cheap PHP/MySQL hosting without having to worry about operating systems and package managers and all that. That’s something that hasn’t become easier for many development stacks.\u003c/p\u003e\n\n  \u003cp\u003e\u003cspan class=\"date\"\u003eMay 2016\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e",
  "Date": "2016-05-01T00:00:00Z",
  "Author": "bou.ke"
}