{
  "Source": "bou.ke",
  "Title": "A life of crime",
  "Link": "https://bou.ke/blog/life-of-crime/",
  "Content": "\u003cdiv class=\"content\"\u003e\n\u003cdiv class=\"post\"\u003e\n  \u003ch1\u003eA life of crime\u003c/h1\u003e\n  \u003cp\u003eTwo years ago I read the book ‘American Kingpin: The Epic Hunt for the Criminal Mastermind Behind the Silk Road’. It is the story about the man who operated the Silk Road, a dark web marketplace where anyone could buy and sell anything. This rapidly became a drug haven of course, with people selling anything from weed to heroin.\u003c/p\u003e\n\n\u003cp\u003eThis book spoke to me on a personal level, because I could imagine myself in a parallel reality taking a similar path, one where I would run a darkweb hacking empire. In fact, I’ve done some sketchy stuff as a teenager, so I thought it would be fun to portray some of them here. I don’t do these things any more, of course!\u003c/p\u003e\n\n\u003ch2 id=\"scamming-kids-on-habbo-hotel\"\u003eScamming kids on Habbo Hotel\u003c/h2\u003e\n\n\u003cp\u003eWhen I was 11, the hottest game that everyone was playing was Habbo Hotel. Habbo Hotel (it’s still around!) is a game where you socialize with your friends and random people. The most exciting part about it was that you could have your own hotel rooms, where you could customize the wallpaper, place furniture (known as ‘furni’) and keep pets. These customizations have to be bought of course, and all the cool kids in school would convince their parents to let them call the premium phone numbers, giving them virtual gold.\u003c/p\u003e\n\n\u003cimg src=\"/images/crime/habbo.png\" alt=\"\" style=\"max-height: min(100vh, 319px)\" loading=\"lazy\"/\u003e\n\u003cp\u003eAt the time I had already spend a bunch of time with Microsoft Frontpage, and learned a bit of HTML by looking at the HTML it would produce.\u003c/p\u003e\n\n\u003cimg src=\"/images/crime/frontpage.gif\" alt=\"\" style=\"max-height: min(100vh, 384px)\" loading=\"lazy\"/\u003e\n\u003cp\u003eArmed with this rudimentary knowledge of HTML, I managed to copy the Habbo Hotel login page (by doing right click and save) and edit it to send the details people filled in to some free form service I found online. I then uploaded it to a free hosting service, which made it available online.\u003c/p\u003e\n\n\u003cimg src=\"/images/crime/habbo.gif\" alt=\"\" class=\"crisp-edges\" style=\"max-height: min(100vh, 185px)\" loading=\"lazy\"/\u003e\n\u003cp\u003eMy friends and I would then log onto Habbo, create various characters with official-sounding names (think ‘KathyHelpHabbo’) and tell people to visit something like \u003ccode class=\"language-plaintext highlighter-rouge\"\u003ehabbocredits.freewebhosting.com\u003c/code\u003e. And it worked! People would go there, fill in their log-in details, and we would receive the username and password by e-mail. We’d then log into their account, go to their rooms, take all the furniture and hand it over to our own accounts. In the end most of our accounts got banned, and in later years the creators put in various protections so you couldn’t just hand over all your furniture to other players, but we had a lot of fun while it lasted.\u003c/p\u003e\n\n\u003ch2 id=\"reporting-my-teacher-as-sick-with-sql-injection\"\u003eReporting my teacher as sick with SQL injection\u003c/h2\u003e\n\n\u003cp\u003eAround the age of 14 I started becoming more and more interested in hacking. Through online resources like \u003ca href=\"https://www.hackthissite.org\" target=\"_blank\"\u003eHackThisSite.org\u003c/a\u003e I picked up some skills in breaking into websites.\u003c/p\u003e\n\n\u003cimg src=\"/images/crime/hts.jpg\" alt=\"\" style=\"max-height: min(100vh, 51px)\" loading=\"lazy\"/\u003e\n\u003cp\u003eWith my primitive knowledge of web application hacking I started poking around on my school’s website. I came upon the login page for the rostering application they built, a typical in-house built script with all the warts you’d expect. Being the script kiddie I was at the time, I started copy and pasting from a list of SQL injections I found online. And to my delight, putting \u003ccode class=\"language-plaintext highlighter-rouge\"\u003e\u0026#39; or \u0026#39;1\u0026#39;=\u0026#39;1\u003c/code\u003e into the password field worked! I was in.\u003c/p\u003e\n\n\u003cp\u003eWith my newly gained access I could do two things: upload a new roster, or mark specific teachers as being sick. I opted for the most straightforward option, reporting my Dutch teacher as unavailable. This gave my class the first hour off! My whole class was hanging out in the lobby of the school, and we were having a good time as our Dutch teacher furiously passed us. In the end my access was short-lived, and the next day the vulnerability was fixed. Luckily I was never caught!\u003c/p\u003e\n\n\u003ch2 id=\"hacking-mobile-games\"\u003eHacking mobile games\u003c/h2\u003e\n\n\u003cp\u003eAt one point I became interested in reverse-engineering mobile apps, using tools like \u003ca href=\"https://mitmproxy.org/\" target=\"_blank\"\u003emitmproxy\u003c/a\u003e and \u003ca href=\"https://ibotpeaches.github.io/Apktool/\" target=\"_blank\"\u003eapktool\u003c/a\u003e to figure out what was going on under the hood.\u003c/p\u003e\n\n\u003ch3 id=\"draw-something\"\u003eDraw Something\u003c/h3\u003e\n\n\u003cp\u003eDraw Something is a game where two players take turns drawing a given word, which the other player then has to guess.\u003c/p\u003e\n\n\u003cimg src=\"/images/crime/vangogh.png\" alt=\"\" style=\"max-height: min(100vh, 646px)\" loading=\"lazy\"/\u003e\n\u003cp\u003eAs you play the game you get a small number of coins every time you complete a game. These coins can be used to buy new colors to use during the game, and ‘bombs’ to make answering easier. Watching the traffic between the app and the server, I found out that it would simply access a \u003ccode class=\"language-plaintext highlighter-rouge\"\u003e/reward\u003c/code\u003e endpoint with your user ID! I wrote a script that would repeatedly give myself the maximum reward, giving me as many coins as I wanted without paying for the in-app purchase.\u003c/p\u003e\n\n\u003ch3 id=\"songpop\"\u003eSongpop\u003c/h3\u003e\n\n\u003cp\u003eSongpop is a 1-on-1 music quiz game, where you listen to music and answer questions about it.\u003c/p\u003e\n\n\u003cimg src=\"/images/crime/songpop.png\" alt=\"\" style=\"max-height: min(100vh, 418px)\" loading=\"lazy\"/\u003e\n\u003cp\u003eI was getting totally smoked by my classmates, so I pulled up mitmproxy and started inspecting the traffic that was being sent back and forth, and quickly realized that the answer was being sent with the question. Inspecting the traffic allowed me to view the answer beforehand, and I could even modify my reply to make the app think I took zero seconds, ensuring I would always get a maximum score.\u003c/p\u003e\n\n\u003ch3 id=\"words-with-friends\"\u003eWords With Friends\u003c/h3\u003e\n\n\u003cp\u003eWords With Friends is a scrabble clone.\u003c/p\u003e\n\n\u003cimg src=\"/images/crime/wwf.png\" alt=\"\" style=\"max-height: min(100vh, 399px)\" loading=\"lazy\"/\u003e\n\u003cp\u003eUsing apktool I decompiled the application and started inspecting what was going on. Inside the application was a wordlist, which I edited to include a nonexistent word consisting of my whole rack of tiles, which to my great surprise worked! The words were only checked on the client-side, the server accepted any kind of submission. Nobody wanted to play with me after that.\u003c/p\u003e\n\n\u003ch2 id=\"defacing-my-school\"\u003eDefacing my school\u003c/h2\u003e\n\n\u003cp\u003eTwo years after my first school hack, I hadn’t lost my appetite for breaking into things. I’d constantly try to figure out ways to break my school’s site, and then one day the school announced a contest to decide on a new slogan! All the students could submit suggestions for a slogan, and the school would pick out the one they liked best. If you’re creating PHP scripts from scratch then this is the perfect avenue for a very wide-spread category of bugs called Cross-Site Scripting (XSS). Instead of my submission just being\u003c/p\u003e\n\n\u003cdiv class=\"language-plaintext highlighter-rouge\"\u003e\u003cdiv class=\"highlight\"\u003e\u003cpre class=\"highlight\"\u003e\u003ccode\u003eFun and Educational!\n\u003c/code\u003e\u003c/pre\u003e\u003c/div\u003e\u003c/div\u003e\n\n\u003cp\u003eI hid in some code, so I submitted\u003c/p\u003e\n\n\u003cdiv class=\"language-plaintext highlighter-rouge\"\u003e\u003cdiv class=\"highlight\"\u003e\u003cpre class=\"highlight\"\u003e\u003ccode\u003eFun and Educational!\u0026lt;script\u0026gt;evilCode()\u0026lt;/script\u0026gt;\n\u003c/code\u003e\u003c/pre\u003e\u003c/div\u003e\u003c/div\u003e\n\n\u003cp\u003eThis extra bit of code would get executed when the administrator viewed the submissions, giving them no indication that anything malicious was going on. In my case I made the code take the cookies from the browser and send them to my email, so I could impersonate whoever viewed the submission. I diligently worked away on my exploit code, and submitted my ‘slogan’.\u003c/p\u003e\n\n\u003cp\u003eAnd then, I waited. I couldn’t know whether it worked, since there was no way to view your own submission after it was made. So I waited and waited. And then one afternoon: a hit! I received an email containing the cookies of the administrator. I put them into my browser and clicked refresh. It worked. I was now administrator of my school’s site.\u003c/p\u003e\n\n\u003cp\u003eWhat happened next is a bit of my blur in my mind. Since I only had the cookies, I needed a way to establish a permanent foothold into the site. I ran the risk of losing access once the session expired. I leafed through the various admin pages, until I found a seemingly neglected form that didn’t verify what type of file was being uploaded, and I used this to upload \u003ca href=\"https://www.dulldusk.com/phpfm\" target=\"_blank\"\u003ephpfm\u003c/a\u003e, the only PHP file access tool I could find that wouldn’t get blocked by the site’s virus scanners.\u003c/p\u003e\n\n\u003cimg src=\"/images/crime/phpfm.png\" alt=\"\" style=\"max-height: min(100vh, 422px)\" loading=\"lazy\"/\u003e\n\u003cp\u003eWith this access in place, I was king. I could read every file, know every secret, break every code. I swiped the database credentials and downloaded the username and password of all the teacher and all the students. Of course, I didn’t tell anyone! But my vanity would become the end of me.\u003c/p\u003e\n\n\u003ch3 id=\"the-fall\"\u003eThe fall\u003c/h3\u003e\n\n\u003cp\u003eMaintaining my access to the site, I wasn’t really sure what to do next. Gaining access was the whole point, a temporary relieve from boredom without any malicious intent. During this time, I would organize LAN-parties with my friends. We would all get together at someone’s house, play some videogames and do a sleepover. During one of these parties, in an attempt to impress my friends, I perfomed the ultimate act in website hacking: I ‘defaced’ the site. ‘Defacing’ is an action where one clears out the whole website, replacing it with their own message. In my case it was something innocent, like ‘This site is not available, sorry :)’. Of course, for the people who needed the site for their job this was not so innocent, since it made it impossible for them to log-in.\u003c/p\u003e\n\n\u003cp\u003eI performed the defacing, my friends were mildly impressed, and we went on with playing videogames. The next day it was solved fairly quickly.\u003c/p\u003e\n\n\u003cp\u003eMonday rolls around and I’m back in class, pretending like nothing happened. During biology class the head of IT walks in, points to me and says ‘We need to talk!’, I knew exactly what was about to happen. Since I didn’t have any malicious intent, I spilled all the beans immediately, telling him exactly what I did, and showing where exactly I made my modifications. In the end I only got suspended for one day, which is about as well as it could’ve ended.\u003c/p\u003e\n\n\u003ch2 id=\"aftermath\"\u003eAftermath\u003c/h2\u003e\n\n\u003cp\u003eThankfully I didn’t do anything too dangerous in the end, and didn’t get in too much trouble. These days I only hack by the book, having found other outlets to direct my energy towards. I do get a kick out of listening to \u003ca href=\"https://darknetdiaries.com/\" target=\"_blank\"\u003eDarknet Diaries\u003c/a\u003e though, which has many stories of kids pulling the same sort of stunts I did.\u003c/p\u003e\n\n  \u003cp\u003e\u003cspan class=\"date\"\u003eMay 2019\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e",
  "Date": "2019-05-01T00:00:00Z",
  "Author": "bou.ke"
}