{
  "Source": "bou.ke",
  "Title": "2020: Corona Days",
  "Link": "https://bou.ke/blog/2020/",
  "Content": "\u003cdiv class=\"content\"\u003e\n\u003cdiv class=\"post\"\u003e\n  \u003ch1\u003e2020: Corona Days\u003c/h1\u003e\n  \u003cp\u003eWell well well, what a plot-twist we’ve all had this year. 2020 started out great for me, I was able to travel to Thailand with my sister to spend some time together in January, where on the way home people started wearing facemasks at the airport and I thought “Huh that’s a new thing, so weird”. I’ve kept up my diary all of last year, and despite the gradual build-up of global fear and anxiety, I didn’t write about it until the real crescendo in March. Somewhere in your mind you just can’t imagine it, these viruses have always been a thing that happens in \u003cem\u003eother\u003c/em\u003e parts of the world, not to us. Well, not this time.\u003c/p\u003e\n\n\u003cp\u003eThis pandemic has made me realize that human contact is, believe it or not, quite important. I’ve been working remotely for more than two years at this point which was already quite a reduction of in-person contact, which the lockdown(s) reduced to truly nothing. This is no way to live, life is about our relationships we have and build up with other people, without which we barely exist at all. This also plays into remote work, I’ve made so many good friends from my time at Shopify (at the time when remote work wasn’t an option there!) but working at DigitalOcean it was much harder to meet new people. Right now we don’t have an option and I don’t mind distancing myself while we figure out this mess, but I don’t see myself working fully remote in the future. I’m more of an extravert than I gave myself credit for and Zoom meetings just ain’t a replacement. This year has not been the best year to make this realization, since I can’t do anything about it! But for now we’ll all just have to hold steady and wait for better days. It’s been helpful for me this year to admit to myself that no, I’m not fine and neither are most either people, and that’s fine. It would be quite strange in fact if everything was fine right now.\u003c/p\u003e\n\n\u003ch2 id=\"things-to-look-forward-to\"\u003eThings to look forward to\u003c/h2\u003e\n\n\u003cp\u003eA weird effect of the lockdown is that it takes away any possibility of looking forward to things. Normally I’d always had a trip or dinner or some sort of leisure activity planned, but that just isn’t possible when you have to stay home. Thankfully I do have some things to look forward to in 2021. I quit my job at DigitalOcean in November and have started at \u003ca href=\"https://cheddar.me\" target=\"_blank\"\u003eCheddar\u003c/a\u003e as the first engineering hire, which is overwhelming because there’s so much work to do but also exciting, because I get to make a lot of decisions that will impact how the system works into the future. When times are better I will also move to Amsterdam to help build up a team there. I’ve been moving annually for the past three years or so which sucks and I’m quite tired of it, so hopefully this will be for a longer term. It’s been a dream of me to live in Amsterdam for a while. I’ve realized more and more over the past year that I value being close to family, which living there would grant me. It’s also just a lovely city to live in (actual bike infrastructure!) and it provides me with the kind of work opportunities that I’m looking for.\u003c/p\u003e\n\n\u003ch2 id=\"books\"\u003eBooks\u003c/h2\u003e\n\n\u003cp\u003eHere’s two of my favorite books I read this year. You can see all the books I read on \u003ca href=\"https://www.goodreads.com/user_challenges/19619543\" target=\"_blank\"\u003eGoodreads\u003c/a\u003e.\u003c/p\u003e\n\n\u003ch3 id=\"the-making-of-prince-of-persia\"\u003eThe Making of Prince of Persia\u003c/h3\u003e\n\n\u003cp\u003eI’ve read a bunch of the Stripe Press books this year including Stubborn Attachments, The Making of Prince of Persia, and The Dream Machine. The hardcover versions of the books are just beautiful and the books are great too. The Making of Prince of Persia is about how the videogame was made and what the creator Jordan Mechner was experiencing while he was making it. I just love these peeks into the lives of people, it shows the work it took for them to accomplish what they did.\u003c/p\u003e\n\n\u003ch3 id=\"the-mastermind-drugs-empire-murder-betrayal\"\u003eThe Mastermind: Drugs. Empire. Murder. Betrayal.\u003c/h3\u003e\n\n\u003cp\u003eWell this book is just wild. It could be an alternative biography for some smart people I know if they had taken their lives down a darker path. It’s about Paul Le Roux, internet entrepreneur turned drug kingpin, who peddled pills online and grew his business to include illicit fishing in Somalia, just because there was money to be made. It is truly crazy what depraved things people do just because they want to make money.\u003c/p\u003e\n\n\u003ch1 id=\"2021\"\u003e2021\u003c/h1\u003e\n\n\u003cp\u003eThis next year will be tough at first, with lockdowns and bad news continuing. But I’m sure that better days are ahead. Stay hopeful!\u003c/p\u003e\n\n  \u003cp\u003e\u003cspan class=\"date\"\u003eDec 2020\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e",
  "Date": "2020-12-01T00:00:00Z",
  "Author": "bou.ke"
}