{
  "Source": "why.degree",
  "Title": "on workstyles",
  "Link": "https://why.degree/on-workstyles/",
  "Content": "\u003cdiv class=\"post-content e-content\" itemprop=\"articleBody\"\u003e\n    \u003cp\u003eI spent my entire degree not knowing the difference between workdays and weekends. I studied on most Saturdays and Sundays, and I took time off whenever I felt like it. Did I have the most organised schedule? Clearly not. But it was the flexibility I was after. I could have attended any event at any time of the day just fine without any repercussions on my work. Fast forward a few months, full-time work mode is on, my calendar is booked Monday to Friday, 8am to 7pm, and I had to learn to separate work from life. Let me explain.\u003c/p\u003e\n\n\u003cp\u003eI commute to work by train, close to an hour in both directions. While my work schedule is from 9 to 5:30, I am at the mercy of the train company to plan journeys according to my liking. Unsurprisingly, I’ve got used to this routine in only a couple of days. What I struggled more with was to stop thinking about work when at home. It’s not that I find my job irritating or anything of the sort. It’s more the case that I want to concentrate on work when I’m at work. The vicious circle goes as follows: there are activities I want to do in my free time; spending time on work outside work leads to a lack of time spent on other meaningful parts of my life; in turn, that leads to time off work fulfilling those parts. Unfavourably for my current situation, that would resemble uni too much. I broke this circle before it even started by being strict about the work-life boundaries from the first day.\u003c/p\u003e\n\n\u003cp\u003eIn addition, compared to uni, where all the work I did was primarily individual, my job now gravitates around other people. Thus, finding overlaps with my team is of the utmost importance. Being a junior, I couldn’t ask my colleagues to come in and have meetings at unusual hours - the only solution I had was to adapt to them. Even as a senior, I would find it disrespectful to call your colleagues in outside their work hours.\u003c/p\u003e\n\n\u003cp\u003eFinally, I achieve the actual mental separation by commuting. I constraint all of my work thoughts to one physical space, and I transition from that state to my free time by taking the train. Inevitably, I still catch myself coming up with ideas for work projects at home, but I try to stop the moment I realise it. This model has proven continuously more effective for the first couple of months, so much so that I would be satisfied with keeping it in its current form for the future.\u003c/p\u003e\n\n  \u003c/div\u003e",
  "Date": "2021-10-20T13:00:05+01:00",
  "Author": "why.degree"
}