{
  "Source": "why.degree",
  "Title": "on paper",
  "Link": "https://why.degree/on-paper/",
  "Content": "\u003cdiv class=\"post-content e-content\" itemprop=\"articleBody\"\u003e\n    \u003cp\u003eI believe that coding is all about following a story and implementing a narrative. Once the logic is crystal clear, it only takes a short time to transcribe it into code. Besides the obstacles the transcribing itself poses, clarifying the requirements and understanding the logic come with their unique quirks. My opinion is that the simplicity of using a pen and paper overcomes some of these issues.\u003c/p\u003e\n\n\u003cp\u003eIt was during the first internship that I learned version-controlling. Before that, I did not have to cooperate with anyone else on code. If only from that single point of view, the internship was quite productive. Many other things I learned made the experience even better. But without deviating from the main topic, I can now look back and amuse myself with how I used to keep track of the changes in my files: using a notebook. I simulated the commits by writing down what I changed and which files I touched. Obviously, the whole system caused me a lot of pain. Going back in time by manually undoing everything was tiresome, hence why I did it rarely. I was terrified of needing a previous version. I constantly reimplemented old methods from scratch to avoid looking at what I updated over time.\u003c/p\u003e\n\n\u003cp\u003eMy saving angel was my mentor at the time. He took pity on me and decided that I would not be able to progress without learning the industry-standard: git. I couldn’t be more grateful for their help! They have literally freed days of work from my internship. Thanks to them, I iterated faster and more systematically. In turn, I was able to ask for feedback and take my project to its final shape more quickly. I don’t remember how they figured out that I needed help, as I did not complain about my troubles. Frankly, I didn’t even know I was doing anything wrong. Not knowing what I didn’t know, I lived a decent ignorant life. Good thing there are weapons against ignorance…\u003c/p\u003e\n\n\u003cp\u003eSoon after that, I stopped using physical paper altogether. Whereas before I would still do maths calculations and diagrams by hand, I later discovered digital replacement tools that made me dismiss pens completely. In fact, this got so serious that I questioned whether my writing was still legible. It’s worth noting that I had a reason to care about this: physical, hand-written exams. Even for those, however, I would still practice on a computer, using the mouse and the keyboard. It wasn’t until a few weeks ago that I started using paper again when I found it easier to take notes during meetings and write down to-do lists for the next day. Quite unexpectedly, my short-term planning skills improved. I am now able to keep track of tasks more consistently. Perhaps I haven’t yet found out about a better tool for me. In any case, I seriously doubt that the versatility of a blank sheet of paper can be fully digitalised.\u003c/p\u003e\n\n\u003cp\u003eBut the quest should not be to fully replace our striped and dotted companions. Instead, it should be to find the right tool for the right job. For example, if one requires an online, auto-syncing sticky notes app, then they should find such an app and use it. At the same time, if it’s quicker to explain decisions using hand drawings, then one should have a pen and a notebook in an accessible location, such as their cupboard. At the moment, paper is what I use for most work-related, back-of-the-envelope maths and small diagrams that I don’t have to share with my colleagues. Nevertheless, I’m excitingly waiting for the next time I’ll be one of the \u003ca href=\"https://xkcd.com/1053/\"\u003elucky 10,000\u003c/a\u003e.\u003c/p\u003e\n\n  \u003c/div\u003e",
  "Date": "2022-04-11T13:00:05+01:00",
  "Author": "why.degree"
}