{
  "Source": "why.degree",
  "Title": "on running rm",
  "Link": "https://why.degree/on-running-rm/",
  "Content": "\u003cdiv class=\"post-content e-content\" itemprop=\"articleBody\"\u003e\n    \u003cp\u003eThe more software I write, the scarier it is to run \u003ccode class=\"language-plaintext highlighter-rouge\"\u003erm\u003c/code\u003e. I double-check the path every time, and I still secretly hold my breath before hitting enter. It comes down to responsibility, experience, and confidence. The order is not arbitrary, as each is a prerequisite for the next.\u003c/p\u003e\n\n\u003cp\u003eIt has never bitten me, and it helps that I only work on machines with my custom profiles set up. That way, I’ve got an extra check in place since I’ve aliased \u003ccode class=\"language-plaintext highlighter-rouge\"\u003erm\u003c/code\u003e to \u003ccode class=\"language-plaintext highlighter-rouge\"\u003erm -i\u003c/code\u003e, etc. Of course, I am training a bad habit, and there will be a time when I will have to give it up and pay the debt. Unfortunate if it happens on a production machine, but that’s why we have backups, right?\u003c/p\u003e\n\n\u003cp\u003eI have only recently become painfully aware of the possible effects of my actions. I knew I could wipe up everything if I typed in the wrong symbols, but it never meant the end of the world. E.g., I could rewrite my answers to a problem sheet in a couple of hours. I could also rely on git to fetch the latest stored version and implement the changes from scratch. And that is still the case for the most part. However, it only takes one un-backed up file to trigger paranoia.\u003c/p\u003e\n\n\u003cp\u003eI don’t expect this feeling to go away. I actually agree it shouldn’t. The further I advance, the more critical my decisions will be. So for everybody’s sake, I’d better know what to expect from each of them and be confident that it will not remove the entire company’s operating system.\u003c/p\u003e\n\n  \u003c/div\u003e",
  "Date": "2023-01-19T12:00:05Z",
  "Author": "why.degree"
}