{
  "Source": "why.degree",
  "Title": "on holiday",
  "Link": "https://why.degree/on-holiday/",
  "Content": "\u003cdiv class=\"post-content e-content\" itemprop=\"articleBody\"\u003e\n    \u003cp\u003eTaking a break from work has effects extending beyond the vacation. In the short term, the need is to check that the team can perform effectively without a person. This includes day-to-day activities but also support. Moreover, transitioning between work and non-work costs at least one extra day of readjustment, so management must plan accordingly. Long term, the duration and timing of the holidays may reflect an outburst of inner displeasure. Thus, compared to uni, the off-time involves careful planning and a high degree of communication.\u003c/p\u003e\n\n\u003cp\u003eI have taken time off in each of my past internships. The main reason is that they would usually cover the entire summer, so I would have almost no free time between the two years of studies. Legally, I was entitled to ~5 days in total. I would align them in such a way as to extend the holiday as much as possible (i.e. using bank holidays). In my experience, the design of most internships does not account for long off periods. It is indeed expected that some interns may progress more slowly, thus giving a small leeway. However, an issue arises when the slower interns take time off and run past that leeway. Then it becomes difficult for managers to assess the performance, so they have to rely on other criteria, e.g. the desire to complete the project. Besides this disadvantage, taking time off comes at a material loss for the interns, too: they would have most likely been reimbursed for the holiday they had not taken. Personally, I have prioritised travelling to making the most of my internships. Looking back, I believe I chose the right path. Going on vacation and returning to the same project reveals how good the team is at reintegration, something an extra week of work cannot match. To be fair, I was also lucky enough to have exciting projects and good mentors, so completing the tasks was never a time problem.\u003c/p\u003e\n\n\u003cp\u003eProgressing on the career path, taking time off while working full-time comes with one extra layer of difficulty and requires more communication. While the team does not depend on any of the interns, it is usually the case that every full-time member is crucial. It is essential to talk to the team and the manager and confirm that there is no risk of overrunning deadlines. If the plan is to achieve a goal in the current quarter, it would be wise for employees to plan their holidays after finishing the intensive work period. Nevertheless, covering for a vacationing colleague is trivial when the manager does not expect a lot of output in the short term. The employees can work around the time gaps and finish projects in advance if the team’s holiday intentions are announced beforehand. It is more difficult to schedule the support rota, which involves a distinct responsibility: being reachable at all times for long periods and dealing with unforeseen critical issues. As support is one of the worst parts of working with software, people may feel uneasy covering for their colleagues. The general expectation is that all employees will take some time off. Thus, generally, one good deed will compensate for the next time the benefactor goes on holiday.\u003c/p\u003e\n\n\u003cp\u003eFrom a managerial point of view, employees returning from their holiday go through a period of readjustment, thus costing the company valuable time. It would be arguably unethical and illegal to force employees to never take time off. However, the gist is that employers should include extra time besides the actual holidays in their calculations of non-productive days to correctly manage their expectations. Going deeper, if an employee schedules their holiday to effectively avoid their work, their manager has to consider their satisfaction and health. The main question both parties should address is whether the employee experiences any problems and, if yes, how their manager could help. The holiday may be the first subtle step towards somebody leaving the company. Of course, not every holiday signals displeasure, but different people interpret things differently. For example, one of my past managers became concerned when I was gone from the office for 2 consecutive weeks during an 11-week internship. Only after talking them through how I ended up taking such a long break have their legitimate concerns been calmed down. The context was that I went on holiday right after a week-long company event for the interns. It did not help that the event was a paid vacation abroad.\u003c/p\u003e\n\n\u003cp\u003eIn conclusion, similar to other aspects of working a day job, I learned only after starting working that taking time off comes with its own quirks and subtleties. Planning the holiday in advance increases the chances of meeting all deadlines and keeping all expectations in check. Narrowing it down to only a single point, communicating about the possibility of going on holiday is about respecting and building trust with the employer, the manager, and the team.\u003c/p\u003e\n\n  \u003c/div\u003e",
  "Date": "2022-05-11T13:00:05+01:00",
  "Author": "why.degree"
}