{
  "Source": "why.degree",
  "Title": "Junior what?",
  "Link": "https://why.degree/junior-what/",
  "Content": "\u003cdiv class=\"post-content e-content\" itemprop=\"articleBody\"\u003e\n    \u003cp\u003eTechnology evolved and developers can not understand everything anymore. So how does the world survive then? People specialise, that’s how! After you finish your degree, you don’t train to become a Computer Expert, but rather you focus on one area in particular: databases, security or WebDev, for example. Everyone knows that, yet not everyone knows all of the possible options from the start of their career.\u003c/p\u003e\n\n\u003cp\u003eBack in the day, I was part of a student society whose members were predominantly Computer Scientists, just like me. The nice thing about this society was that besides interacting with current members, you could also get a chance to talk with past members as well. That gave me the possibility to see what my prospects were: by talking to those older members, I could see where they ended up, and where I \u003cstrong\u003ecould\u003c/strong\u003e end up.\u003c/p\u003e\n\n\u003cp\u003eLong story short, it was through one of these members that I got to hear for the first time about the role of a \u003cem\u003eDeveloper Advocate\u003c/em\u003e. It blew my mind! Not because I did not expect \u003cem\u003esomebody\u003c/em\u003e to have this role, but because I was not aware that such a title existed. Until that moment, I have never \u003cem\u003ereally\u003c/em\u003e considered the specific paths I could take in my career. Of course, I knew that, for instance, some people worked mainly with Open Source, while others alternated between different projects all the time \u003cem\u003e(I’m talking about freelancing)\u003c/em\u003e, but I always put them under the same umbrella: Software Engineering.\u003c/p\u003e\n\n\u003cp\u003eAnd to some extent, that is right. However, the problem is that’s not enough. How can you take a job after you graduate and not look at all the options? Will you be satisfied if you go for the first free position? If not, you and I are alike. So the next question is obvious: \u003cstrong\u003ewhere do you find a complete list of all the available jobs?\u003c/strong\u003e\u003c/p\u003e\n\n\u003cp style=\"text-align: center;\"\u003e******\u003c/p\u003e\n\n\u003cp\u003eThe answer is \u003cem\u003edisappointing\u003c/em\u003e. I searched far and wide on the Internet and nowhere I could find such a list. At least not a full one. The reason for that is linked to the evolution of technology: in the same way new frameworks are out all the time, the industry creates new jobs all the time. Developer Advocacy was not a thing back when computers were invented because software companies did not need an appointed person to engage with the users and find out their opinions. A more concrete example is that of the Database Manager: it’s clear that there were no people in charge of databases \u003cem\u003euntil\u003c/em\u003e databases were invented.\u003c/p\u003e\n\n\u003cp\u003eNevertheless, don’t lose hope! Even though you can not find the list anywhere, you can create it yourself. The most important part to remember is that the job market is quite predictable. Just like the iPhone presented programmers with a whole new industry (\u003cstrong\u003eapp development\u003c/strong\u003e), so does every other piece of tech. In turn, this means that if you’re interested in one particular part of a system, there’s probably a job related to it, and that job has a title you’ve not encountered before.\u003c/p\u003e\n\n\u003cp\u003eWith that being said, I could go on and on about the differences between software and hardware-oriented jobs, between product managers and software developers, between maintainers and producers. I could even go deep into the details of software jobs in Biology, or History, or even Politics. But all that information is out there. It has been debated for years and this article would not add much to the discussion. The lesson you could take from here is that software is broad and you’re bound to specialise in order to get anywhere.\u003c/p\u003e\n\n\u003cp\u003eFinally, some words of encouragement that even senior software engineers would benefit from: \u003cstrong\u003eswitching niches after a few years is ideal\u003c/strong\u003e. Don’t spend too much time working on the same topic, as it might get boring. Instead, move on to a new field and start exploring from the ground. It’s going to be a lot more fun and you’re going to have a lot more \u003cem\u003efresh\u003c/em\u003e ideas.\u003c/p\u003e\n\n\u003cp\u003eIf you feel like I missed anything or you want to continue the discussion, leave a comment on \u003ca href=\"https://facebook.com/why.degree/\"\u003eFacebook\u003c/a\u003e or \u003ca href=\"https://twitter.com/whydegree\"\u003eTwitter\u003c/a\u003e or send a direct email at \u003ca href=\"/cdn-cgi/l/email-protection#d7a3b2bbbbbab297a0bfaef9b3b2b0a5b2b2\"\u003e\u003cspan class=\"__cf_email__\" data-cfemail=\"87f3e2ebebeae2c7f0effea9e3e2e0f5e2e2\"\u003e[email protected]\u003c/span\u003e\u003c/a\u003e.\u003c/p\u003e\n\n\u003ch1 id=\"references\"\u003eReferences:\u003c/h1\u003e\n\u003col\u003e\n  \u003cli\u003e\u003ca href=\"https://archive.org/details/james-burke-connections_s01e01\"\u003ehttps://archive.org/details/james-burke-connections_s01e01\u003c/a\u003e\u003cbr/\u003e\n– On the complexity of technology\u003c/li\u003e\n  \u003cli\u003e\u003ca href=\"https://medium.com/@ashleymcnamara/what-is-developer-advocacy-3a92442b627c\"\u003ehttps://medium.com/@ashleymcnamara/what-is-developer-advocacy-3a92442b627c\u003c/a\u003e\u003cbr/\u003e\n– Microsoft Employee on Developer Advocacy\u003c/li\u003e\n  \u003cli\u003e\u003ca href=\"https://www.prospects.ac.uk/careers-advice/what-can-i-do-with-my-degree/computer-science\"\u003ehttps://www.prospects.ac.uk/careers-advice/what-can-i-do-with-my-degree/computer-science\u003c/a\u003e\u003cbr/\u003e\n– On the prospects of a Computer Science degree\u003c/li\u003e\n  \u003cli\u003e\u003ca href=\"https://www.quora.com/What-are-some-career-paths-for-a-Computer-Science-major\"\u003ehttps://www.quora.com/What-are-some-career-paths-for-a-Computer-Science-major\u003c/a\u003e\u003cbr/\u003e\n– Another list of prospects, with more details this time\u003c/li\u003e\n  \u003cli\u003e\u003ca href=\"https://www.quora.com/What-is-the-role-of-software-engineering\"\u003ehttps://www.quora.com/What-is-the-role-of-software-engineering\u003c/a\u003e\u003cbr/\u003e\n– Simple question that hides the essence of the article\u003c/li\u003e\n  \u003cli\u003e\u003ca href=\"https://www.reddit.com/r/cscareerquestions/comments/2ew81o/what_is_the_truth_about_the_software_engineering/\"\u003ehttps://www.reddit.com/r/cscareerquestions/comments/2ew81o/what_is_the_truth_about_the_software_engineering/\u003c/a\u003e\u003cbr/\u003e\n– Discussion from 2014 that talks about employability in Software Engineering as a whole\u003c/li\u003e\n  \u003cli\u003e\u003ca href=\"https://thinkfractional.blog/secret-ipad/\"\u003ehttps://thinkfractional.blog/secret-ipad/\u003c/a\u003e\u003cbr/\u003e\n– On how one company managed to predict a new industry\u003c/li\u003e\n\u003c/ol\u003e\n\n  \u003c/div\u003e",
  "Date": "2020-04-18T13:00:05+01:00",
  "Author": "why.degree"
}