{
  "Source": "why.degree",
  "Title": "on probation",
  "Link": "https://why.degree/on-probation/",
  "Content": "\u003cdiv class=\"post-content e-content\" itemprop=\"articleBody\"\u003e\n    \u003cp\u003eIt’s recently been 6 months since I’d started working. Officially, my probation period has finally ended. As a preview, I feel more relaxed and confident about my work than when I started. It seems that my company feels happy with me as well. So we could say the probation period has been a success. I haven’t personally experienced any exam-like stress, and I don’t think there’s ever been a possibility of me getting fired. Nevertheless, I find the event worth mentioning.\u003c/p\u003e\n\n\u003cp\u003eIn general terms, the probation period assesses one’s ability to perform on the job, both from a professional point of view and from a social one. The company is interested in questions such as: “Can the employee deliver a product effectively?” and “Do they interact well enough with their colleagues?”. Sure, the interview process must have already answered some of these. However, it’s vastly better to predict someone’s long term performance by having them do the actual job. For example, I think an internship strikes the right balance between commitment and efficiency for young developers. Therefore, the probation period can be seen as the intermediate step between an internship and a full-time position.\u003c/p\u003e\n\n\u003cp\u003eSimilarly to most of my peers, my probation period has been highly dependent on my training. This is not the case for junior developers only: irrespective of any new employee’s experience level, they must undergo at least some training. Training I’ve been doing for half a year and training I’ll do for the foreseeable future. My mentor believes that learning by doing is correct the way to go hence why I’ve built so many scripts and tools to aid my understanding of the company’s internals. The majority of my projects have been focused on reporting and monitoring. One would mainly use these as one-off scripts. Of course, they could go one step further and add a new task in the job scheduler to run them at given intervals. These tools have taught me how to get what I need in terms of documentation and data. It is with their help I hit the first target of my probation. I can now immediately complete most tasks because I’ve transformed the job into an act of aggregating the data in different ways, according to any new project’s requirements.\u003c/p\u003e\n\n\u003cp\u003eThe second target has been more subtle: it involved innovating. It’s one thing to implement what you’re told, but it’s a whole other thing to come up with an idea in the first place. It’s taken me significantly longer to complete this step. A few months ago, of my own accord, I started implementing a framework that would abstract away some repetitive boilerplate code. This has quickly become effective, so much so that my mentor has asked me to ship it in production. Instead of having a list of requirements or a project description, I started with a blank sheet of paper waiting to be filled. The hardest part has probably been finding the optimal place to add my contribution, which, in turn, has prompted me to understand the structure of the product. After lots of work on establishing the separation between what needs exposing and what does not, it now lives gracefully on the main branch.\u003c/p\u003e\n\n\u003cp\u003eFinally, I’ve also progressed acceptably in the social aspect. I am on friendly terms with literally everyone in the company. Having been on a company trip has definitely made it an easy target. I would have otherwise had to schedule way too many coffee breaks and lunch trips. The company is naturally relatively small, but that only shows that I have to interact with almost everybody else. With all in mind, I am on a theoretically decent trajectory that will hopefully turn out accurate. With so much time and so many resources consumed, it probably will. Even though the exact details of the probation period can differ between companies, the general points are always the same: understand the culture and the tech, and it will be fine.\u003c/p\u003e\n\n  \u003c/div\u003e",
  "Date": "2022-03-16T12:00:05Z",
  "Author": "why.degree"
}