{
  "Source": "why.degree",
  "Title": "Hacker News Leaderboard",
  "Link": "https://why.degree/hn-leaderboard/",
  "Content": "\u003cdiv class=\"post-content e-content\" itemprop=\"articleBody\"\u003e\n    \u003cp\u003eHacker News is a great community for all things technology. It’s the place where I spend most of my free time, always impressed by the various people I get to meet. And so, with the mandatory excuses for directing my attention to such earthly matters, I wanted to check which users are the most active on the forum. The connoisseurs out there might already think \u003ca href=\"https://news.ycombinator.com/leaders\"\u003ehttps://news.ycombinator.com/leaders\u003c/a\u003e, yet that was not enough for me. I didn’t want an all-time, static ranking; I was interested in the most active people at this specific moment. As I could not find what I was looking for anywhere, I decided to build it myself. Now I can find the users that showed a huge engagement recently, the users that have something important to say. Check it out here: \u003ca href=\"https://why.degree/hn-top/\"\u003ehttps://why.degree/hn-top/\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp\u003eThis post is an example of a mini-project suitable for your portfolio. If you’re a junior like me, and you want to prove to a potential employer that you got what it takes to work for them, you most definitely need a portfolio. There is no better way to showcase your skills than building and shipping actual products.\u003c/p\u003e\n\n\u003cp\u003eTo this end, because I am planning on becoming a Developer Advocate, I chose to build something related to this line of work. In more concrete terms, I decided to work with the Hacker News API and inspire others to use it as well, by writing about one possible application. Although extremely simple, the idea behind this example provides a generalised thought process that can be summarised as follows:\u003c/p\u003e\n\u003cul\u003e\n  \u003cli\u003eI knew what job I’d like to have\u003c/li\u003e\n  \u003cli\u003eI understood the requirements for the job\u003c/li\u003e\n  \u003cli\u003eI identified a problem related to my daily activities\u003c/li\u003e\n  \u003cli\u003eand finally, I provided a solution for that problem\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eNotice how I emphasised on the personal aspect: \u003cstrong\u003ea problem related to my daily activities\u003c/strong\u003e. By treating the project as a way to make my life better, it’s not only that I genuinely improved the quality of whatever it was that I was doing, but ultimately I ended up telling a better story. Remember that the goal should be to present your skills, and how you achieve that is as valuable as the product itself.\u003c/p\u003e\n\n\u003cp style=\"text-align: center;\"\u003e******\u003c/p\u003e\n\n\u003cp\u003eLet’s begin! I would first like to introduce you to \u003ca href=\"https://news.ycombinator.com/\"\u003eHacker News\u003c/a\u003e. You can see that it has a generic interface, displaying 30 entries with a few important details for each one of them: \u003cem\u003etitle\u003c/em\u003e, \u003cem\u003eauthor\u003c/em\u003e, \u003cem\u003esource\u003c/em\u003e, \u003cem\u003e#points\u003c/em\u003e, \u003cem\u003e#comments\u003c/em\u003e.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg src=\"/assets/example-explained.png\" alt=\"story explained\"/\u003e\u003c/p\u003e\n\n\u003cp\u003eComments are normal entries, that only have an \u003cem\u003eauthor\u003c/em\u003e, and some comments under them. If you’re the author of the comment, you can also see \u003cem\u003e#points\u003c/em\u003e.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg src=\"/assets/comment.png\" alt=\"comment example\"/\u003e\u003c/p\u003e\n\n\u003cp\u003eNow that you’re comfortable with the platform, here’s their \u003ca href=\"https://github.com/HackerNews/API\"\u003eAPI\u003c/a\u003e, which is free at the moment, thus making it a great way to try out implementing a bunch of different things. For example, you could use it to build an extension for the page, possibly focusing on following some users in particular, while also blocking others.\u003c/p\u003e\n\n\u003cp\u003eWhat I have in mind is building a leaderboard for the most active users in the current top 30 stories on the website. Obviously, for that, I need a method of getting the \u003ca href=\"https://github.com/HackerNews/API#new-top-and-best-stories\"\u003etop stories\u003c/a\u003e, together with their \u003ca href=\"https://github.com/HackerNews/API#items\"\u003ecomments\u003c/a\u003e, and aggregating everything based on the author. This is simply done with only a couple of calls to the server. As the response to every such call is in JSON, I can just deserialise it and take the \u003cstrong\u003e‘by’\u003c/strong\u003e field out. Computing the score for each author can be done using a key-value structure, e.g. a \u003cem\u003edictionary\u003c/em\u003e in Python. You can see the full code on my Github profile or by clicking \u003ca href=\"https://github.com/whydegree/HN-Leaderboard\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp\u003eThe last part of the project is to host the results \u003cstrong\u003elive\u003c/strong\u003e on the internet. With a bit of HTML and the magic of Cron, the final result is available at the following address: \u003ca href=\"https://why.degree/hn-top/\"\u003ehttps://why.degree/hn-top/\u003c/a\u003e. I wanted to have a fully working, end-to-end solution. I could have stopped at the first working step: the leaderboard on my machine, but that wouldn’t have been fun.\u003c/p\u003e\n\n\u003cp\u003eIn conclusion, the message you should take out of here is that you should work on something, no matter how easy it is. If you plan to be a coder, go out there and build a prototype for your new app. Deliver a product and try to tell a story while you’re at it.\u003c/p\u003e\n\n\u003cp\u003eIf you feel like I missed anything or you want to continue the discussion, leave a comment on \u003ca href=\"https://facebook.com/why.degree/\"\u003eFacebook\u003c/a\u003e or \u003ca href=\"https://twitter.com/whydegree\"\u003eTwitter\u003c/a\u003e or send a direct email at \u003ca href=\"/cdn-cgi/l/email-protection#e89c8d8484858da89f8091c68c8d8f9a8d8d\"\u003e\u003cspan class=\"__cf_email__\" data-cfemail=\"3d4958515150587d4a55441359585a4f5858\"\u003e[email protected]\u003c/span\u003e\u003c/a\u003e.\u003c/p\u003e\n\n\u003ch1 id=\"references\"\u003eReferences:\u003c/h1\u003e\n\u003col\u003e\n  \u003cli\u003e\u003ca href=\"https://youtu.be/bK2iPDu7RDE\"\u003ehttps://youtu.be/bK2iPDu7RDE\u003c/a\u003e\u003cbr/\u003e\n– Presentation on solving the parking problem in New York City\u003c/li\u003e\n\u003c/ol\u003e\n\n  \u003c/div\u003e",
  "Date": "2020-05-01T13:00:05+01:00",
  "Author": "why.degree"
}