{
  "Source": "mikelevins.github.io",
  "Title": "What do you mean, you're an anarchist?",
  "Link": "https://mikelevins.github.io/posts/2020-09-19-what-do-you-mean/",
  "Content": "\u003cdiv class=\"post\"\u003e\n\n\t\t\t\t\t\u003cdiv class=\"post-heading\"\u003e\n\t\t\t\t\t\t\u003ch1\u003eWhat do you mean, you\u0026#39;re an anarchist?\u003c/h1\u003e\n\t\t\t\t\t\t\u003cspan class=\"post-date\"\u003e\u003ca href=\"https://mikelevins.github.io/posts/2020-09-19-what-do-you-mean/\"\u003e# Sep 19, 2020\u003c/a\u003e\u003c/span\u003e\n\t\t\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\u003cp\u003eOnce in a while it comes up in conversation that I consider myself an\nanarchist. Most of the time when people learn that, they have one of\nthree reactions:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eI’m kidding (or exaggerating, or engaging in some kind of hyperbole for effect)\u003c/li\u003e\n\u003cli\u003eI’m serious, and crazy\u003c/li\u003e\n\u003cli\u003eI’m serious, and they want to know what the heck I mean and how I can hold that position\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eWell, I’m not kidding, and as far as I know, I’m not crazy, so maybe I\nshould say what I mean and how and why I hold the position I do.\u003c/p\u003e\n\u003cp\u003ePart of the problem is that “anarchist” is a loaded word, as are its\ncognates “anarchy” and “anarchism”. Usually when people mention\n“anarchy” in casual conversation, they mean violent social\ndisorder. To be clear, I do not advocate violent social disorder.\u003c/p\u003e\n\u003cp\u003eOther meanings people commonly have in mind are lawlessness, or\nrefusal to be involved in organizations or to honor social\nconventions. I don’t advocate any of those things, either.\u003c/p\u003e\n\u003cp\u003eFinally, people may think of the familiar trope of “bomb-throwing\nanarchists”, and I’m not one of those, either.\u003c/p\u003e\n\u003cp\u003eWhen I say I am an anarchist, I mean something fairly specific: I mean\nthat I don’t believe in the legitimacy of state authority.\u003c/p\u003e\n\u003cp\u003eThose are more loaded words that probably don’t do a good job of\nsaying what I mean, so I’ll unpack them some more.\u003c/p\u003e\n\u003cp\u003eBy “state” I mean something approximating the definition given by the\nPrussian sociologist Max Weber: a human community that successfully\nclaims a monopoly on the legitimate use of physical force within a\ngiven territory.\u003c/p\u003e\n\u003cp\u003eAnother way to say it is that a state is a gang that dominates or\nexcludes all competing gangs in its territory, claims that its rule is\nlegitimate, and gets away with it.\u003c/p\u003e\n\u003cp\u003eMy objection is that claiming your rule is legitimate in the absence\nof anyone capable of challenging you is not enough to actually make\nyour rule legitimate. It may make you the de facto ruler; it does not\ntherefore make you the legitimate ruler.\u003c/p\u003e\n\u003cp\u003eMany people argue, in effect, that somebody has to be in charge,\ntherefore whoever actually is in charge is the legitimate authority. I\ndon’t buy it. That would mean that there is no such thing as a\njustified insurrection or revolution, that any kind of regime change\nis necessarily illegitimate.\u003c/p\u003e\n\u003cp\u003eI think not. We can point to various rebellions that are generally\nheld to be justified. Some of them are regarded as the roots of\nlegitimate social orders. The obvious example is the American\nRevolution, a rebellion against an overweening state that is generally\nseen as the birth of a new (and legitimate) social order, but there\nare others, as well.\u003c/p\u003e\n\u003cp\u003eMy point here is that even people who argue in this way usually allow\nthat at least some rebellions are right and proper. That can’t be true\nif mere de facto rulership is enough to confer legitimacy.\u003c/p\u003e\n\u003cp\u003eSo there must be something that distinguishes legitimate from\nillegitimate social orders. I think that something is voluntary\ncontract.\u003c/p\u003e\n\u003cp\u003eIf you have entered voluntarily into an agreement, and if it’s not an\nagreement that reasonable people would find unconscionable or coerced,\nthen you have an obligation to abide by it. If you fail to abide by\nit, then you owe some reasonable compensation for your failure.\u003c/p\u003e\n\u003cp\u003eBut if someone particularly strong and forceful comes along and tells\nyou that this is now his territory and you are obliged to follow his\nrules, that doesn’t obligate you to do so. That’s not a legitimate\nagreement.\u003c/p\u003e\n\u003cp\u003eEven if that ruler has overwhelming force on his side, it doesn’t mean\nhe’s in the right claiming jurisdiction over you. It may be in his\npower to command you, but that doesn’t therefore make it within his\nrights. You may comply to avoid serious consequences, but that doesn’t\nmake you wrong if you don’t.\u003c/p\u003e\n\u003cp\u003eWe are bound to a compact to the degree that we have knowingly and\nvoluntarily entered into it and agreed to be bound by it. We owe\nfulfillment of promises knowingly made. We do not owe fulfillment of\naspirations imposed on us without our knowledge or consent.\u003c/p\u003e\n\u003cp\u003eThat doesn’t mean it’s a good idea to violate all of the norms that\nother people seek to hold us to. Some of them are just good\nsense. Basically, don’t make war on your neighbors\nunnecessarily. Doing so is wicked and foolish.\u003c/p\u003e\n\u003cp\u003eSome conventions that you are asked to obey are not necessarily right\nor just, but refusing would carry a high cost without prospect of a\ncompensating benefit. In other words, you may think the rules imposed\nby the state are unjust or foolish, but it’s equally foolish to flout\nthem for no good purpose, especially if you stand little chance of\nsucceeding.\u003c/p\u003e\n\u003cp\u003eWhy bother to think this way? What does it accomplish?\u003c/p\u003e\n\u003cp\u003eI run into that objection sometimes. The simplest answer I can make is\nthat it’s the way I do think, and it happens naturally, without any\nparticular calculation on my part. I could as easily ask someone, “Why\ndon’t you think this way?”\u003c/p\u003e\n\u003cp\u003eBut I can make another argument.\u003c/p\u003e\n\u003cp\u003eSometimes people object that a peaceful anarchy is impossible and will\nnever happen, so it’s pointless to hold the position that I do.\u003c/p\u003e\n\u003cp\u003eI think there are valid objections to that claim, but I’d rather\nobserve that a person making this kind of argument probably doesn’t\nreally believe it, or its ramifications.\u003c/p\u003e\n\u003cp\u003eApproximately no one thinks robbery and murder are okay. Approximately\nno one thinks they will ever be entirely eliminated once and for\nall. Does that mean that we should approve of them? Of course not.\u003c/p\u003e\n\u003cp\u003eIn the same way, believing that the state will always be around does\nnot mean you must therefore approve of it. I do not approve.\u003c/p\u003e\n\u003cp\u003eWishing for a more voluntary basis for legitimate authority is not\nentirely a pipe dream. There is historical precedent in legal systems\nbased on voluntary courts. One example is that of medieval\nIceland. Another is the Lex Mercatoria. Others are the Xeer courts of\nold Somalia, or Anglo Saxon hundredcourts, and other relevant examples\nexist.\u003c/p\u003e\n\u003cp\u003eThese are systems of law based on voluntary agreement and negotiated\nsettlements that existed for centuries without strong central\nauthorities to enforce their provisions. In Weber’s terminology, they\nare examples of stateless societies. There was no singular entity\nclaiming a monopoly on legitimate use of force in a defined\nterritory. Instead, such legal systems often overlapped with\nneighboring, competing ones, functioning more like a market for legal\nprotections than a state.\u003c/p\u003e\n\u003cp\u003eOnce it becomes clear that such systems have actually existed, a\ncommon objection is that they must have been inferior because they\ndidn’t last forever. Well, no system lasts forever, and if it did,\nthat wouldn’t make it good in any way other than longevity. The\ndespotism of Pharaonic Egypt lasted for millennia, but that doesn’t\nmean we should prefer it.\u003c/p\u003e\n\u003cp\u003eStill, as I said, voluntary legal systems have sometimes lasted for\ncenturies. In one case, such a system lasted into modern times: the\npresent day international system of commercial law is essentially the\nLex Mercatoria under another name.\u003c/p\u003e\n\u003cp\u003eWere voluntary legal systems paradise? Of course not. Neither is any\nother known legal system.\u003c/p\u003e\n\u003cp\u003eThey were better in some ways than what we are currently accustomed\nto, and probably worse in others. But the authority wielded by a\nvoluntary court in adjudicating voluntary agreements is an authority I\ncan believe in.\u003c/p\u003e\n\u003cp\u003e“Might makes right” isn’t.\u003c/p\u003e\n\n\n\t\t\t\t\u003c/div\u003e",
  "Date": "2020-09-19T00:00:00Z",
  "Author": "mikel evins"
}