{
  "Source": "mikelevins.github.io",
  "Title": "Thinkbox",
  "Link": "https://mikelevins.github.io/posts/2021-02-09-thinkbox/",
  "Content": "\u003cdiv class=\"post\"\u003e\n\n\t\t\t\t\t\u003cdiv class=\"post-heading\"\u003e\n\t\t\t\t\t\t\u003ch1\u003eThinkbox\u003c/h1\u003e\n\t\t\t\t\t\t\u003cspan class=\"post-date\"\u003e\u003ca href=\"https://mikelevins.github.io/posts/2021-02-09-thinkbox/\"\u003e# Feb 9, 2021\u003c/a\u003e\u003c/span\u003e\n\t\t\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\u003cp\u003e\u003ca href=\"https://fosdem.org/2021/schedule/speaker/liam_proven/\"\u003e\u003cstrong\u003eLiam Proven\u003c/strong\u003e\u003c/a\u003e presented a talk at \u003ca href=\"https://fosdem.org/2021/\"\u003eFOSDEM 2021\u003c/a\u003e called “Starting Over” that reminded me of an old and cherished idea of mine from the early 1990s. I called it “ThinkBox”.\u003c/p\u003e\n\u003cp\u003eI tried pitching it to other people repeatedly through the 90s. I’m pretty weak in the area of self confidence, which makes me a poor salesman, and ThinkBox in its full form is a complex idea. The combination of self-doubt and complicated ideas is not a recipe for taking the world by storm.\u003c/p\u003e\n\u003cp\u003eA couple of smart people got it, though, or parts of it. Unfortunately, none were in a position to carry it forward, so I worked on little pieces of it here and there as parts of other projects.\u003c/p\u003e\n\u003cp\u003eOne person, to whom I pitched a small and limited corner of the idea, and who is now a Silicon Valley venture capitalist, objected that, although the idea was likely to work, the capitalization barrier was too high for him to act on at the time I pitched it.\u003c/p\u003e\n\u003cp\u003eFair enough.\u003c/p\u003e\n\u003cp\u003eI’m mildly mollified to observe that someone else developed essentially the same idea into a company whose market capitalization is now in the tens of billions of dollars. Of course, that doesn’t help me or ThinkBox any.\u003c/p\u003e\n\u003cp\u003eI’m not a better salesman now than I was in the 1990s. Still, the FOSDEM presentation reminded me of ThinkBox and made me think that it might be worth describing again. It might find receptive minds. Maybe I’ll do a better job this time. Maybe someone will take it and run with it.\u003c/p\u003e\n\u003cp\u003eI’ll attempt a sort of cartoon version and see if that works.\u003c/p\u003e\n\u003cp\u003eImagine that you have a personal computer–a \u003cem\u003ereally\u003c/em\u003e personal computer. I mean, it comes into existence with you and accompanies you throughout your life. It contains everything you think or say or look at or think that you want to remember and keep handy. And it’s \u003cem\u003ereally\u003c/em\u003e personal: it’s absolutely impossible for anyone to gain control over it or access to any of its contents without your explicit permission.\u003c/p\u003e\n\u003cp\u003eThat’s ThinkBox. It’s a permanent thought balloon that goes everywhere with you all the time and contains everything you want to have available whenever and wherever you want it, forever.\u003c/p\u003e\n\u003cp\u003eThe tools in ThinkBox are the best tools you’ve found for whatever it is you wish to do. They, too, are entirely under your control. They belong to you, and they work exactly the way you want them to. They do exactly what you want, and nothing else. No one else has the power to control or influence them in any way that is contrary to your wishes.\u003c/p\u003e\n\u003cp\u003eThinkBox is not a hardware computer, because any specific hardware can get old and fail, or be stolen or sabotaged or subverted.\u003c/p\u003e\n\u003cp\u003eThinkBox is not a cloud service, because the cloud is just someone else’s computer, and what someone else owns, someone else controls. ThinkBox is, by definition, \u003cem\u003eyours\u003c/em\u003e.\u003c/p\u003e\n\u003cp\u003eThinkBox is a virtual computer that exists in a virtual realm. Any specific hardware device is only a view of your ThinkBox. Your laptop or phone or desktop or tablet is not your ThinkBox; it’s just a peripheral that you use to gain access to your ThinkBox. Subtract you and the device is not your ThinkBox; it’s just a generic device.\u003c/p\u003e\n\u003cp\u003eWithout any device, ThinkBox is inaccessible, but it’s not gone. Obtain and properly configure a device and your ThinkBox is accessible to you again.\u003c/p\u003e\n\u003cp\u003eI first thought of the idea of ThinkBox in the early 1990s, around the time that I was working on Apple’s Newton. I had some intuitions about the direction that computing was headed, and they resolved themselves into a sort of apocalyptic vision: either we invent something like ThinkBox, or we are headed for a dystopian future.\u003c/p\u003e\n\u003cp\u003eThe dystopian alternative was one in which everyone in the world is networked and surveilled and all of their activity and their ideas and their work belongs to someone else, to companies or governments who own all the networks and storage and who hoover up everything you do and say and think. I feared that without something like ThinkBox, we would all gradually be turned into serfs by the forthcoming evolution of computer technology.\u003c/p\u003e\n\u003cp\u003eI was too optimistic.\u003c/p\u003e\n\u003cp\u003eWe did not invent ThinkBox, but we haven’t become serfs; we’ve become livestock. We are cattle who produce data for companies and governments to harvest. Our interests and utterances and thoughts and genomes and health and financial records aren’t ours; they are resources to be harvested and traded by others.\u003c/p\u003e\n\u003cp\u003eWe haven’t yet seen the worst consequences of these developments, but the verdict of history is clear: people only have rights over what they can own and defend. We’ve made our data valuable, but we haven’t made it defensible. The consequences will be what they always are, what they always have been throughout history: those who produce something that is valuable and not defensible will be owned by those who are willing and able to take it.\u003c/p\u003e\n\u003cp\u003eExperience suggests to me that many readers will object that ThinkBox is a pie-in-the-sky dream, but as I’ve said, I’ve worked on various projects that explored various technical aspects of it. I’m willing to claim that I’m not dreaming, that everything we need for ThinkBox is technically possible. The obstacles to ThinkBox are not technical, but social. We could have built it in the 1990s with the right vision and the right team. Technically speaking, it would be easier to build now than it was then.\u003c/p\u003e\n\u003cp\u003eThe problem is that building it would be a lot of work. Evangelizing it would be a lot more work. Building the social and legal frameworks would be even more work.\u003c/p\u003e\n\u003cp\u003eLiam Proven’s FOSDEM talk offered some plausible starting points–technical starting points, at least. It got some details wrong–for example, SK8 was never an IDE for Dylan. Dylan and SK8 were completely separate projects that had nothing to do with each other, except that both were built in Macintosh Common Lisp, and there was a little cross pollenation of personnel between them.\u003c/p\u003e\n\u003cp\u003eNevertheless, his basic point stands: the history of computing contains some gems that could form technical foundations for a more personal, understandable, controllable kind of computing. He proposes a couple of ideas that could form the basis for further development.\u003c/p\u003e\n\u003cp\u003eHe’s not wrong.\u003c/p\u003e\n\u003cp\u003eIt’s not quite enough, though. The technical possibility is there. The open question is whether people can be made to understand the shape of the world we’re building and motivated to build a road out of the feed lot. We’re already getting pretty used to the pasture, and I’ve no doubt that some people will dismiss my remarks as the paranoid ravings of an old neckbeard.\u003c/p\u003e\n\u003cp\u003eBut maybe hobbyists like Liam Proven will save us.\u003c/p\u003e\n\n\n\t\t\t\t\u003c/div\u003e",
  "Date": "2021-02-09T00:00:00Z",
  "Author": "mikel evins"
}