{
  "Source": "mikelevins.github.io",
  "Title": "Obamus Caesar",
  "Link": "https://mikelevins.github.io/posts/2009-05-25-obamus-caesar/",
  "Content": "\u003cdiv class=\"post\"\u003e\n\n\t\t\t\t\t\u003cdiv class=\"post-heading\"\u003e\n\t\t\t\t\t\t\u003ch1\u003eObamus Caesar\u003c/h1\u003e\n\t\t\t\t\t\t\u003cspan class=\"post-date\"\u003e\u003ca href=\"https://mikelevins.github.io/posts/2009-05-25-obamus-caesar/\"\u003e# May 25, 2009\u003c/a\u003e\u003c/span\u003e\n\t\t\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\u003cp\u003eIn 27 B.C., Augustus Caesar became the first emperor of Rome, marking\nthe final end of the Roman Republic. While officially praising and\nrespecting Rome’s republican laws and traditions, he laid the\ngroundwork for five centuries of autocracy that have become synonymous\nwith despotism and corruption.\u003c/p\u003e\n\u003cp\u003eIt has been common since the founding of the American republic to\ncompare and contrast it with that of ancient Rome, and the comparison\ncan be entertaining, and maybe even informative, if we don’t try to\nmake the analogy closer than it really is. The American presidency is\nnot, of course, an hereditary monarchy. The powers granted to the\noffice are not absolute. America is not Rome.\u003c/p\u003e\n\u003cp\u003eYet the Roman emperor’s office did not start out as an absolute or\nhereditary monarchy either. In fact, Augustus and his immediate\nsuccessors never held any such office as “Emperor;” Rome had no such\noffice. They were called “Imperator,” but that simply meant commander\nof Rome’s legions, like our own “Commander in Chief.” The Roman\nImperator didn’t even have the domestic authority wielded by the\nAmerican President. Augustus became “emperor,” not through succession\nto a throne, but by adept political maneuvering and deal-making–and\nthe shedding of just the right blood, of course. He held power and\nauthority that are nowhere described or granted in Rome’s laws or\ntraditions. Rome was a republic on paper long after its first emperor\nhad consolidated his power.\u003c/p\u003e\n\u003cp\u003eAt what point was the Republic over, and the Empire established? Did\nRomans during the reign of Augustus know that the Republic was dead?\nSurely, they must have. They lamented its passing while Julius Caesar\nstill lived. We can measure the death of the Republic by the\ndisappearance of those laments. After the civil wars were over, and\nAugustus was established in power, he “restored” the Senate, by which\nwe mean that he told the Senate and the people publicly that power was\nback in their hands, while privately making sure that his hands were\nthe ones on all the important levers. Gradually the laments over the\ndeath of the Republic were replaced by praise for its continued\nvitality, and Romans once again spoke in praise of the Republic and\nthe rights of free Romans.\u003c/p\u003e\n\u003cp\u003eIt was a sham, of course. We can look back and with a superior smile\nacknowledge what everyone knows: that after the ascension of Augustus,\nthe Romans may have said they were “free citizens” of a “free\nRepublic,” but they were in fact subjects of an autocrat, the first in\na line that would continue for five centuries and stand forever after\nas the paradigm of despotism.\u003c/p\u003e\n\u003cp\u003eRome did not declare itself an autocracy; its monarchy was\nfurtive. Its citizens wanted to think that they were free people, that\ntheir government was constitutionally limited by its laws and\ntraditions, that there were “no kings in Rome.” We can chuckle, but\nwhat will posterity say of us?\u003c/p\u003e\n\u003cp\u003eOn May 21st, President Barak Obama proposed a new policy of “prolonged\ndetention,” a euphemism for indefinite imprisonment without trial or\ncharge. His proposal is a breathtaking power-grab, a long step beyond\nthe worst excesses of the Bush Administration. What’s more, he\nproposed it as the capstone of a speech, delivered in front of the\ndocument itself, praising the lasting value of the “rule of law” and\nthe limits placed on government power by the U.S. Constitution. That’s\nirony that you can feel in your belly.\u003c/p\u003e\n\u003cp\u003ePerhaps it’s as I began to think during the presidency of George\nW. Bush: perhaps the American electorate really doesn’t care about the\nConstitution anymore. That numbness has been coming for\ngenerations. Presidents and congresses have been trampling the\nboundaries of the Constitution and tearing holes in it almost since it\nwas ratified. Each generation extends new outrages past the outer\nlimits of the last, until we are asked to accept legal interpretations\nof its once-plain language that should embarrass any reasonable\nperson.\u003c/p\u003e\n\u003cp\u003eThomas Jefferson fretted over the Louisiana Purchase, suffering\nmisgivings because he didn’t believe the Constitution granted him the\npower to do it. 139 years later, the U.S. Supreme Court could rule\nwith straight faces (in Wickard v. Filburn) that the commerce clause\nof the Constitution grants to the federal government the power to\nregulate what a man does with grain produced by his own hands on his\nown land for his own use. By that point Americans were already living\nwith a system of government whose relationship to its charter was\ntenuous, if not surreal.\u003c/p\u003e\n\u003cp\u003eAt least, though, politicians had to \u003cem\u003esay\u003c/em\u003e that they respected the\nConstitution. That seems now to have changed. During the presidency of\nGeorge W. Bush, he is rumored to have said “Stop throwing the\nConstitution in my face. It’s just a goddamned piece of paper!” The\nremark itself is not all that interesting. No one who was present at\nthe meeting was willing to go on record saying that it happened\n(though more than one was willing to say so privately), and even if we\ncould prove that he did say it, people say all sorts of ill-considered\nthings without dire consequences. What is more interesting is that the\nAmerican public didn’t much seem to care. That remarkable utterance\nstimulated no public outrage whatsoever.\u003c/p\u003e\n\u003cp\u003eEvidently, the same public whose elected representatives had impeached\na president for cheating on his wife couldn’t bring themselves to care\nwhether his successor meant what he said when he swore to “preserve,\nprotect, and defend” the Constitution of the United States. Evidently,\nAmericans now regard that oath as a bit of theater required by\ntradition, and nothing more, just as the Romans felt obliged to keep\nvoting certain offices to Augustus, though there was certainly no\ndanger that he would lose power without them.\u003c/p\u003e\n\u003cp\u003eAt the end of that president’s term of office, during the election to\nreplace him, only one candidate made an issue of the Constitution’s\nlimits on federal power. That candidate was dismissed early as a\ncrank. His critics were perhaps premature; Ron Paul went on to raise\nfar more money, attract far more media attention, and make far more\nsalient points than anyone expected him to. Still, the common\nconsensus remained that he was a fringe candidate, if not a bit of a\nnut. And why? Because he was resolutely committed to the limits the\nU.S. Constitution places on governmental authority. How quaint!\u003c/p\u003e\n\u003cp\u003eWe have passed a turning point. The common knowledge is not what it\nwas when I was a child. Once, people took for granted that the\nConstitution seriously limited the powers of government\nofficials. That notion was wishful thinking, even then; Civil War and\nits attendant calamities, economic depression, and facile court\nrulings had long since turned the Constitution into a paper tiger.\nBut public servants were at least expected to act out a pantomime of\nrespect for it.\u003c/p\u003e\n\u003cp\u003eWe’re in a new era now. Barack Obama can stand in front of the\nConstitution and make a lovely speech praising its virtues and the\n“rule of law” as a prelude to calling for an act of naked\ndespotism. Oh, the usual commentators are shocked and appalled, but\nthere will be another news story tomorrow. And anyway, our own Lex\nGalbina, the Military Commissions Act of 2006, is still on the books,\nalong with more than a century of retreat from the clear limits and\nprovisions of the Constitution.\u003c/p\u003e\n\u003cp\u003eAugustus is generally regarded as the first Roman emperor, although he\nnever officially held any such office, and although Rome went on for\nsome time pretending that it was still a republic.\u003c/p\u003e\n\u003cp\u003eIs that where we are now? A candidate in America wouldn’t get far by\nopenly scoffing at the Constitution in so many words, but it’s already\nokay to scoff at those who take the Constitution seriously. It’s okay,\nonce you’re elected, to say “it’s just a goddamn piece of paper,” or\nto laud it with praises and in the same breath grab for despotic\npower.\u003c/p\u003e\n\u003cp\u003eHail Obamus Caesar, Consul of the American Republic.\u003c/p\u003e\n\n\n\t\t\t\t\u003c/div\u003e",
  "Date": "2009-05-25T00:00:00Z",
  "Author": "mikel evins"
}