{
  "Source": "mikelevins.github.io",
  "Title": "On young-earth creationism",
  "Link": "https://mikelevins.github.io/posts/2020-02-16-on-young-earth-creationism/",
  "Content": "\u003cdiv class=\"post\"\u003e\n\n\t\t\t\t\t\u003cdiv class=\"post-heading\"\u003e\n\t\t\t\t\t\t\u003ch1\u003eOn young-earth creationism\u003c/h1\u003e\n\t\t\t\t\t\t\u003cspan class=\"post-date\"\u003e\u003ca href=\"https://mikelevins.github.io/posts/2020-02-16-on-young-earth-creationism/\"\u003e# Feb 16, 2020\u003c/a\u003e\u003c/span\u003e\n\t\t\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\u003cp\u003eOnce, around ten years ago, someone in an online discussion said that\nthey were raised as a young-earth creationist, but had become curious\nabout the scientific account of the natural world and how it\nworked. They wanted to know what the problems with young-earth\ncreationism were, from a scientific perspective.\u003c/p\u003e\n\u003cp\u003eI offered them the best answer I could manage. Here it is:\u003c/p\u003e\n\u003cp\u003eThe first thing you have to do is set aside God as an\nexplanation. Sure, if you assume there’s an omnipotent, omniscient,\nsupernatural creator, then you can explain anything by saying, “It’s\nGod’s will.” The problem is, that doesn’t really explain anything. It\ndoesn’t tell you anything that you didn’t already know.\u003c/p\u003e\n\u003cp\u003eTake infectious disease, for example. It’s been a scourge of the human\nrace since prehistory. Saying, “It’s God’s will,” or “the will of the\ngods,” for thousands of years didn’t help people discover the causes\nor cures for diseases. What did help was examining the natural world\nwith a curious mind, and seeking to understand what was found.\u003c/p\u003e\n\u003cp\u003eCurious people found out that there are tiny organisms, too small to\nsee, and they’re everywhere. Some of them can colonize our bodies, and\nsome of those cause diseases. There are also chemicals we can use to\ncounter those invading organisms, and those chemicals help us defend\nourselves against many diseases.\u003c/p\u003e\n\u003cp\u003eWe didn’t learn those things from saying “disease is God’s\nwill”—regardless of whether it is or isn’t. We learned them from\nlooking at the evidence that the natural world gives us and reasoning\nabout what we found.\u003c/p\u003e\n\u003cp\u003eSo the first thing you do is set God aside. Then you collect evidence\nand see where it leads you. You try to find natural explanations for\nthe evidence that you find.\u003c/p\u003e\n\u003cp\u003eSo far, that approach has been spectacularly successful.\u003c/p\u003e\n\u003cp\u003eFrom that perspective, there are some serious problems with\nyoung-earth creationism.\u003c/p\u003e\n\u003cp\u003eFor example, living things are made of lots of carbon, hydrogen,\noxygen, and nitrogen, and smaller amounts of other things. There’s\nmore than one kind of carbon, each identified by an atomic number. You\ncan find both carbon 12 and carbon 14 in living things.\u003c/p\u003e\n\u003cp\u003eIt turns out that carbon 14 is radioactive, which means that it falls\napart, turning into atoms that aren’t carbon 14 anymore. This happens\nat a predictable rate: if you keep a lump of carbon 14 around for 5730\nyears, you’ll find out that half of it isn’t carbon 14 anymore; it’s\nturned into carbon 12.\u003c/p\u003e\n\u003cp\u003eSo that should mean that eventually all the carbon 14 should\ndisappear, right? It should all turn into carbon 12. Except that\nradiation from space striking the earth’s upper atmosphere keeps\nmaking more of it at a pretty steady rate. It rains down and mixes\ninto the atmosphere and gets carried all over the world.\u003c/p\u003e\n\u003cp\u003eOne kind of carbon is as good as another to living things, so plants\nabsorb it, animals get it by eating the plants or each other, and it\nends up in everything living.\u003c/p\u003e\n\u003cp\u003eThis, too, happens at a steady, predictable rate: out of every\ntrillion carbon atoms in a living creature, one of them is carbon 14.\u003c/p\u003e\n\u003cp\u003eBut remember: carbon 14 is radioactive. It falls apart. After 5730\nyears, only one atom in \u003cem\u003etwo\u003c/em\u003e trillion will be carbon 14, unless the\nliving thing keeps adding more.\u003c/p\u003e\n\u003cp\u003eWell, when creatures are alive, they \u003cem\u003edo\u003c/em\u003e keep adding more, by\nconsuming it from their environment. But when they die, they stop\nadding carbon 14. The carbon 14 doesn’t stop falling apart, though; it\nkeeps on turning into carbon 12. The longer the corpse lies there, the\nmore of it falls apart at that steady, predictable rate. So if you\nmeasure the carbon 14 in a corpse, you can use simple arithmetic to\nfigure out how long ago it died.\u003c/p\u003e\n\u003cp\u003eWhen you do that with a lot of dead things, you find out that some of\nthem died more than 6000 years ago. In fact, a whole lot of them died\n\u003cem\u003eway\u003c/em\u003e more than 6000 years ago.\u003c/p\u003e\n\u003cp\u003eThis isn’t the only way to find out how old things are, by the\nway. You can measure age by the radioactive decay of elements besides\ncarbon. You can use other natural processes that happen at steady\nrates, like the deposition of silt, or the changes in magnetism\nrecorded in rocks, or the rate that minerals trap ions the solar wind\nand cosmic rays. When you use several different measures of age and\nget close to the same result, you can be pretty confident that you\nknow the age of the thing you’re measuring.\u003c/p\u003e\n\u003cp\u003eWe’ve collected age measurements for a lot of things at this point. We\nhave tons of animal and plant remains that are millions—or in some\ncases billions—of years old. We have minerals that are millions or\nbillions of years old. We have astronomical evidence of things in\nspace that are millions or billions of years old.\u003c/p\u003e\n\u003cp\u003eSo now our naturalistic picture of the world needs to account for the\nfact that we’ve found all this evidence of very old things. For\nexample, we need to account for living things that died a lot more\nthan 6000 years ago.\u003c/p\u003e\n\u003cp\u003eNow, we could just say that God created the world with all that\nevidence already in it. That’s cheating, though. Remember: the rules\nare that we look for \u003cem\u003enatural\u003c/em\u003e explanations. That’s science. If we\nresort to supernatural explanations then we’re doing theology, not\nscience.\u003c/p\u003e\n\u003cp\u003eAlso, we’d have to wonder why the creator planted gobs of evidence\nthat the world is billions of years old, if he wanted us to believe\nthat it isn’t, but that’s not science, either\u003c/p\u003e\n\u003cp\u003eThe simplest natural explanation for dead bodies more than 6000 years\nold is that the earth is more than 6000 years old.\u003c/p\u003e\n\u003cp\u003eIf you run through the mountains of evidence that scientists have\naccumulated over the past five hundred years, you’ll notice a lot more\nsituations like this, situations where you either say, “Well, God just\nmade the world like that,” or else you try to think of a natural\nexplanation. The natural explanations tend to contradict young-earth\ncreationism.\u003c/p\u003e\n\u003cp\u003eThe earth is more than 6000 years old because we can find things in it\nthat have been around longer than that. Living things evolved from\nother, earlier living things because we’ve seen it happen in our\npresent environment, and because we’ve found many remains of living\nthings that are different from anything currently living, and because\nwe’ve found sequences of genetic material from which we can infer\nancestral relationships.\u003c/p\u003e\n\u003cp\u003eHuman beings, for example, are apes because we have the skeletal\nstructure of apes, the blood types of apes, the reproductive biology\nof apes, and the genetic makeup of apes. We know humans are apes in\nexactly the same way that we know chimpanzees are apes.\u003c/p\u003e\n\u003cp\u003eWe can measure how similar or different two pieces of genetic material\nare, and from doing that we know that humans are closely related to\nchimpanzees and bonobos. We also know that there used to be other\nhuman-like species that are gone now, because we’ve found their tools\nand their remains.\u003c/p\u003e\n\u003cp\u003eWe know that there were stars in the sky more than 6000 years ago\nbecause we know how fast light travels and we can measure the\ndistances to the stars pretty well. Some stars are so far away that\nit’s taken more than 6000 years for the light to reach us. For\nexample, the light from the Andromeda galaxy—the nearest galaxy to our\nown—takes two and half million years to reach us.\u003c/p\u003e\n\u003cp\u003eYou can still believe in young-earth creationism, if you want to. You\njust have to also believe that, for some reason, the creator planted\nevidence against it all over the place.\u003c/p\u003e\n\u003cp\u003eBut if you want a natural explanation of what we see around us, then\nyoung-earth creationism just doesn’t do the job.\u003c/p\u003e\n\n\n\t\t\t\t\u003c/div\u003e",
  "Date": "2020-02-16T00:00:00Z",
  "Author": "mikel evins"
}