{
  "Source": "mikelevins.github.io",
  "Title": "General public busybody theory",
  "Link": "https://mikelevins.github.io/posts/2010-01-23-general-public-busybody-theory/",
  "Content": "\u003cdiv class=\"post\"\u003e\n\n\t\t\t\t\t\u003cdiv class=\"post-heading\"\u003e\n\t\t\t\t\t\t\u003ch1\u003eGeneral public busybody theory\u003c/h1\u003e\n\t\t\t\t\t\t\u003cspan class=\"post-date\"\u003e\u003ca href=\"https://mikelevins.github.io/posts/2010-01-23-general-public-busybody-theory/\"\u003e# Jan 23, 2010\u003c/a\u003e\u003c/span\u003e\n\t\t\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\u003cp\u003eI was idly thinking about the\n\u003ca href=\"http://en.wikipedia.org/wiki/Penny_Arcade_(webcomic)#John_Gabriel.27s_.22Greater_Internet_Fuckwad_Theory.22\"\u003eGIFT\u003c/a\u003e,\nwhich comes up often for me because I not only surf the net, I also\nplay networked games, where the theory plays out so often and so\nemphatically. I was also thinking about the things that people think\nare weird and foolish in other people, because I happen to be\ntraveling this week, and those things vary somewhat from one place to\nanother.\u003c/p\u003e\n\u003cp\u003eIt occurred to me when I thought about those things at the same time\nthat they suggest a reason for the generally widespread hatred of gay\npeople.\u003c/p\u003e\n\u003cp\u003ePersonally, I’m male and, sexually speaking, I like women. But I don’t\nparticularly care whether another person prefers men or women or both,\nor neither, regardless of their gender. It’s a little hard for me to\nsee why anyone would care about such a thing, much less why they would\nhold demonstrations or pass laws about it. It doesn’t seem to me to be\na lot different from passing laws about what flavors of ice cream\nyou’re allowed to like.\u003c/p\u003e\n\u003cp\u003eBut when I was thinking about things today, a couple of things\noccurred to me. First, I’ve observed that there is a tendency sort of\nsimilar to the\n\u003ca href=\"http://en.wikipedia.org/wiki/Penny_Arcade_(webcomic)#John_Gabriel.27s_.22Greater_Internet_Fuckwad_Theory.22\"\u003eGIFT\u003c/a\u003e,\nwhich I might call the “general public busybody theory”, which is\nthat, first of all, a large fraction of people are inclined to be\nbusybodies, and the inclination increases as it gets easier and more\nanonymous. In other words, the cheaper and easier it is to say that\nsomebody ought to do something, and the less well you know them, the\nmore likely you are to tell them what to do.\u003c/p\u003e\n\u003cp\u003eIn general, I mean. Not everyone seems to have this impulse to boss\npeople around, but it does seem to be very common, and it seems like a\nmajority of people have it to some degree, some more than others.\u003c/p\u003e\n\u003cp\u003eThe second piece of the puzzle is that if you have a sexual\npreference–any sexual preference–then it’s pretty likely to gross\nanother person out if he or she doesn’t share it. I imagine that’s one\nreason that talking about sex is sort of impolite. That’s a tacit\nacknowledgement that people like different things, and what is\nappealing to one person is upsetting to another.\u003c/p\u003e\n\u003cp\u003eThis is not too surprising, really. If you’re dispassionate about it,\nall sex is at least a little bit gross and ridiculous. Being aroused,\nof course, tends to obliterate any sense of embarrassment or distaste,\nso we never get much chance to notice that the things we like are\nweird or icky. But if you could somehow switch off all arousal, then I\nthink most people would notice that their own sexual tastes involve\nthings that are a little bit messy and undignified. It’s pretty much\njust the nature of mammalian reproduction to be that way.\u003c/p\u003e\n\u003cp\u003eBut of course, people can’t just turn off their sexual feelings, and\nthey’re strong feelings. Accidentally discovering that someone is\nturned on by something you are not can be very awkward. There’s a sort\nof “EEEEEEWWWWW!!!” moment that some folks in kinky-sex communities\ncall being “squicked”. You are “squicked” when you are repelled by\nsomething that sexually appeals to someone else. The kinky-sex folks\nrun into it kind of a lot, of course, and talk about it and joke about\nit, and have sort of social conventions for taking the sting out of\nit, so it doesn’t interfere with their hobbies or friendships. Folks\nless communicative about their sexual preferences don’t really have\nthose conventions, because they don’t really have the need or occasion\nto develop them, so their only experience of being “squicked” is\ngenerally the thing itself–the experience of stumbling upon someone\nwith a sexual appetite that makes them go “EEEEEEWWWWW!!!”\u003c/p\u003e\n\u003cp\u003eWell, nobody likes that, of course. If a person has little experience\nof such encounters, or of talking about the subject, awkwardness may\nwell ensue.\u003c/p\u003e\n\u003cp\u003eWhen you combine that with the general public busybody theory, you\nhave a situation that seems like it’s almost tailor-made for creating\nprejudice against gay people (or against anyone with any sort of\ntastes or proclivities that are in the minority). An average\nheterosexual person (who is fairly likely to be a busybody, because\nany random person is fairly likely to be a busybody) encounters a\nrandom gay couple holding hands or otherwise acting like they care for\none another. This suggests the thought that this couple might be\nsexually involved. That creates the opportunity to imagine a sexual\nsituation that makes our random busybody go “EEEEEEWWWWW!!!”, which,\nby the general public busybody theory, immediately creates a desire to\ninsist that they shouldn’t be allowed to do that.\u003c/p\u003e\n\u003cp\u003eOnce I think of it that way, the prejudice, demonstrations, and\nlegislation seem almost inevitable.\u003c/p\u003e\n\n\n\t\t\t\t\u003c/div\u003e",
  "Date": "2010-01-23T00:00:00Z",
  "Author": "mikel evins"
}