{
  "Source": "mikelevins.github.io",
  "Title": "Against vanity",
  "Link": "https://mikelevins.github.io/posts/2021-01-18-against-vanity/",
  "Content": "\u003cdiv class=\"post\"\u003e\n\n\t\t\t\t\t\u003cdiv class=\"post-heading\"\u003e\n\t\t\t\t\t\t\u003ch1\u003eAgainst vanity\u003c/h1\u003e\n\t\t\t\t\t\t\u003cspan class=\"post-date\"\u003e\u003ca href=\"https://mikelevins.github.io/posts/2021-01-18-against-vanity/\"\u003e# Jan 18, 2021\u003c/a\u003e\u003c/span\u003e\n\t\t\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\u003cp\u003eOnce upon a time someone close to me asked me something like, “What’s wrong with vanity?” My answer went something like this:\u003c/p\u003e\n\u003cp\u003eLet’s start with Webster’s definition of “vanity”:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003evanity, n.\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003e\n\u003cp\u003einflated pride in oneself or one’s appearance: CONCEIT\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003esomething that is vain, empty, or valueless\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ol\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eVanity is a story that we tell ourselves, not because it’s true, but because it pleases us. The pleasure it gives us invites us to repeat it, and therein lies the peril.\u003c/p\u003e\n\u003cp\u003eWhat we habitually do and say and think becomes what we are. There are better things to become than an empty story.\u003c/p\u003e\n\u003cp\u003eVanity is the person who is concerned about being described as wicked, but who doesn’t care about actually being wicked.\u003c/p\u003e\n\u003cp\u003eVanity teaches us to attend to what doesn’t matter, and neglect what does.\u003c/p\u003e\n\u003cp\u003eVanity seduces. It rewards our attention to whatever flatters or aggrandizes us, whatever tells us that we are right or good or significant, whatever silly story we’re telling ourselves because it pleases us to do so.\u003c/p\u003e\n\u003cp\u003eNow, I like silly stories as much as the next fellow–probably more than most, in fact. But it’s important to know when we’re repeating facts about the world and when we’re just telling silly stories. It’s foolish to confuse one for the other. Vanity invites us to blur the distinction. It encourages us to dwell on stories because they please us, rather than because they’re true.\u003c/p\u003e\n\u003cp\u003eOur understanding is our map of the world. It informs us where we can go and what we can do. It enables us to choose this way rather than that way, because this way is better. If the map is wrong, then our choices are likely to be wrong, too.\u003c/p\u003e\n\u003cp\u003eVanity encourages us to use a map because it’s pretty, rather than because it’s accurate. There’s nothing wrong with a pretty picture, but if we mistake it for a map and use it for navigation, then we are lost. If we reach our destination without mishap, it’s purely by dumb luck. To avoid catastrophe, we must remember to consult a proper map, no matter how attractive the pretty picture might be.\u003c/p\u003e\n\u003cp\u003eIn the limit, if we forget that there’s a difference between what pleases us and what’s true, we can become disastrously lost. We may forget that there is a destination at all, that there is any possibility of reaching one. That way lies a life of wandering in the wilderness at the mercy of Fortune.\u003c/p\u003e\n\u003cp\u003eVanity is sugar for the psyche. A little bit won’t hurt, but the sweet taste is addictive. If you yield to the temptation it can crowd out nutritious fare. Embrace it without restraint and it becomes a poison. It fills irreplaceable hours of our lives with longing for rewards that amount to nothing, and ambitions that lead nowhere.\u003c/p\u003e\n\u003cp\u003eIn small doses, vanity is harmless, a spice that turns happiness to joy.\u003c/p\u003e\n\u003cp\u003eIn large doses it’s deadly.\u003c/p\u003e\n\u003cp\u003eA person who leaves no room at all for vanity might become a stick in the mud.\u003c/p\u003e\n\u003cp\u003eOne who leaves room for nothing else is a monster.\u003c/p\u003e\n\n\n\t\t\t\t\u003c/div\u003e",
  "Date": "2021-01-18T00:00:00Z",
  "Author": "mikel evins"
}