{
  "Source": "mikelevins.github.io",
  "Title": "Amor Fati",
  "Link": "https://mikelevins.github.io/posts/2020-01-24-amor-fati/",
  "Content": "\u003cdiv class=\"post\"\u003e\n\n\t\t\t\t\t\u003cdiv class=\"post-heading\"\u003e\n\t\t\t\t\t\t\u003ch1\u003eAmor Fati\u003c/h1\u003e\n\t\t\t\t\t\t\u003cspan class=\"post-date\"\u003e\u003ca href=\"https://mikelevins.github.io/posts/2020-01-24-amor-fati/\"\u003e# Jan 24, 2020\u003c/a\u003e\u003c/span\u003e\n\t\t\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\u003cp\u003e\u003cem\u003eAmor fati\u003c/em\u003e is a Latin phrase that means “love of fate.” It’s a\nconcept of virtue that we inherit from the ancient Stoics, though we\ncan probably thank Friedrich Nietzsche for the Latin phrase and for\nits presence in modern discussion\u003c!-- raw HTML omitted --\u003e\u003ca href=\"#f1\"\u003e1\u003c/a\u003e\u003c!-- raw HTML omitted --\u003e.\u003c/p\u003e\n\u003cp\u003eThe idea isn’t original with Nietzsche. It appears in the writings of\nMarcus Aurelius\u003c!-- raw HTML omitted --\u003e\u003ca href=\"#f2\"\u003e2\u003c/a\u003e\u003c!-- raw HTML omitted --\u003e—though not in so many words—and in\nEpictetus\u003c!-- raw HTML omitted --\u003e\u003ca href=\"#f3\"\u003e3\u003c/a\u003e\u003c!-- raw HTML omitted --\u003e before him.\u003c/p\u003e\n\u003cp\u003eIt’s not obvious at first glance what it’s supposed to mean. “Love of\nfate?” Are we supposed to conceive of Fate as some sort of god and\nworship it? Are we being asked to bow down to whatever random\noccurrence comes along?\u003c/p\u003e\n\u003cp\u003eNot quite. The ancient Stoics regarded love of fate as a virtue, and I\nagree, but I mean something particular by both \u003cstrong\u003elove\u003c/strong\u003e and \u003cstrong\u003efate\u003c/strong\u003e.\u003c/p\u003e\n\u003cp\u003eBy \u003cstrong\u003elove\u003c/strong\u003e, I mean caring for something, studying it, understanding\nit, cultivating it. I mean a deliberate and purposeful act of\nlearning, nurturing, and improvement.\u003c/p\u003e\n\u003cp\u003eI do not mean a feeling of affection, or the moment of joy you might\nderive from a pleasing experience. I don’t mean a feeling at all.\u003c/p\u003e\n\u003cp\u003eA perfect example of this kind of love is caring for your\nchildren. That labor may from time to time offer you a warm glow of\npleasure, and you might call that feeling “love,” but that’s not what\nI mean. I mean the care you take to nurture and cultivate your\nchildren, regardless of how you feel about it in the moment. I mean\nthe choice that you deliberately make to care for them even when you\nfeel vexed and frustrated. That kind of love isn’t about how you\nfeel. It’s about what you choose to do. That kind of love is what\ntells you that you’re wrong when you let your feelings of vexation\ndictate what you do.\u003c/p\u003e\n\u003cp\u003eThat love is not a feeling; it’s a deliberate course of action.\u003c/p\u003e\n\u003cp\u003eBy \u003cstrong\u003efate\u003c/strong\u003e, I mean the sum of your life from beginning to end. I mean\nthe situation into which you were born, the options offered to you by\nfortune and circumstance, and the unfolding of all the consequences of\nyour choices, good and bad, foreseen and unforeseen. I mean, in terms\nfamiliar to the ancient Romans and Greeks, the thread that the Fates\nspin for you, the length of it that they measure, and the cut they\nmake that finally ends it.\u003c/p\u003e\n\u003cp\u003eI do not mean predestination or fortune.\u003c/p\u003e\n\u003cp\u003eYour fate in this sense is all that you are, and have been, and will\nbe. It includes everything you choose to be and do, and everything\nthat you don’t. It’s the circumstances that led to your birth, and the\nsituations you find yourself in. It’s the choices you make and their\nconsequences, both foreseen and unforeseen. It’s everything that is up\nto you, and equally important, everything that isn’t. It’s all you\nknow of your existence, and all you don’t, and everything you will\nnever know.\u003c/p\u003e\n\u003cp\u003eLove of fate means properly caring for the sum of your existence.\u003c/p\u003e\n\u003cp\u003eTo love your fate means to see and understand that it’s all that you\nare, and have been, and will ever be. It’s realizing that its care and\ncultivation are in your hands and no one else’s. It’s resolving to\naccept it as it is, understand it, and care for it just as you would a\nloved one—not because it’s without flaw, not because it’s everything\nyou ever wanted, but because it’s everything you \u003cem\u003eare\u003c/em\u003e.\u003c/p\u003e\n\u003cp\u003eThe reward for loving your fate is not something that you wait to\ncollect at the end. The reward is in the act of cultivation\nitself. It’s manifest in the care that you take in this moment and pay\nforward to every moment that follows. In caring for your fate,\neverything you give, you also receive. Once it’s given, it’s always\nwith you. You will never be without it again. Choose wisely.\u003c/p\u003e\n\u003cp\u003eNot loving our fate means that we make war upon it, upon\nourselves. Not learning ourselves, we cannot know how to properly care\nfor ourselves. We’re as likely to harm ourselves as not. Not caring\nfor ourselves, we fall into suffering and delusion. We grow lost. We\nrob ourselves of the cultivation that might have nurtured us. We lose\nthe opportunity to collaborate with a future self made stronger and\nwiser by good care.\u003c/p\u003e\n\u003cp\u003eIt’s sometimes hard to love your fate. No one’s fate is all puppy dogs\nand rainbows. Fortune offers us, not what we wish for, but a little\nbit of this and a little bit of that, chosen according to its whims,\nnot ours. For every great job offer, there’s a disaster in the\nwings. For every accomplishment, a tragedy. In bad times it can be\nhard to see past the suffering of the moment. A moment of good feeling\nmay be all we want, and we may be willing to do nearly anything to get\nit.\u003c/p\u003e\n\u003cp\u003eThat’s fine, as far as it goes, but a good feeling is only a good\nfeeling. Like any feeling it comes and then it goes, and the whole\ntime you’re right were you were to begin with. If you want something\nbetter, you’ll have to build it. It doesn’t matter how bruised and\nbattered you are in the moment, if you want something better, you’ll\nhave to cultivate it.\u003c/p\u003e\n\u003cp\u003eYour fate is endless—or it might as well be. It lasts as long as you\nlast, and when it ends, you end with it. You’re always in it, whether\nyou pay attention to it or not. You can ignore it and wander from joy\nto despair, at the mercy of fortune, or you can learn to love your\nfate. You can acquaint yourself with it, come to know it, accept it,\ncare for it. You can nurture it and offer it to your future self. You\ncan accept that gift gratefully and pay it forward it again. You can\nforge alliances with better future selves that will exist only if you\ncultivate them now, and with all the alliances that those better\nselves can make in turn.\u003c/p\u003e\n\u003cp\u003eBut you have to care for your fate. You have to accept it for what it\nis, and was, and will be. You have to learn it and understand it. You\nhave to love it, in the way that you love your children.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eAmor fati.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003c!-- raw HTML omitted --\u003e1\u003c!-- raw HTML omitted --\u003e Friedrich Nietzsche, \u003ca href=\"https://www.gutenberg.org/files/52190/52190-h/52190-h.htm#WHY_I_AM_SO_CLEVER\"\u003eEcce\nHomo\u003c/a\u003e,\n“Why I am So Clever,” Section 10\u003ca href=\"#a1\"\u003e↩\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003c!-- raw HTML omitted --\u003e2\u003c!-- raw HTML omitted --\u003e Marcus Aurelius,\n\u003ca href=\"https://en.wikisource.org/wiki/The_Meditations_of_the_Emperor_Marcus_Antoninus/Book_4\"\u003eMeditations\u003c/a\u003e,\nIV.23\u003ca href=\"#a2\"\u003e↩\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003c!-- raw HTML omitted --\u003e3\u003c!-- raw HTML omitted --\u003e Epictetus,\n\u003ca href=\"http://classics.mit.edu/Epictetus/epicench.html\"\u003eEnchiridion\u003c/a\u003e, VIII\u003ca href=\"#a3\"\u003e↩\u003c/a\u003e\u003c/p\u003e\n\n\n\t\t\t\t\u003c/div\u003e",
  "Date": "2020-01-24T00:00:00Z",
  "Author": "mikel evins"
}