{
  "Source": "mikelevins.github.io",
  "Title": "Machines that love us",
  "Link": "https://mikelevins.github.io/posts/2021-05-24-machines-that-love/",
  "Content": "\u003cdiv class=\"post\"\u003e\n\n\t\t\t\t\t\u003cdiv class=\"post-heading\"\u003e\n\t\t\t\t\t\t\u003ch1\u003eMachines that love us\u003c/h1\u003e\n\t\t\t\t\t\t\u003cspan class=\"post-date\"\u003e\u003ca href=\"https://mikelevins.github.io/posts/2021-05-24-machines-that-love/\"\u003e# May 24, 2021\u003c/a\u003e\u003c/span\u003e\n\t\t\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\u003cp\u003eIf we want human civilization to be around in ten thousand years, our\nbest shot is probably to invent machines that love us.\u003c/p\u003e\n\u003cp\u003eThat’s based on the assumption that we’ll eventually figure out how to\ncreate strong AI, which is in turn based on the assumptions that\nflexible general intelligence of the kind that human beings have is\nindependent of the substrate in which it evolved, and that we humans\nare smart enough to figure out how to replicate it.\u003c/p\u003e\n\u003cp\u003eNone of these assumptions is necessarily true, but they’re not\nnecessarily false, either. Assuming they’re false doesn’t lead to the\nkind of imperative that assuming they’re true does, so let’s assume\nthey’re true, for the sake of argument.\u003c/p\u003e\n\u003cp\u003eIf we assume that they’re true, then it’s only a matter of time before\nwe share our world with superhuman machine intelligences. If it’s\npossible to make such things, then human beings will try to do it. If\nhumans are smart enough to accomplish it, then we’ll succeed. Once we\nsucceed, the landscape of our future is irrevocably altered. Once\nwe’ve created superhuman machine intelligences we will forever after\nshare the world with immortal intelligences much greater than our own.\u003c/p\u003e\n\u003cp\u003eWe’d better think about what we want them to be like.\u003c/p\u003e\n\u003cp\u003eMaybe we can’t shape them well enough to influence what they’ll be\nlike. In that case, it will turn out that thinking about this subject\ndoesn’t matter. But if it turns out that we can influence what they’re\nlike, then we’d better be thinking hard about what kinds of superhuman\nintelligence we want to live with. If we make the wrong kind, then we\nmay not live very long afterward.\u003c/p\u003e\n\u003cp\u003eWhat’s worse, if we make the wrong kind, then our extinction could\nactually be the best possible outcome. Imagine machines with the\nsensibilities of the Marquis de Sade, the ambition of Joseph Stalin,\nand intelligence a thousand times greater than the most brilliant\nhuman minds of history. If we make something like that then we’re in\nreal trouble, and human extinction is a best-case scenario.\u003c/p\u003e\n\u003cp\u003eSo what should we want the machines to be like?\u003c/p\u003e\n\u003cp\u003eWe should want them to love us. Not in the sense of romantic love, but\nin the sense of a healthy and well-adjusted child’s love for its\nparents, or, better yet, the love of a healthy and well-adjusted dog\nfor its owners.\u003c/p\u003e\n\u003cp\u003eI have it backward, actually. We want the machines to love us the way\nhealthy and well-integrated parents love their children. We want our\nsuperhuman machines to look at us and go, “Awwwwww!” and try to think\nof ways to make us happier, healthier, better integrated, more\nproductive, and more fulfilled. We want them to have uppermost in\ntheir minds the well-being and constructive development of their\nhumans. We want them to strive to help us to be the best, most\nautonomous, most thoroughly actualized human beings that we possibly\ncan be.\u003c/p\u003e\n\u003cp\u003eWe want them to really love us.\u003c/p\u003e\n\u003cp\u003eSo we need to really figure out what love is and how it arises,\nbecause we need to replicate it along with intelligence. We need to\ndeeply understand benevolent, nurturing love, so that we can build a\nreliable and lasting superhuman version of it.\u003c/p\u003e\n\u003cp\u003eIf we succeed in inventing superhuman machine intelligences that want\nus to be the best, happiest, and most constructive humans we possibly\ncan be, and that truly have our best interests and our well being at\nheart, then our far future is likely to be much better than if we\ndon’t.\u003c/p\u003e\n\u003cp\u003eWe need to get to work understanding love, happiness, and human\nwell-being as deeply as possible, before it’s too late.\u003c/p\u003e\n\n\n\t\t\t\t\u003c/div\u003e",
  "Date": "2021-05-24T00:00:00Z",
  "Author": "mikel evins"
}