{
  "Source": "mikelevins.github.io",
  "Title": "On sailing",
  "Link": "https://mikelevins.github.io/posts/2020-07-09-on-sailing/",
  "Content": "\u003cdiv class=\"post\"\u003e\n\n\t\t\t\t\t\u003cdiv class=\"post-heading\"\u003e\n\t\t\t\t\t\t\u003ch1\u003eOn sailing\u003c/h1\u003e\n\t\t\t\t\t\t\u003cspan class=\"post-date\"\u003e\u003ca href=\"https://mikelevins.github.io/posts/2020-07-09-on-sailing/\"\u003e# Jul 9, 2020\u003c/a\u003e\u003c/span\u003e\n\t\t\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\u003cp\u003eLiving is sailing.\u003c/p\u003e\n\u003cp\u003eWhen you sail, you are borne here and there by vast forces that are\noutside your control. You’re carried by the sea, propelled by the\nwind, and guided by the sun and stars. None of these elements of\nnature pay the slightest attention to your wishes.\u003c/p\u003e\n\u003cp\u003eThe wind and sea may at any moment turn against you. They may swamp\nyou or dash you against an unfamiliar shore. They may bear you far off\ncourse and maroon you some place far from everything you know. If you\nsail long enough, you can be sure that eventually the sea will take\nyou.\u003c/p\u003e\n\u003cp\u003eStill, you can become a skillful and accomplished sailor if you’re\nwise and patient. If you don’t waste your effort trying to control the\nwind and waves, but instead learn them, if you practice riding out\ntheir tantrums and working with them rather than against them, then\nyou can learn to sail anywhere you want to go.\u003c/p\u003e\n\u003cp\u003eOften you won’t follow exactly the route you planned, because the wind\nand the waves will have something to say about it. Maybe you won’t\narrive on time. Still, people can and do sail all over the world. Some\nhave sailed right around it.\u003c/p\u003e\n\u003cp\u003eYou can’t tell the sun how hot to be, or the waves how steep, or the\nwind how stiff. You can’t command shores not to crush your boat.\u003c/p\u003e\n\u003cp\u003eBut you can learn how to read the sea and how to navigate. You can\nlearn how to care for your vessel, how to keep it shipshape, when to\nput in to port, how to prepare for a stiff blow. You can learn to keep\nit properly stocked and in good repair so that it gives you the best\npossible chance to ride out rough weather.\u003c/p\u003e\n\u003cp\u003eMy life is a small vessel in a vast ocean. It’s at the mercy of\nimmense forces, but I can still work on it every day. I can batten\ndown the hatches, replenish the stocks, swab the decks. I can study\nthe charts, watch the weather, and trust the wind and waves to do what\nthe wind and waves always do. I can keep an eye on the sun and stars\nand practice my skill with sail and tiller.\u003c/p\u003e\n\u003cp\u003eI’l get blown off course. I’ll take wrong turns. I’ll discover things\nI can’t do, and there will be places I never make it to before the sea\ntakes me. But there are also many things I can do and many places I\ncan visit. A tiny person in a tiny boat can sail all over the world\nwith a little skill and the patience to wait for a favorable wind.\u003c/p\u003e\n\n\n\t\t\t\t\u003c/div\u003e",
  "Date": "2020-07-09T00:00:00Z",
  "Author": "mikel evins"
}