{
  "Source": "antonz.org",
  "Title": "Banned for self-promo",
  "Link": "https://antonz.org/self-promo/",
  "Content": "\u003carticle class=\"post\"\u003e\u003cdiv class=\"row\"\u003e\u003cdiv class=\"col-xs-12 col-md-10 article\"\u003e\u003cheader\u003e\u003ch1\u003eBanned for self-promo\u003c/h1\u003e\u003c/header\u003e\u003cp\u003eI just learned that a good tech author was banned from Lobsters\u003csup id=\"fnref:1\"\u003e\u003ca href=\"#fn:1\" class=\"footnote-ref\" role=\"doc-noteref\"\u003e1\u003c/a\u003e\u003c/sup\u003e (a Hacker News\u003csup id=\"fnref:2\"\u003e\u003ca href=\"#fn:2\" class=\"footnote-ref\" role=\"doc-noteref\"\u003e2\u003c/a\u003e\u003c/sup\u003e like platform) for \u0026#34;self-promotion\u0026#34;. I\u0026#39;m so angry.\u003c/p\u003e\u003cp\u003eThis may come as a surprise, but as a blogger, it\u0026#39;s very difficult to reach your audience and to be heard, no matter how good or deep or useful your articles are. Unless you post \u0026#34;hot takes\u0026#34; or have a huge marketing budget, that is.\u003c/p\u003e\u003cp\u003eOne of the few options is to post to HN/Lobsters and hope for a (slim) chance of getting noticed. And yes, authors often have to submit their own stuff because readers rarely do (again, no matter how good the article is).\u003c/p\u003e\u003cp\u003eAnd yet the platform gatekeepers do everything in their power to keep authors from posting. They enforce these ridiculous \u0026#34;anti-self-promotion\u0026#34; policies (where\u0026#39;s the promotion, by the way? It\u0026#39;s not like authors are trying to sell anything, they\u0026#39;re just trying to be heard).\u003c/p\u003e\u003cp\u003ePlatforms like HN and Lobsters already have powerful collaboration-based mechanisms to protect them from bad content: voting and flagging. Bad articles don\u0026#39;t get upvoted, so no one sees them. Offensive content and spam are flagged and removed. The community is perfectly capable of deciding what content it wants to see on the platform. And yet moderators choose to abuse their power by banning authors for \u0026#34;self-promotion\u0026#34;.\u003c/p\u003e\u003cp\u003eDespite what the platform owners say, they don\u0026#39;t give a damn about \u0026#34;quality content\u0026#34;. Instead, they welcome all kinds of hype (which is what people generally submit), corporate blogs with fat budgets, and a small number of tech celebrities.\u003c/p\u003e\u003cp\u003eWell, you know what? Fuck you, Lobsters. I\u0026#39;m going to submit every single article by this author.\u003c/p\u003e\u003cp\u003eEat that.\u003c/p\u003e\u003cdiv class=\"footnotes\" role=\"doc-endnotes\"\u003e\u003chr/\u003e\u003col\u003e\u003cli id=\"fn:1\"\u003e\u003cp\u003e\u003ca href=\"https://lobste.rs/\"\u003eLobsters\u003c/a\u003e \u003ca href=\"#fnref:1\" class=\"footnote-backref\" role=\"doc-backlink\"\u003e↩︎\u003c/a\u003e\u003c/p\u003e\u003c/li\u003e\u003cli id=\"fn:2\"\u003e\u003cp\u003e\u003ca href=\"https://news.ycombinator.com/\"\u003eHacker News\u003c/a\u003e \u003ca href=\"#fnref:2\" class=\"footnote-backref\" role=\"doc-backlink\"\u003e↩︎\u003c/a\u003e\u003c/p\u003e\u003c/li\u003e\u003c/ol\u003e\u003c/div\u003e\u003cp\u003e\u003ca href=\"/subscribe/\"\u003e★ Subscribe\u003c/a\u003e to keep up with new posts.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cfooter class=\"post__footer\"\u003e\u003cdiv class=\"row\"\u003e\u003cdiv class=\"col-xs-12\"\u003e\u003cdiv class=\"post__date\"\u003e\u003ctime datetime=\"2024-03-10 11:30:00 +0000 UTC\"\u003e10 Mar, 2024\u003c/time\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003c/footer\u003e\u003c/article\u003e",
  "Date": "2024-03-10T11:30:00Z",
  "Author": "Anton Zhiyanov"
}