{
  "Source": "antonz.org",
  "Title": "What to expect from upvotes on Hacker News",
  "Link": "https://antonz.org/hn-upvotes/",
  "Content": "\u003carticle class=\"post\"\u003e\u003cdiv class=\"row\"\u003e\u003cdiv class=\"col-xs-12 col-md-10 article\"\u003e\u003cheader\u003e\u003ch1\u003eWhat to expect from upvotes on Hacker News\u003c/h1\u003e\u003c/header\u003e\u003cp\u003eThis is what happens when you write an article and it gets noticed on HN.\u003c/p\u003e\u003cp\u003eNote: This is by no means a serious research. Just my \u003ca href=\"https://hn.algolia.com/?query=antonz.org%20points%3E10\u0026amp;sort=byPopularity\u0026amp;type=story\"\u003eanecdotal evidence\u003c/a\u003e. And of course there is an answer to the infamous \u0026#34;how do I get to the top of HN front page\u0026#34; question at the end.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e🥱 10 upvotes\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eNothing happens. You might get a comment, though. Usually a snarky one.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e👀 30 upvotes\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eYou get some noticeable traffic. A couple of people actually read your article to the end. There might even be an interesting comment (but that\u0026#39;s unlikely).\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e🗣 80 upvotes\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eThere is a real discussion in the comments. Usually a lot of criticism from people who only read the title. But there is some chance of deeper ones.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e👏 150 upvotes\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eComments become interesting to read. You might even learn something new about the topic. Some people follow you on Twitter (sorry, I\u0026#39;m not calling it X, ever).\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e🤩 300 upvotes\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eLots of traffic. Comments go sideways: people discuss all sorts of things that are only tangentially related to the article. More followers. Some people even write you a lengthy email.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e😎 900 upvotes\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eThis is when you start to feel like a (geeky kind of) celebrity. Now there are too many comments to read. All of tech Twitter seems to be discussing your article and mentioning you. Lots of new followers. Weird emails and pitches from startup founders. Podcast invitations. Your article gets translated into other languages.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e🌟 1500 upvotes\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eYou receive a dinner invitation from Y Combinator.\u003c/p\u003e\u003cp\u003eJust kidding, never been there.\u003c/p\u003e\u003cp\u003eNow to the Question:\u003c/p\u003e\u003cblockquote class=\"big\"\u003eHow do I make sure my article hits the top of HN front page?\u003c/blockquote\u003e\u003cdetails\u003e\u003csummary\u003eThe Answer\u003c/summary\u003e\u003cp\u003eYou don\u0026#39;t. But having a ton of passionate followers and writing great content helps. To some extent. Other than that — pure luck.\u003c/p\u003e\u003c/details\u003e\u003cp\u003eCheers.\u003c/p\u003e\u003cp\u003e\u003cem\u003e\u003ca href=\"/subscribe/\"\u003e\u003ci class=\"fas fa-star\"\u003e\u003c/i\u003e \u003cstrong\u003eSubscribe\u003c/strong\u003e\u003c/a\u003e\nto keep up with new posts.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cfooter class=\"post__footer\"\u003e\u003cdiv class=\"row\"\u003e\u003cdiv class=\"col-xs-12\"\u003e\u003cdiv class=\"post__date\"\u003e\u003ctime datetime=\"2023-09-13 10:00:00 +0000 UTC\"\u003e13 Sep, 2023\u003c/time\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003c/footer\u003e\u003c/article\u003e",
  "Date": "2023-09-13T10:00:00Z",
  "Author": "Anton Zhiyanov"
}