{
  "Source": "antonz.org",
  "Title": "Don't work with Educative",
  "Link": "https://antonz.org/educative/",
  "Content": "\u003carticle class=\"post\"\u003e\u003cdiv class=\"row\"\u003e\u003cdiv class=\"col-xs-12 col-md-10 article\"\u003e\u003cheader\u003e\u003ch1\u003eDon\u0026#39;t work with Educative\u003c/h1\u003e\u003c/header\u003e\u003cp\u003eEducative Inc, according to their website \u003ca href=\"https://www.educative.io/\"\u003eeducative.io\u003c/a\u003e, is \u0026#34;the ultimate learning platform for software developers\u0026#34;. I\u0026#39;ve tried to work with them as a course author and it\u0026#39;s been a total disaster. This post describes my experience, so that other authors interested in publishing their courses on Educative will know what to expect.\u003c/p\u003e\u003cp\u003eI\u0026#39;m the author of the book \u003ca href=\"https://antonz.org/sql-window-functions-book/\"\u003eSQL Window Functions Explained\u003c/a\u003e. It has 56 interactive exercises, so I thought it should be a good fit for an online course, and after some research, I contacted Educative. Some time later, I received a reply from Hassan, who introduced themself as a member of the \u0026#34;Author Acquisition\u0026#34; team. They said that Educative was indeed interested in turning my book into a course.\u003c/p\u003e\u003cp\u003eThe first surprise was when Hassan categorically stated that I couldn\u0026#39;t develop the course myself. This could only be done by another team at Educative called \u0026#34;Author Success\u0026#34; (these guys just love big names). Your house, your rules, I thought.\u003c/p\u003e\u003cp\u003eThe second surprise was the whole communication process with Hassan. They answered my emails once a week, never earlier. Sometimes they would disappear for a few weeks. At one point, I even had to contact Educative support to kindly ask them to remind Hassan of my existence. After that, Hassan reappeared in my inbox, still replying once a week.\u003c/p\u003e\u003cp\u003eAfter 2.5 months of this slow-burning bromance, Hassan announced that Educative was ready to sign a contract with me and transfer me to the \u0026#34;Author Success\u0026#34; team that would supposedly start working on the course. After this important milestone in our correspondence, Hassan disappeared for good, never to be seen again.\u003c/p\u003e\u003cp\u003eA month later, I was contacted by Amina, another member of the \u0026#34;Author Acquisition\u0026#34; team at Educative. Amina told me that Educative was ready to sign a contract (again) and even provided a link. After reviewing the contract, I signed it and Amina disappeared without a word.\u003c/p\u003e\u003cp\u003eAnother month passed, and (guess what) I was contacted by the same Amina, who told me that no one at Educative had bothered to click the \u0026#34;sign\u0026#34; button on the contract in the past month, so it had expired. Would you be so kind as to sign it again, Amina told me.\u003c/p\u003e\u003cp\u003eAt this point, I was pretty fed up with Educative. It\u0026#39;s been 5 months and we haven\u0026#39;t made any progress. As my last attempt, I contacted Fahim ul Haq (who seems to be the CEO of Educative) directly on Twitter. Of course they ignored me.\u003c/p\u003e\u003cp\u003eAnd that was it.\u003c/p\u003e\u003cp\u003eI will never work with Educative again. And neither should you.\u003c/p\u003e\u003cp\u003e\u003cem\u003e\u003ca href=\"/subscribe/\"\u003e\u003ci class=\"fas fa-star\"\u003e\u003c/i\u003e \u003cstrong\u003eSubscribe\u003c/strong\u003e\u003c/a\u003e\nto keep up with new posts.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cfooter class=\"post__footer\"\u003e\u003cdiv class=\"row\"\u003e\u003cdiv class=\"col-xs-12\"\u003e\u003cdiv class=\"post__date\"\u003e\u003ctime datetime=\"2023-10-14 15:00:00 +0000 UTC\"\u003e14 Oct, 2023\u003c/time\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003c/footer\u003e\u003c/article\u003e",
  "Date": "2023-10-14T15:00:00Z",
  "Author": "Anton Zhiyanov"
}