{
  "Source": "antonz.org",
  "Title": "Blogging myths you should care about",
  "Link": "https://antonz.org/blogging-myths/",
  "Content": "\u003carticle class=\"post\"\u003e\u003cdiv class=\"row\"\u003e\u003cdiv class=\"col-xs-12 col-md-10 article\"\u003e\u003cheader\u003e\u003ch1\u003eBlogging myths you should care about\u003c/h1\u003e\u003c/header\u003e\u003cp\u003eOkay, here are some REAL blogging myths:\u003c/p\u003e\u003col\u003e\u003cli\u003ePeople will actually read your blog.\u003c/li\u003e\u003cli\u003eYou\u0026#39;ll reach your target audience.\u003c/li\u003e\u003cli\u003eYou\u0026#39;ll have meaningful conversations.\u003c/li\u003e\u003cli\u003eYour blog will help you get a job.\u003c/li\u003e\u003c/ol\u003e\u003cp\u003eIn all cases, the answer is NO.\u003c/p\u003e\u003cp\u003eIf you want to blog just because you like writing, that\u0026#39;s a great option. But blogging is not about popularity. There are exceptions, of course, like Julia Evans. But your chances of gaining that kind of audience are close to zero.\u003c/p\u003e\u003cp\u003eA blog is like any other product. \u0026#34;Build it and they will come\u0026#34; no longer works — you need excellent marketing to get people to notice you and start reading. If you\u0026#39;re a mediocre marketer (like most technical people), don\u0026#39;t set yourself unrealistic expectations.\u003c/p\u003e\u003cp\u003eYou spent a week writing an excellent, detailed, clear technical article — and only got a few dozen views? This is typical. If that bothers you, then blogging is not for you.\u003c/p\u003e\u003cp\u003eOf course, no one will comment. Share with others? Pffft.\u003c/p\u003e\u003cp\u003eYour true audience (those who care) is about 1% of your subscribers. 1000 followers on Twitter? Your audience is 10 people. 10000 email subscribers? 100 people.\u003c/p\u003e\u003cp\u003eYes, there are exceptions. No, you should not hope to be one of them.\u003c/p\u003e\u003cp\u003eThe conclusion is simple. If you are willing to write a blog for yourself, it will bring joy and benefit. But if you hope for an audience, it will bring pain and disappointment.\u003c/p\u003e\u003cp\u003eThat\u0026#39;s just the way it is for us average bloggers.\u003c/p\u003e\u003cp\u003e\u003cem\u003e\u003ca href=\"/subscribe/\"\u003e\u003ci class=\"fas fa-star\"\u003e\u003c/i\u003e \u003cstrong\u003eSubscribe\u003c/strong\u003e\u003c/a\u003e\nto keep up with new posts.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cfooter class=\"post__footer\"\u003e\u003cdiv class=\"row\"\u003e\u003cdiv class=\"col-xs-12\"\u003e\u003cdiv class=\"post__date\"\u003e\u003ctime datetime=\"2023-06-09 12:00:00 +0000 UTC\"\u003e09 Jun, 2023\u003c/time\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003c/footer\u003e\u003c/article\u003e",
  "Date": "2023-06-09T12:00:00Z",
  "Author": "Anton Zhiyanov"
}