{
  "Source": "blog.keldos.me",
  "Title": "今译王世贞《蔺相如完璧归赵论》",
  "Link": "https://blog.keldos.me/2017/05/translate-wanbiguizhao/",
  "Content": "\u003cdiv class=\"post-body\" itemprop=\"articleBody\"\u003e\n        \u003cp\u003e翻《古文观止》的时候，看到王世贞此文，惊叹不已，便想到试着译成现代汉语。译稿如下： \u003ca id=\"more\"\u003e\u003c/a\u003e\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003e　　蔺相如完璧归赵，人人称道，我却不敢认同。\u003c/p\u003e\n\u003cp\u003e　　秦拿十五座的假名头来敲诈赵国的和氏璧，只是想要拿到玉而已，并不是觊觎赵国的土地。赵国要是知道秦国的打算就该给它，要是不知道就不给，或是知道但害怕不给不行就给它；知道又不害怕就不给。这只要两句话就能解决了，可赵国怎么又害怕还要挑斗秦发怒呢？\u003c/p\u003e\n\u003cp\u003e　　再说，要是秦想要玉，赵国不给，那么两方都无过错。送给了玉璧秦却不交城，是秦理亏；秦国给了城池而赵国却又把玉璧拿回去，是赵理亏。要想让秦理屈，不如放弃玉璧；又不想放弃玉璧，就不如干脆不给。话说当时秦王在国纸上标出了城池，又大宴宾客，斋戒五日，那样的势头是不得不交城的。如果送出玉璧而不给城，蔺相如就可以说：“我本来就想到大王不会把城池交给我国的。和氏璧不就是赵国的一块玉璧吗？而那十五座城池却是秦国的宝贝。如今大王要是因为一块玉璧的缘故就送掉了十五座城池，里面的百姓都会哀怨大王说‘怎么就如草戒一样把我们抛弃呢？’（那么大王是没法拿城池换壁的。）大王不给许诺的城池而抢走了赵国的玉璧，因为一块玉而失信于天下，我现在就请求立即在贵国就死（自杀,如撞阶/柱），好让天下明白大王之失信！（大王又不能拿玉璧换信义。）”这样，秦王未必不归还玉璧。（如此玉璧可归赵国，秦却不会有理。）现在又何苦让仆人把玉璧藏在怀里逃走，反而叫秦国有理了？那时秦国还是不想于赵国绝交的。要是秦王发怒，一下子杀了蔺相如，让大将武安君（白起）率领十万精兵压境赵国国都邯郸，一齐声讨玉璧和信义，首先相如被弄死不说，一旦胜利，玉璧还是要落到秦国手中。\u003c/p\u003e\n\u003cp\u003e　　所以我说，蔺相如能够完璧归赵，全是上天保佑的。倒是他斗劲渑池，柔化廉颇，比这事处理得妙了不知多少。最终完璧归赵的成功，还是上天本来想保全他啊！\u003c/p\u003e\n\u003cp\u003e\u003csmall\u003e 二零一七年三月初稿\u003cbr/\u003e 五月校稿 \u003c/small\u003e\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003e\u003cstrong\u003e附一、原文：\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e　　藺相如之完璧，人皆稱之，予未敢以為信也。\u003c/p\u003e\n\u003cp\u003e　　夫秦以十五城之空名，詐趙而脅其璧，是時言取璧者，情也，非欲以窺趙也。趙得其情則弗予，不得其情則予；得其情而畏之則予，得其情而弗畏之則弗予：此兩言決耳，奈之何既畏而復挑其怒也？且夫秦欲璧，趙弗予璧，兩無所曲直也。入璧而秦弗予城，曲在秦；秦出城而璧歸，曲在趙。欲使曲在秦，則莫如棄璧；畏棄璧，則莫如弗予。夫秦王既按圖以予城，又設九賓，齋而受璧，其勢不得不予城。璧入而城弗予，相如則前請曰：「臣固知大王之弗予城也。夫璧，非趙寶也；而十五城，秦寶也。今使大王以璧故而亡其十五城；十五城之子弟，皆厚怨大王以棄我如草芥也。大王弗予城而紿趙璧；以一璧故而失信於天下，臣請就死於國，以明大王之失信。」秦王未必不返璧也。今奈何使舍人懷而逃之，而歸直於秦？是時秦意未欲與趙絕耳；令秦王怒而僇相如於巿，武安君十萬眾壓邯鄲，而責璧與信；一勝而相如族，再勝而璧終入秦矣！\u003c/p\u003e\n\u003cp\u003e　　吾故曰：「藺相如之獲全於璧也，天也。」若而勁澠池，柔廉頗，則愈出而愈妙於用。所以能完趙者，天固曲全之哉！\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003e\u003cstrong\u003e附二、[清]吴楚材、吴调侯评文：\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e　　相如完璧归赵一节，至今凛凛有生气，故无待后人之訾议也。然怀璧归赵之后，相如得以无恙，赵国得以免祸者，直一时之侥幸耳。故中间特设出一段中正之论，以为千古人臣保国保身万全之策，勿得视为迂谈，而忽之也。\u003c/p\u003e\n\n    \u003c/div\u003e",
  "Date": "2017-05-13T16:00:00Z",
  "Author": "Keldos"
}