{
  "Source": "blog.keldos.me",
  "Title": "莊子淺摘（後記）",
  "Link": "https://blog.keldos.me/2017/05/zhuangzi-houji/",
  "Content": "\u003cdiv class=\"post-body\" itemprop=\"articleBody\"\u003e\n        \u003cp\u003e这也是老文章啊，在我以前还有一个“学霸”的信心的时候……算了算了吧。\u003c/p\u003e\n\u003cp\u003e以下是原文: \u003ca id=\"more\"\u003e\u003c/a\u003e\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003e　　我知道当我安利同学们参观这个网站的时候，映入眼帘的竟是一堆“看不懂”的繁体字时的感受（也不得不说有些同学的国文素养差），也知道大家完全没兴趣看我所作的摘注（大多只是看了每篇粗体的吧？）。写这一篇，完全是兴趣。\u003c/p\u003e\n\u003cp\u003e　　一次，我问父亲对庄子有多了解，他倒问我庄子是不是早于老子……看来我有必要对庄子做一个介绍：\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003e庄子，宋国蒙城人，名同。曾著书十万余言，《汉书·艺文志》道家类有《庄子》52篇。今存33篇，分内外杂3类，为晋郭象所定，其中内七篇一般断为庄子自作，而外、杂篇则多为庄子后学之作。\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003e　　庄子是一位有趣的伟大的哲学家。如果你喜欢，可以仅仅去看他写的寓言故事（据庄子自己记录，“重言十九，寓言十七”，寓言至少占了十分之七——尽管我没摘）。其中关于“儒家”的故事占了很大篇幅，不少是孔子（颜回）的故事。不过庄子当然不会宣扬儒家思想，他不过是借孔子之口宣传“道”，顺便批判一下孔子（儒家）的不明大道以及其言行相悖etc.，指责他们要求“仁”，违背人性自然的性情而使得天下大乱。这样，看道儒两家互相攻击会变得极其有意思（如\u0026lt;田子方\u0026gt;篇鲁哀公与庄子的故事）。\u003c/p\u003e\n\u003cp\u003e　　不过，作为哲学家，不少寓言故事的终极寓意于我们现今的大多浅显理解是不尽相同的。如庖丁解牛，我们理解为要掌握方法才能得心应手，而庄子可能意在指出社会肌理复杂，我们要顺着“道”（自然），小心地游刃于其肌理间（喻为牛的筋骨），才能安然处世，保持完好（刀都不用磨）；又如混沌开窍，我们可能单纯当睡前故事读了，或理解为不要好心帮倒忙之类，而庄子之意却是统治者今日立一政（开一窍），明日颁一法（开一窍），人民就生活在水深火热之中了（混沌死）——尽管君王的出发点可能是好的。诸如此类的还有螳螂捕蝉，黄雀在后、佝偻承蜩、呆若木鸡、邯郸学步等等，不加赘述（具体见《浅摘》文）。总之，国人之前受的教育实在太浅显了，没有领会出哲学的深意。\u003c/p\u003e\n\u003cp\u003e　　《庄子》中议论也占了较大的篇幅。庄子的思想内涵是极深刻而深远的，其自由安逸的生活态度给我以很大的启迪。他是老子之后先秦道家学派的集大成者，从内七篇看来，他的哲学是继承老子而来，但庄子更加突出了“道”之为“整体性”的特点，还建立了一个独特而完整的认识论系统，这是老子所不及的。庄子对老子思想的最大发展，是他把在老子那里主要是宇宙论及本体论的“道”转化而为心灵的境界。在自然说方面，庄子更为深广地发挥了人的自由性与自在性。尤其著名的\u0026lt;逍遥游\u0026gt;一文，描绘了一种透脱的心灵，为人所称道。在治身的另一些方面，可以说庄子和老子是有相近的地方的。比方说，他劝人们忌太张扬，忌追名逐利……然而，后世一般以为庄子消极，出世，大概是很表面的。庄子置身于战祸连绵，危机四伏的环境中，对不幸的现实有深切的体验，因而思想表现追求“逍遥游”，但他的“逍遥”不是出世的，而是\u003cstrong\u003e寄沉痛于悠闲之中\u003c/strong\u003e。可以说他是“出世”的精神入世。庄子主张扬弃的是现实世界中的世俗价值网，从中解脱出来。由于庄子并不舍弃这个世界本身，这种出世与宗教的离弃此世截然不同。[陈《庄子的悲剧意识和自由精神》]\u003c/p\u003e\n\u003cp\u003e　　想要弄懂《庄子》不是懂文言就可以了。单把文章拿来也可能让人不得要旨。因此我参考了陈鼓应的《庄子今注今译》，陈先生是一位著作颇丰的哲学教授，要真让某些读者对庄子产生兴趣 \u003cdel\u003e（不会）\u003c/del\u003e ，不妨找他的原书一阅。（若是入门书，不妨选择林语堂的《老子的智慧》，是用庄子文章解释老子的，但尽是翻译，有些也不得要旨，加之是文言译英，再译回现代汉语，原意尽失，大概翻翻就可以扔了。）\u003c/p\u003e\n\u003cp\u003e　　我本没有对哲学有过多的思考，但却惊奇地发现自己竟有那么浓厚的兴趣，相信自己今后也会对庄子老子有更深的理解。在网站上放这个，一是充实兴趣，二是练练手，治治学，但苦于没有时间——以及自己无奈的打字技巧。《浅摘》中写不“不摘”的，可能是虽然理解深刻但是太长，也可能是通篇寓言，均懒得输入。我尽量选择精辟而深刻的摘录（参考归有光批阅·郭象辑注《南华真经评注》明·天启四年刊本影印本），但学识有限，必然有略过精华而拾了糟粕的，也希望不过苛求。 　　这是一项长时间的工程，记得从一七年的一月十八日开写，到大年三十才赶完了\u0026lt;内篇\u0026gt;（然而白天都在上辅导班，都是晚上写的），之后迫于学业就几乎再没动。这篇后记也是百忙之中拼凑得的。嗐！我实在算不上一个学者啊！\u003c/p\u003e\n\u003cp\u003e\u003csmall\u003e 丁酉二月初八于冻风中\u003cbr/\u003e 2017年3月4日初稿\u003c/small\u003e\u003c/p\u003e\u003csmall\u003e\n\u003c/small\u003e\u003cp\u003e\u003csmall\u003e2017年5月7日改过\u003cbr/\u003e 5月29日录毕 \u003c/small\u003e\u003c/p\u003e\n\n    \u003c/div\u003e",
  "Date": "2017-05-27T16:00:00Z",
  "Author": "Keldos"
}