{
  "Source": "blog.keldos.me",
  "Title": "再见，2022",
  "Link": "https://blog.keldos.me/2023/01/2022Review/",
  "Content": "\u003cdiv class=\"post-body\" itemprop=\"articleBody\"\u003e\n        \u003cp\u003e本来早就打算写的总结，但是29号突然接到顾老师的微信电话，让我改下图，于是竟拖到了现在。期间我交了几次又循他的意见改了几版。我想，他本还想让我接着改的（我也知道图尚有不完善的地方），但我实在改不动了，便说，“\u003cem\u003e老师我明白您的意思，但是后面改起来真有点麻烦了\u003c/em\u003e 🥲 \u003cem\u003e我还是就这样出一版图传到ZAP上吧\u003c/em\u003e 🥲 ”。等了三个小时，终于等到令人如释重负的消息弹窗：“\u003cem\u003e好的\u003c/em\u003e”。\u003c/p\u003e\n\u003cp\u003e自从进入大学以来，好多事情也是如此。尤其是城规专业，改图实在是一件家常便饭的事，我已经记不清大一有多少次在周日和周四上课前的夜晚对着电脑和白纸苦思冥想，画了多少版方案，然后在课上被毙掉，一切从零开始。老师总是客气的，他们说，“\u003cem\u003e我觉得这样……可以更好\u003c/em\u003e”，或者“\u003cem\u003e这样……不太能表现……\u003c/em\u003e”，甚至“\u003cem\u003e你想想有没有更好的……解决方法\u003c/em\u003e”。不断推倒重来是让人崩溃的，老师们似是而非的口吻既温柔又锋利，叫人没法不怀疑是不是自己的能力问题。\u003ca id=\"more\"\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003e\u003cem\u003e这里我很想提一嘴，iPad Pro，真的非常好用，自从大二有了它，我就不用在白纸上画草稿了，减少了很多浪费，节约了不少钱。打印费应该也是节约了不少的。（你们知道的，我们这专业买模型材料或是3D打印有多么花钱。）\u003c/em\u003e\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003e是这样，这一年我一直在自我怀疑中度过。2022年，对我绝对不轻松，倒不是身体上多么不轻松，我也不知道为什么我的精神压力为什么这么大。时间过得太快了，也太磨人了。\u003cstrong\u003e提前预警，下面的文字比较丧，不喜勿看。\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e上半年吧，真的很累。大二下学期是我从没想象过的忙碌。或许是我太慢了，太慢了。也可能是浙大专业课设置得太不合理了。也可能是我时间管理太差了。我在生日那天发了张图，现在来看，我都不知道那几天是怎么过下来的。\u003cdel\u003e我发誓，我以后课绝对要选得越少越好，如非必修，绝不多选\u003c/del\u003e。\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://pic.imgdb.cn/item/63e1e51f4757feff33e4f075.jpg\" alt=\"那几天的todo\" style=\"zoom: 50%;\"/\u003e\u003c/p\u003e\n\u003cp\u003e那些天或许主要在被美术作业给折磨着。对于美术，我真是一种矛盾的态度：我真的很喜欢那种成就感，尤其是一幅作品最终完成的时候，那恢弘的气势和美妙的色彩……但是过程真是痛苦的，可怕的，让人想一死了之的。或许是一直训练的精渲染，我其实不会画快速水彩。一张画完成要铺排好几遍，至少花上三四十个小时，这对非艺术生来说太不切实际了。6月底，我终于画完了美术作业，发了篇描述心路历程的\u003ca target=\"_blank\" rel=\"noopener\" href=\"https://mp.weixin.qq.com/s/zz_cDz74nyh6LUZ27lI_7g\"\u003e公众号文章\u003c/a\u003e。或许看着很令人惊叹，但一张张背后都是血啊。\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://pic.imgdb.cn/item/63e1e5fa4757feff33e6599b.jpg\" alt=\"一些图片吧\" style=\"zoom:67%;\"/\u003e\u003c/p\u003e\n\u003cp\u003e只能说是一种“有意思”的经历……我本身是热爱艺术的，但经过两年的美术训练，我现在已经并不那么喜爱美术了。这可悲吗？我不知道。我初中拿的艺术特长生A级已经再也没有拿出来说道的资格了。\u003c/p\u003e\n\u003cp\u003e暑假的美术实习不提也罢。我画得并不开心。\u003c/p\u003e\n\u003cp\u003e至于更大头的（建筑、规划）设计课，说实在话，我对自己的作业并不那么满意。设计设计设计……真是玄妙啊。我曾经发过仅自己可见的朋友圈，现在回看我还是这个状态：\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003e\u003cem\u003e刷 B 站看到风景园林的竞赛，一个个神仙一样的效果图和生成分析动画，就感觉好羡慕。\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e大学两年到现在，说真的，课程作业的每一个设计，没有一个是我真正满意的，总是到哪一步就开始勉强完成，到最后我自己都看不下去，一开始种种美好的创意和想法完全没法贯穿始终。\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e以前总是想得很美好，大学可以学这个学那个，结果到头来还是被裹挟在一门门课程和杂七杂八的事情里，一点点课就忙得焦头烂额，根本没法腾出时间去学自己想学的东西。人家大三就能做出这种东西，而我他妈真不明白为什么那么多没用的课上的我连学个rhino都没时间。\u003c/em\u003e \u003cstrong\u003e\u003cem\u003e都说做作业的过程是学习，可是出个图纸到头来还是赶个工罢了，即来不及学，也来不及应用。没有时间设计，没有时间打磨，没有时间表达，就算熬了几个通宵，做出来的自己还是不喜欢。\u003c/em\u003e\u003c/strong\u003e \u003cem\u003e他妈的。同学说什么你好厉害，呸，和别人比我就是个垃圾。提升自己？大学我提升了个屁。\u003c/em\u003e\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003e始终如此。我说实话对自己并不满意，但我也改变不了什么。我只能说，我真的尽力了。我已经很累了。到此为止，我只能在这个位置停下，遗憾在所难免。\u003c/p\u003e\n\u003cp\u003e我曾一度觉得自己是个喜欢设计的人。我早早玩过平面设计，字体排印的知识听《字谈字唱》也懂了不少，网格系统我也绝对是在作业上用得最早的一批人。Typora-LaTeX-Theme 这个项目不仅仅是CSS，也需要调整美观的版面。给社团组织做的物料就不提了。我这两天甚至还画了UI。几个建筑的老师夸过我，我一直很开心。几个月前，我还想过谈谈我对设计的认识，也就是“解决问题”，但我越来越怀疑自己是不是有这个能力。最近我经常对着电脑屏幕，然后在心里大骂一声：我是垃圾。\u003c/p\u003e\n\u003cp\u003e无力总归是无力的。\u003c/p\u003e\n\u003cp\u003e暑假前，我和同学去西湖的Apple Store，给咱们大学打了个暖心的广告：\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://pic.imgdb.cn/item/63e1e6434757feff33e6e889.jpg\" alt=\"也别读规划吧\" style=\"zoom: 33%;\"/\u003e\u003c/p\u003e\n\u003cp\u003e我没有开玩笑。\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003e七月份，我做了个有趣的社会实践，到湄潭浙大小学支教了几天。我的见闻应该写在几篇推文中了，这里不再提。我其实很愧疚，我真的越发感到自己的教学方法是不正确的。我下次绝对不会再用碳条教初学者画画了。再也不了。我很对不起那些失败的孩子们。\u003c/p\u003e\n\u003cp\u003e然后便是魔幻的，2022下半年。\u003c/p\u003e\n\u003cp\u003e我真的觉得时间飞快。仿佛什么课都没有上便迎来了封校，然后就是解封，回家，寒假。一切都是那么突然。我在某隔离酒店待了几天，虽然条件艰苦，但终归是免费的。过了两个月，我表示理解。\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://pic.imgdb.cn/item/63e1f0974757feff33f9ab66.jpg\" alt=\"刚搬到新专教的图\" style=\"zoom:33%;\"/\u003e\u003c/p\u003e\n\u003cp\u003e我学了啥呢。我感觉自己啥也没学。我只记得在改图了，改图，改图，改图……一些我并不喜欢的老师，一些要求严格的老师，一些负责任的老师，一些过于负责任的老师……然后，啪，就二月份了。结果你发现二月份还要改上个学期的图。\u003c/p\u003e\n\u003cp\u003e我真的觉得自己啥也没学。城乡规划，城市规划，太复杂了，太宏大了。这两天听了会儿澎湃新闻出品的《如此城市CityTells》，发现他们请的嘉宾都是啥呢，呵，经济学教授，中文系教授，社会学副教授，哲学副教授，作家，管理学助理教授……真是，城市规划研究的还是空间呢，真要研究城市还得是他们这些外专业的。妈的。城市规划的人真是全才，细化到每个领域又不能变成三脚猫，真tm牛逼，咋这么难呢。本科就要5年，专业课塞得满满当当，还是一点皮毛都学不到。这真是让人学的？\u003c/p\u003e\n\u003cp\u003e我觉得咱们的培养体系还是有问题。就和我教一帮从没学过画画的人用碳条画茶壶一样，有点不能让人接受了。\u003c/p\u003e\n\u003cp\u003e所以我感觉现在自己的设计还只是照葫芦画瓢，做了一个仿佛很有意义，其实没有内容的小区；画了一堆仿佛很合理，但根本没认真调研的路网；写了一堆仿佛符合国家政策，其实根本不知道在说什么的论文。\u003c/p\u003e\n\u003cp\u003e我在学习如何讲合理的废话。学吧。毕竟咱是正儿八经高考上来的工科生，学点社科生的本事，不然播客嘉宾都请不上咱们呢。\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003e我真的有一种焦虑的情绪。\u003c/p\u003e\n\u003cp\u003e我不知道老师会怎么说。但我看着自己的未来真的感觉很迷茫。研肯定是要读的。不读研城规连对口工作也没有。但是对口工作能干嘛呢。我看有人说浙江省规院能有一年能有20（硕士毕业），我不太信，就算有那么些，我也怀疑我的身子板能不能撑得住这强度。去考公吧？宇宙的尽头是编制。但是能干嘛呢，一天天坐在办公室给设计院审批文件过不过吗。\u003c/p\u003e\n\u003cp\u003e转行吧？但我又会啥呢。我啥也不会啊。\u003c/p\u003e\n\u003cp\u003e读了规划，你就啥也不会了。\u003c/p\u003e\n\u003cp\u003e你不会编程吧，你不会金融吧，你不会管理吧。还想跳槽去干嘛？创业都轮不到你。脑子只会合理地讲废话了。对城市对空间设计懂点，对别的岗位有啥帮助吗？\u003c/p\u003e\n\u003cp\u003e迷茫。\u003c/p\u003e\n\u003cp\u003e我开了个公众号，本意真的是分享点生活赚点广告费。真的。我想搞钱。流量最高的那篇广告费差不多有5块吧，别的文章，如果我那天有发，基本是0.1、0.2的赚，像我现在停更了，没人看，也自然没有腾讯的广告费。\u003c/p\u003e\n\u003cp\u003e要往自我意义的实现来说，我本还想做点规划科普，讲讲学到的知识——毕竟输出倒逼输入嘛！但是……没劲，太累了。搞好学业就那么累了，何苦再给自己别的任务呢。\u003c/p\u003e\n\u003cp\u003e你看，自媒体的路子也被我自己堵死了。\u003c/p\u003e\n\u003cp\u003e这下真没别的路了。\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003e我想说，还有一些别的事情也一直在影响我的选择和判断……我对不起某位曾经的朋友。抱歉。\u003c/p\u003e\n\u003cp\u003e我也认识了很多有意思的人。2022，有很多人拉过我一把。感谢。\u003c/p\u003e\n\u003cp\u003e很久没有认识新的网友了。小学初中时结识过一批52poke上的朋友，如今也都不再联系，加之前年QQ被封，不少记忆也都随之消弭了。我真算是个幸运的小粉丝，能和一位up主成为朋友（应该算吧？）。\u003c/p\u003e\n\u003cp\u003e自己又写得这么丧了啊……我真是个悲观文学作者。2023年，希望各位都能更快乐些吧 (´・ω・`)\u003c/p\u003e\n\u003cp\u003e不说了罢，我去B站再听一下ilem的《大吉》洗洗脑子。\u003c/p\u003e\n\n    \u003c/div\u003e",
  "Date": "2023-01-27T06:23:47Z",
  "Author": "Keldos"
}