{
  "Source": "johnj.com",
  "Title": "Settling In",
  "Link": "http://johnj.com/posts/settling-in/",
  "Content": "\u003cmain class=\"content\"\u003e\n\n\n\u003ch1\u003eSettling In\u003c/h1\u003e\n\n\n\u003cp\u003e\n\n\u003ca class=\"tag\" href=\"/tags/southpole\"\u003e\u003cspan class=\"southpole-tag\"\u003esouthpole\u003c/span\u003e\u003c/a\u003e\n\n  ..... \u003cem\u003e\u003ctime class=\"postdate\" datetime=\"2007-01-30T00:00:00Z\"\u003e\n      January 30, 2007\n    \u003c/time\u003e\u003c/em\u003e\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/gouache-and-a-new-system/\"\u003eGouache, and a new system for conquering the world\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/batteries-and-sheep/\"\u003eBatteries and Sheep\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003cp\u003e\nBeen here a bit more than 24 hours, and I\u0026#39;m settling in. Mostly I\u0026#39;ve\nbeen preoccupied with debugging a particularly nasty system error in\nour device driver; hopefully I\u0026#39;ll have that wrapped up soon and can\njoin Kael, Keith and Dave in higher-level deployment and testing of\nDAQ (the data acquisition software).\u003c/p\u003e\n\u003cp\u003e\nOnce I get acclimated to the altitude I\u0026#39;ll be much happier. It\u0026#39;s been\nhitting a bit harder than last year, though I took the diamox they\nencouraged us to take in McMurdo. Unfortunately the diamox makes my\nhands and feet and face feel like they\u0026#39;re buzzing, which is\nirritating. And I\u0026#39;m generally out of breath, and have to pee\nconstantly (apparently the body adjusts its pH to the new altitude\nthis way). Out in the Dark Sector (the radio-quiet area where our\nexperiment is) the facilities consist of a \u0026#34;solar\u0026#34; (i.e., painted\nblack) toilet; the solar toilet is essentially an otherwise unheated\nouthouse with a styrofoam toilet seat built over a half-buried waste\nbarrel. Ah, the life of luxury.\u003c/p\u003e\n\u003cp\u003e\nAll is pretty good, though, and it\u0026#39;s fun to see familiar, sunburnt\nfaces with unwashed hair (remember, 2 showers per week, 2 minutes\neach, folks!), and the same old tracked vehicles and space-age\nbuildings and the endless horizon and the great big open sky with long\nsimple cloud shapes a seemingly infinite distance away. I\u0026#39;m settling\nin and with any luck we can start to get stuff done quickly.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/gouache-and-a-new-system/\"\u003eGouache, and a new system for conquering the world\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/batteries-and-sheep/\"\u003eBatteries and Sheep\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003c/main\u003e",
  "Date": "2007-01-30T00:00:00Z",
  "Author": "John Jacobsen"
}