{
  "Source": "johnj.com",
  "Title": "Milvans and Container Malls",
  "Link": "http://johnj.com/posts/milvans-and-container-malls/",
  "Content": "\u003cmain class=\"content\"\u003e\n\n\n\u003ch1\u003eMilvans and Container Malls\u003c/h1\u003e\n\n\n\u003cp\u003e\n\n\u003ca class=\"tag\" href=\"/tags/southpole\"\u003e\u003cspan class=\"southpole-tag\"\u003esouthpole\u003c/span\u003e\u003c/a\u003e\n\n  ..... \u003cem\u003e\u003ctime class=\"postdate\" datetime=\"2011-12-02T00:00:00Z\"\u003e\n      December 2, 2011\n    \u003c/time\u003e\u003c/em\u003e\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/programming-languages/\"\u003eProgramming Languages\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/oxygen/\"\u003eOxygen\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003cp\u003e\nDec. 2, 2011, 08:10 NZDT Tranz Coastal train from Christchurch to Picton\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/6443326759_c11f631340_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/6443326759_c11f631340_o_hu8396f6acf4047a9131941946b7dc76d3_1051260_700x0_resize_q75_box.jpg\" style=\"width:400px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nObservatory Hill in McMurdo\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/6443344379_31d9172afc_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/6443344379_31d9172afc_o_hu17994071c6b93ade232789192ac2621f_1222090_700x0_resize_q75_box.jpg\" style=\"width:400px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nThe new Cashel Mall in Christchurch\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nAnother gorgeous summer day here as the countryside rolls by: grassy,\ngreen hills punctuated by trees passing singly and in groups, as well\nas cattle, horses, and the ubiquitous sheep, which appeal strongly for\nsome reason today, signaling tranquility, domesticity… humans living\nin pastoral harmony with the land. Icebreaker, perhaps my favorite\nclothing brand, puts tags on their merino wool clothes, each with a\nunique code you can type into their Web site to find out which sheep\nfarm in New Zealand your woollen item comes from. I wonder if I’ll\npass the farm that made the wool in the shirt I’m wearing. It’d be\nnice they would sell the sheep as well from their Web site. Or maybe\neven whole farms….\u003c/p\u003e\n\u003cp\u003e\nI’m on my habitual route from Christchurch to Wellington to see\nfriends Neil and Amelia for a few days before heading back to\nChicago. The usual blue, slightly creaky train cars have been upgraded\nto sleek new tan-colored ones with power outlets under the seats,\nbigger windows and a quieter ride — overall, an improvement. Flying\nwould take one-tenth the time but I’m spending enough time on\nairplanes, and at any rate the scenery is quite gorgeous, an antidote\nto both the polar plateau and the coming Chicago winter.\u003c/p\u003e\n\u003cp\u003e\nI had just over a full day in Christchurch. As with the Elms hotel on\nthe way down, the Pavillions was a disappointment. Expensive WiFi and\nrooms, noisy, with somewhat cheesy decor. Paying for WiFi is\nparticularly irksome since it I know how cheap it is to implement — it\nfeels like paying for tap water, by the cup. However, beggars cannot\nbe choosers and the hotel situation in Christchurch is dismal after\nthe February quake.\u003c/p\u003e\n\u003cp\u003e\nThe advantage of the Pavilions is that is it relatively close to\ndowntown. Had a big breakfast yesterday at a nearby cafe, and an\ninteresting conversation with a friendly fellow diner who is very into\nmeditation and marathoning and was accompanying a group of kids coming\nout of some month-long South Island adventure. Then I trotted down\nVictoria Street into the downtown area. Much is still fenced off so I\nhad to circumambulate a couple-block area in various stages of\ndemolition. Eventually I found myself on Armagh street staring at a\nfamiliar sign, that of the Winsor hotel, the first place I ever stayed\nin New Zealand. The familiar building, however, is gone, replaced by a\ngeneric looking construction-in-progress. Half a block closer to\ndowntown, the Devon, my favorite place to stay, is completely gone,\nrecognizable only by the fence behind the original parking lot. It’s\nall parking lot now. One thing to be said about Christchurch is that,\non average, you can see farther now.\u003c/p\u003e\n\u003cp\u003e\nI’ve laid down a lot of pre- and post-Antarctic memories in these\nplaces so it was a blow to see them gone… gone so completely that it\nwas hard to even tell where they’d been. Certainly a vivid\nillustration of the impermanence of things. Walking back towards the\nhotel I was snatched up by IceCube colleagues driving by: Stephanie\nand Anthony from Canterbury University. We were joined by Sarah at a\ncombination cafe and garden store, where I had a delicious salad\n(still making up for polar freshie deficit) and “chocolate ice” (a\nsort of shake made with chocolate and whipped cream). After lunch we\ndrove downtown to the new Cashel Mall, an area that was hit so hard\nthat no original buildings remain. Instead, a few dozen structures\nmade of shipping containers occupy a roughly one block area, serving\nas a new shopping mall. This sounds dubious on paper but in execution\nit was, like many things New Zealand, fabulously gorgeous and chic —\nimagine FEMA as tutored by hip architects gunning for a multi-page\nspread in Dwell Magazine. Walked back alone past the Christchurch art\ngallery, the Arts Centre, and the Dux De Lux, all still closed. Then\nthrough the Botanic Garden, in full bloom and betraying no evidence of\nseismic calamity, and “home” for Thai dinner and an early bedtime to\nprepare for the early morning departure of the train.\u003c/p\u003e\n\u003cp\u003e\nChristchurch and McMurdo seemed to lift me out of my slightly numb\nSouth Pole funk. In McMurdo, I felt some of the thrill towards the\ngritty texture of the town I used to experience each time I came\ndown. Much of that texture has been bypassed in recent trips because\nthey were straight-throughs, landing at Pegasus only to change planes.\u003c/p\u003e\n\u003cp\u003e\nMy roommate in McMurdo was Bill, a kindly videographer from Chicago\nwho’s lived in Louisiana long enough to acquire the Southern\ndrawl. Bill said out of the blue, “It really is the simple pleasures\ndown here which make life worth living.” A couple of showers and\nsalads and nine hours of sleep, concurrent with continual\nre-saturation in oxygen, and I was inclined to agree. By Wednesday\nmorning, I had enough time and energy to walk to Hut Point and summit\nOb Hill before lunch, taking lots of pictures of “milvans” (shipping\ncontainers), buildings, and rock and ice along the way. At Hut Point I\nsat for awhile with eleven seals sunning themselves nearby on the ice,\nsome the size of small Chevies. Trails from the seals to nearby holes\nin the ice which looked far too small to accommodate the animals… and\nsome blood stains near one of these were a reminder that this was not\na sanitized game park but actual habitat, with life and death\ncoexisting precariously as always… perhaps more so, at the base of\nMount Erebus (whose volcanic plume could be seen in the clear,\ncontinual daylight), there on the edge of the highest, windiest,\ndriest, coldest, iciest, emptiest, cleanest, darkest, quietest\ncontinent.\u003c/p\u003e\n\u003cp\u003e\nAt lunch I met a longtime colleague Ryan, waiting for his LC-130 ride\nto Wais Divide. Ryan went to the Pole as an undergraduate on AMANDA,\nyears before I did, and now he does mostly glaciology and climate\nstudies at UC Berkeley, logging dust concentrations as a function of\ndepth in deep holes across Antarctica. We talked about deploying to\nthe Ice over and over again. His perspective interested me. “It’s a\nnice break from your routine, back up North. And you come back\nstronger each time.” I thought about it for a bit, and I think I\nagree. As one gets older it is easy to get into a comfortable routine\n— I have a really good life in the North: Eden, meditation, art, work,\nChicago, Madison, family and friends. But the months do speed by, and\ndeviations from routine seem more and more jarring. Traveling does\nbreak you out of that. Even simple things like remembering what needs\nto be done without relying on a computerized to-do list seem easier\nafter a few weeks of having to keep track of gear, travel dates, and\never-changing circumstances.\u003c/p\u003e\n\u003cp\u003e\nI had time for a nap before reporting to the Movement Control Center\nfor the flight to Christchurch. Eighteen of us packed our gear and\nselves into a Delta and headed out to the Ice Runway, one of the last\nflights to do so this season (flight operations transition to Pegasus\nairfield as of today, considerably farther away from town). Despite\nthe quick trip to the plane, we wound up spending a good hour parked\nnearby, while the back of the Delta gradually turned into a\ngreenhouse, cooking us in our ECW gear until we opened, against strict\ninstructions not to, the back door of the vehicle to let in some cool\nair. Finally we made it on board and got a good look at the cause for\ndelay — two empty liquid helium dewars, each the size of a small\nschool bus, which no doubt were tricky to tie down correctly (I, for\none, was happy for the extra attention to detail on the matter).\u003c/p\u003e\n\u003cp\u003e\nEighteen passengers is a pretty light manifest for a C-17. After\ntakeoff some people took several seats along the side walls and\nmanaged to sleep that way for most of the five hours to\nChristchurch. I was perhaps the only one to mosey up to the flight\ndeck. Talked with one of the pilots for awhile, who said he’d been to\n55 countries since he started flying in his squadron. Most commonly\nIraq and Afghanistan, of course, but also frequently to Southeast Asia\n— they are apparently still finding remains of American soldiers in\nVietnam (DNA techniques being the evident game-changer there), and\naren’t above sending C-17s down to collect them, with appropriate\nceremony, one assumes.\u003c/p\u003e\n\u003cp\u003e\nWe’re pulling into Kaikoura now, so I’m going to tie this off for\ntoday and get a breath of fresh air. Already saw some seals in the\nwater from the train. Liquid water, as far as the eye can see… what a\nstrange and marvelous improvement, over an ocean of ice.\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/6444387801_6c5182651d_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/6444387801_6c5182651d_o_hud1a3444e3b3d054b9afd142ef5a7c5c8_312160_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nNew train in Kaikoura\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/6444387113_dda21c553c_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/6444387113_dda21c553c_o_hu17994071c6b93ade232789192ac2621f_495476_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nMarlborough Sounds\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/programming-languages/\"\u003eProgramming Languages\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/oxygen/\"\u003eOxygen\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003c/main\u003e",
  "Date": "2011-12-02T00:00:00Z",
  "Author": "John Jacobsen"
}