{
  "Source": "johnj.com",
  "Title": "Chasing the Sun",
  "Link": "http://johnj.com/posts/chasing-the-sun/",
  "Content": "\u003cmain class=\"content\"\u003e\n\n\n\u003ch1\u003eChasing the Sun\u003c/h1\u003e\n\n\n\u003cp\u003e\n\n\u003ca class=\"tag\" href=\"/tags/southpole\"\u003e\u003cspan class=\"southpole-tag\"\u003esouthpole\u003c/span\u003e\u003c/a\u003e\n\n  ..... \u003cem\u003e\u003ctime class=\"postdate\" datetime=\"2011-01-02T03:32:00Z\"\u003e\n      January 2, 2011\n    \u003c/time\u003e\u003c/em\u003e\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/bardo/\"\u003eBardo\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/downhole/\"\u003eDownhole\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/5403514868_5a311173e2_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/5403514868_5a311173e2_o_huce1e2c6cdaa262e44612a61ea257cb8e_451561_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\u003c/p\u003e\n\u003cp\u003e\nHappy New Year to everyone from the skies somewhere over the western\nUSA, en route to LAX. This is my ninth and probably final trip to the\nGeographic South Pole, and if you’re reading this you probably know me\nand know I’ve been preparing for this trip off and on for a number of\nmonths (and, in some ways, for decades — more on that later). Now I am\nfinally under way, and I’m relieved to be launched and finally headed\ntowards whatever this journey will bring.\u003c/p\u003e\n\u003cp\u003e\nI have done some writing and some photography on every trip, and\npublished writing or photos in some form during most of them — in some\ncases just emails to friends and family; more recently, in\nblogs. There are a few reasons for doing this, not the least of which\nis to let loved ones know where I am and that I’m safe. I also find\nthat the writing process helps me to capture, absorb and explore the\nexperience of going somewhere few people get to go. But it is also an\nopportunity to give some of that experience back to all the people who\nhave contributed (at least in the form of tax dollars) to support me\nand my colleagues in the US Antarctic Program.\u003c/p\u003e\n\u003cdiv id=\"outline-container-headline-1\" class=\"outline-3\"\u003e\n\u003ch3 id=\"headline-1\"\u003e\nThis Year’s Blog\n\u003c/h3\u003e\n\u003cdiv id=\"outline-text-headline-1\" class=\"outline-text-3\"\u003e\n\u003cp\u003e\nMy intention is to post photos and text here every day for the next 28\ndays or so. My entries may therefore be briefer than they have been in\npast years. I will try to cover some of the the basics of the trip\n(why go; logistics; etc.). I also may indulge in personal musings on\nthe whole process and about the overall experience over the past\nfourteen years. Finally, I want to invite you to contact me and \u003cstrong\u003elet me\nknow if there is anything you would like me to explain, describe, etc.\u003c/strong\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003cdiv id=\"outline-container-headline-2\" class=\"outline-3\"\u003e\n\u003ch3 id=\"headline-2\"\u003e\nSpecial Goals\n\u003c/h3\u003e\n\u003cdiv id=\"outline-text-headline-2\" class=\"outline-text-3\"\u003e\n\u003cp\u003e\nIn previous years I have tried to enumerate certain personal goals or\nprojects in advance (in addition to objectives for work,\nobviously). These goals have been things like workouts, regular\nmindfulness meditation practice, art projects, places to see, books to\nread, etc. I have supplies along for all those things, but for this\nyear I would like to set one goal, which is to be as awake as possible\nto the entire experience as I can. This may mean fewer activities than\nin past years, (or shorter blog posts, except for this one!); but this\nis probably my last trip down here and I’d rather enjoy the things\nthat come along of their own accord than to try to chase around to see\nor do everything I missed on previous trips (or re-do things I’ve\nalready done).\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003cdiv id=\"outline-container-headline-3\" class=\"outline-3\"\u003e\n\u003ch3 id=\"headline-3\"\u003e\nWhy Is This The Last Trip?\n\u003c/h3\u003e\n\u003cdiv id=\"outline-text-headline-3\" class=\"outline-text-3\"\u003e\n\u003cp\u003e\nMany people have asked why this is the last trip (and have pointed out\nthat I’ve said that every trip would be the last). This year truly is\ndifferent in that this is the last construction season for \u003ca href=\"http://icecube.wisc.edu\"\u003ethe IceCube\nproject\u003c/a\u003e — we have deployed the final of 86 strings just a few weeks\nago, and when these seven latest strings are brought online, the\ndetector (already operational in limited forms since 2005) will be\ncomplete, so there will be very little need to send people like myself\nin future years (of course who knows about future projects, etc. — but\nreally, folks, this probably is the last time for me).\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003cdiv id=\"outline-container-headline-4\" class=\"outline-3\"\u003e\n\u003ch3 id=\"headline-4\"\u003e\nHow to Get Updates\n\u003c/h3\u003e\n\u003cdiv id=\"outline-text-headline-4\" class=\"outline-text-3\"\u003e\n\u003cp\u003e\nSome people have asked how they can get notified when the blog is\nupdated. I would prefer not to spam people’s inboxes with\nnotifications, since I don’t know who really wants to get a daily\nupdate and who would rather not. So, there are a few ways which should\nall work well:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eJust visit \u003ca href=\"http://johnj.com/\"\u003ehttp://johnj.com/\u003c/a\u003e and look at the Recently Updated links;\u003c/li\u003e\n\u003cli\u003eSubscribe to the RSS feed for this site (use Google Reader or other blog reading software);\u003c/li\u003e\n\u003cli\u003eFollow me as “\u003ca href=\"https://twitter.com/eigenhombre\"\u003eeigenhombre\u003c/a\u003e” on Twitter\u003c/li\u003e\n\u003cli\u003eIf we are Facebook friends, follow my status updates;\u003c/li\u003e\n\u003cli\u003eIf you want just the photos, they will be posted on Flickr, possibly a day or so before a subset of the pictures make it to the blog. There is an RSS feed for just the photos, as well.\u003c/li\u003e\n\u003cli\u003eIf you really want an email notification, there are free services on the Web that will notify you when an RSS feed is updated, so please use one of those.\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eIf you think of someone who would be interested in the blog and who I\nam not in contact with on Facebook or Twitter, please do forward them\nthe link to the blog.\u003c/p\u003e\n\u003cp\u003e\nMany thanks, and a fruitful, peaceful and prosperous 2011 to all.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/bardo/\"\u003eBardo\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/downhole/\"\u003eDownhole\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003c/main\u003e",
  "Date": "2011-01-02T03:32:00Z",
  "Author": "John Jacobsen"
}