{
  "Source": "johnj.com",
  "Title": "A Nicer Guy?",
  "Link": "http://johnj.com/posts/a-nicer-guy/",
  "Content": "\u003cmain class=\"content\"\u003e\n\n\n\u003ch1\u003eA Nicer Guy?\u003c/h1\u003e\n\n\n\u003cp\u003e\n\n\u003ca class=\"tag\" href=\"/tags/southpole\"\u003e\u003cspan class=\"southpole-tag\"\u003esouthpole\u003c/span\u003e\u003c/a\u003e\n\n  ..... \u003cem\u003e\u003ctime class=\"postdate\" datetime=\"2011-11-11T06:08:00Z\"\u003e\n      November 11, 2011\n    \u003c/time\u003e\u003c/em\u003e\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/bon-voyage/\"\u003eBon Voyage\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/the-quiet-earth/\"\u003eThe Quiet Earth\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\n\u003c/p\u003e\u003cp\u003e\n17:01 NZDT B2 Science, Amundsen-Scott South Pole Station\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/6333051401_fff7b4cde3_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/6333051401_fff7b4cde3_o_hu04c30c3b16d833002f70970bb6a6e5f6_641295_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nEn route to South Pole\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nBeen here just over a day now and am settling in. Once I get here it’s\neasy to settle into a work routine, which makes it harder to do much\nwriting. But I’m still acclimating to the altitude, trying to rest and\nstay hydrated, and the schedule isn’t too intense so far.\u003c/p\u003e\n\u003cp\u003e\nDid a debrief today of our outgoing winter-over (WO) scientists, who\nare leaving tomorrow, and did some training of our new WOs as\nwell. Our old WOs are in good spirits but also happy to leave, and I\ndon’t blame them. In addition to having been here for most of a full\nyear (with just a brief R\u0026amp;R break before station closing), it sounded\nlike a pretty challenging winter, with medical emergencies you can\nGoogle about (and some you can’t). I’m glad I came when I did because\nit has been fascinating to hear their stories and their perspective.\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/6327681755_ac84151772_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/6327681755_ac84151772_o_hu7de417fd6e917ac15e54c386909bce6a_738413_700x0_resize_q75_box.jpg\" style=\"width:500px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nMcMurdo Evening\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/6328431218_268aae5dd6_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/6328431218_268aae5dd6_o_hu04b64d0c6f0813b810806539951b6a2f_1228960_700x0_resize_q75_box.jpg\" style=\"width:500px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nBuilding 155\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nMy last post left off somewhere in the air between New Zealand and\nMcMurdo. We arrived safely at the seasonal Ice Runway and were quickly\nput onto Ivan the Terra Bus. I couldn’t believe how close we were to\ntown — the last several seasons I’ve landed at Pegasus which is a good\nhour (at minimum) from town. But Observation Hill and McMurdo proper\nwere clearly visible and seemed but a stone’s throw from the Ice\nRunway, which I think they only operate early in the season when it’s\ncold enough to land there. The trip into town took a mere 20 minutes\nor so, after which we were briefed on life in town — a briefing which\nI’ve attended ten times now and portions of which I think I can recite\nfrom memory, despite the fact that much of it doesn’t really apply to\nshort-timer Polies (I have never done laundry in McMurdo, used the\ngym, or even walked very far out of town, something which one cannot\ndo without attending an outdoor safety lecture).\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/6333781134_bf4dba28ed_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/6333781134_bf4dba28ed_o_hua0165a735ee83dc6ed3029f48e923de9_1410526_700x0_resize_q75_box.jpg\" style=\"width:400px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nStreet texture\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nFrom the briefing I went to Crary Lab, got my laptop screened, and\nchecked email, and then went to settle into my room… but not before\ngrabbing someone else’s Big Red parka by mistake (they all look alike,\nand his name is similar to mine, and …). Before long I noticed my\ngloves, which were in my parka pockets, were missing, so I figured I’d\nleft them somewhere, and chased around trying to find them for an hour\nor so (losing and re-finding USAP issue clothing seems to be my karmic\nfate each and every trip). My hat, I noticed, was also gone — that\ntipped me off to the fact that I had the \u003cem\u003ewrong jacket\u003c/em\u003e, so I went back\nto Crary lab, gave back the jacket I “stole,” got mine (gloves and hat\nincluded), and went to a very crowded galley for chow. After dinner we\nweighed-in and I managed to get to bed early, in a room with only one\nother fellow in it (McMurdo facilities manager and unicycle\naficionado).\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/6333041917_46c8851ef2_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/6333041917_46c8851ef2_o_hu0d9cb3213456c0c164a94db750a75023_822922_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nFlight manifest\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nOur flight schedule was not nailed down by the time I went to bed, so\nI was up at 5 AM and went off to check the flight manifest. By 8 we\nwere at the Movement Control Center along with passengers headed to\ntwo other places on the continent. Our flight to the Pole consisted of\njust five regular passengers, plus the Guard crew, and a woman,\nalready on the plane, who I assumed was a Distinguished Visitor or\nreporter of some sort. The plane was jammed full of cargo and some\nmedical equipment and stretchers I assumed were bound for South Pole\nMedical. Later I learned that our flight was actually a medevac flight\nand that they were taking someone back to McMurdo in a hurry, which\nmay have explained the rather hasty briefing (barely audible over the\nroar of the props) that we got on the plane.\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/6333793306_2c5aa60db0_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/6333793306_2c5aa60db0_o_hu1e1947c04cab93bad5df8ff6b9ffeb4b_496536_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nBaseler bound for Byrd Camp\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nThough there were minor differences when compared to previous trips,\nit was mostly quite familiar, and I found myself going through the\nmotions, not really being surprised by anything. At one point I sort\nof woke up and said to myself, Dude, you are on a military aircraft\nbound for the South Pole. Pay attention.\u003c/p\u003e\n\u003cp\u003e\nThat more or less worked, and though I did play with some programming\nstuff on my laptop for a lot of the flight, I also enjoyed the strange\nfamiliarity of it, the familiar strangeness. Somehow being bundled up\nin ECW gear and earplugs in a roaring C-130, with all its green guts\nclearly exposed for the viewing, just feels like the canonical\nAntarctic experience to me.\u003c/p\u003e\n\u003cp\u003e\nI managed to get up to the flight deck around when we passed over the\nTrans-Antarctic Mountains. The vast Beardmore Glacier stretched below,\nthrough black ridges of rock, a creamy, motionless river riddled with\ngreat crevasses which looked like tiny scratches at that\ndistance. Though our window views were limited throughout the flight\n(due to the bulk of the cargo), that view out the front windows of the\naircraft was stunning. The crew made sure I could take pictures and\nvideo from various angles, moving aside and motioning me\nforward. After I got my shots in, I talked to one of them and asked\nhim about the geography we were passing through; he said, “I don’t\nknow, I’m just a doctor.” (Presumably he was assisting with the\nmedevac.)\u003c/p\u003e\n\u003cp\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/6333043895_8a8eff5b6d_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/6333043895_8a8eff5b6d_o_hu94083634e420f58aec9128948e99eb6c_794013_700x0_resize_q75_box.jpg\" style=\"width:500px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\u003c/p\u003e\n\u003cp\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/6333789324_bf735e806c_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/6333789324_bf735e806c_o_hu94083634e420f58aec9128948e99eb6c_647142_700x0_resize_q75_box.jpg\" style=\"width:500px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\u003c/p\u003e\n\u003cp\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/6333032527_12bfd4c8d1_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/6333032527_12bfd4c8d1_o_hu417a84e9fe229793d4312d39ae4a1d63_286225_700x0_resize_q75_box.jpg\" style=\"width:500px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\u003c/p\u003e\n\u003cp\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/6333790454_ab28815881_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/6333790454_ab28815881_o_hufbaf2f11e1af9cb4d0080e99e0414c5e_581624_700x0_resize_q75_box.jpg\" style=\"width:500px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\u003c/p\u003e\n\u003cp\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/6333787198_c896936e67_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/6333787198_c896936e67_o_hu752226d2e0a545cbdfc755aac567713a_413165_700x0_resize_q75_box.jpg\" style=\"width:500px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\u003c/p\u003e\n\u003cp\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/6333045095_d6185b59c2_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/6333045095_d6185b59c2_o_hu51e1a2796a5f7bc6badce46aab091845_221899_700x0_resize_q75_box.jpg\" style=\"width:500px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\u003c/p\u003e\n\u003cdiv id=\"outline-container-headline-1\" class=\"outline-3\"\u003e\n\u003ch3 id=\"headline-1\"\u003e\nVideo from Flight Deck\n\u003c/h3\u003e\n\u003cdiv id=\"outline-text-headline-1\" class=\"outline-text-3\"\u003e\n\n\u003ciframe src=\"http://player.vimeo.com/video/31932373?byline=0\u0026amp;portrait=0\" width=\"512\" height=\"288\" frameborder=\"0\" webkitallowfullscreen=\"\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\n\u003cp\u003e\nAt some point between McMurdo and arriving at Pole, maybe on the\nairporter bus to the Ice Runway, I thought about how much of a\ncollaborative effort all of this is, this whole Antarctic program. The\nshuttle driver; the passenger manager who gave us our lunches,\nearplugs and a safety briefing; the pilots and crew; the airplane\nmechanics; the satellite techs; the waste management folks… there are\nso many people working together here, professionally and (for the most\npart) harmoniously… so many people doing their jobs, to keep us and\neach other alive and safe and to enable scientists to do their\njobs. It is quite humbling, actually, to be on the receiving end of\nthat. That of course is the reality of the “Real World” too — it’s\njust that so many of those people Up North are actually invisible… the\nwater treatment engineers, air traffic controllers, homicide\ndetectives, construction workers, priests… people you don’t normally\nsee but who keep you alive and safe. Here, things are turned inside\nout, the machinery is exposed for all to see, you see each other more\n— everybody pitches in, whether it’s “house mouse” duties (cleaning\nbathrooms, etc.), working in the dish pit, helping to load “freshies”\ninto the galley, … you eat dinner with the people here who load your\ncargo and handle fuels from the Hercs, with the cooks and the managers\nand the dishwashers. People who could and would save your life if\nneeded. Somehow it’s just more clear who you rely on here… and they\nrely on you too. It’s a good experience to have.\u003c/p\u003e\n\u003cp\u003e\n(It is also interesting to go somewhere where your comfort is not\nanybody’s primary concern, and where nobody is trying to sell you\nanything, but perhaps that’s a topic for another post.)\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/6333802026_88035c7ebe_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/6333802026_88035c7ebe_o_hubcc1361c9646f1e0833d5f4c4190d6f3_875229_700x0_resize_q75_box.jpg\" style=\"width:400px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nBriefing prior to boarding LC-130 to Pole\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nArriving at the Pole was a rush, as always. It was about 40 below,\nmaybe -66F with the wind chill. Freija, Sven, and Carlos met us at the\nskiway. Strangely enough, of all the places I’ve passed through in the\npast few days, this place feels most like home. And, as usual, I know\na bunch of people here and recognize many more faces. But it’s less\ncrowded than I’m used to, and I’m a bit more relaxed too, both of\nwhich are nice.\u003c/p\u003e\n\u003cp\u003e\nI sat down at lunch with a communications engineer named James who I\nmet last season. James likes to discuss particle physics and quantum\nmechanics. I sat down with him and a GA named Pete, a young fellow\nwith a robust blond beard who fights wildfires back in the real world.\u003c/p\u003e\n\u003cp\u003e\nJames, sitting across from me, asked, “So, have you learned anything\nin the past year?”\u003c/p\u003e\n\u003cp\u003e\n“You mean has IceCube made any discoveries, or have I personally?”\u003c/p\u003e\n\u003cp\u003e\n“You personally.”\u003c/p\u003e\n\u003cp\u003e\nI thought about it. “Yes, I think I’ve learned a lot, actually.”\u003c/p\u003e\n\u003cp\u003e\n“Such as?” asked James.\u003c/p\u003e\n\u003cp\u003e\n“Well, I think I’ve really learned a lot about programming.”\u003c/p\u003e\n\u003cp\u003e\n“Okay… I guess that’s good,” he replied.\u003c/p\u003e\n\u003cp\u003e\n“Also, I think I’m a nicer guy.”\u003c/p\u003e\n\u003cp\u003e\nAt my side, Pete nodded sagely, and said, “That’s good. That’s good.”\u003c/p\u003e\n\u003cp\u003e\nIt is.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/bon-voyage/\"\u003eBon Voyage\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/the-quiet-earth/\"\u003eThe Quiet Earth\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003c/main\u003e",
  "Date": "2011-11-11T06:08:00Z",
  "Author": "John Jacobsen"
}