{
  "Source": "johnj.com",
  "Title": "Getting Ready (t minus 2 days)",
  "Link": "http://johnj.com/posts/getting-ready/",
  "Content": "\u003cmain class=\"content\"\u003e\n\n\n\u003ch1\u003eGetting Ready (t minus 2 days)\u003c/h1\u003e\n\n\n\u003cp\u003e\n\n\u003ca class=\"tag\" href=\"/tags/southpole\"\u003e\u003cspan class=\"southpole-tag\"\u003esouthpole\u003c/span\u003e\u003c/a\u003e\n\n  ..... \u003cem\u003e\u003ctime class=\"postdate\" datetime=\"2005-01-07T00:00:00Z\"\u003e\n      January 7, 2005\n    \u003c/time\u003e\u003c/em\u003e\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/launched/\"\u003eLaunched\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003cp\u003e\nLast latched GPS: N41d59.099\u0026#39; W87d39.934\u0026#39;\u003c/p\u003e\n\u003cp\u003e\nT minus 2 days. Biggest snow storm in 2 years getting me warmed up for\nthe Pole. I\u0026#39;ve gone out each morning for the past few days on \u0026#34;trial\nruns\u0026#34; with Dad\u0026#39;s old Horseman camera and tripod. Yesterday, by the\ntime I got to Lake Michigan, the shutter cock had frozen (not a good\nsign) and I only got half a roll. But the film grain looks very fine\n(APX-100) and today the shutter worked ok.\u003c/p\u003e\n\u003cp\u003e\nOn the beach everything was pure white except the lake itself (still a\nstormy dark grey), two men out exercising their dogs, and a snowbreak\nfence winding along the beach. I got some good photos of that and\nfinished up my roll. After that I decided to get up close to the water\nand noticed many shapes bobbing up and down in the water. At first I\nthought it was some sort of clot of weeds, but then my head flashed\ngrimly to the image of tsunami victims washing up.\u003c/p\u003e\n\u003cp\u003e\nWhat it actually turned out to be was quite beautiful and mysterious\n– thousands of basketball-sized, weed-covered snowballs (iceballs?)\nwashed up on the water\u0026#39;s edge. One of the dogs attacked them one after\nanother and pulverised them for fun. It was an amazing thing to see\nand got me in the mood for the trip. After a few weeks at the Pole,\neven a few weeds on snowballs are going to seem pretty darn organic.\u003c/p\u003e\n\u003cp\u003e\nMeanwhile, so much to do…\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/launched/\"\u003eLaunched\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003c/main\u003e",
  "Date": "2005-01-07T00:00:00Z",
  "Author": "John Jacobsen"
}