{
  "Source": "johnj.com",
  "Title": "Immortality",
  "Link": "http://johnj.com/posts/immortality/",
  "Content": "\u003cmain class=\"content\"\u003e\n\n\n\u003ch1\u003eImmortality\u003c/h1\u003e\n\n\n\u003cp\u003e\n\n\u003ca class=\"tag\" href=\"/tags/southpole\"\u003e\u003cspan class=\"southpole-tag\"\u003esouthpole\u003c/span\u003e\u003c/a\u003e\n\n  ..... \u003cem\u003e\u003ctime class=\"postdate\" datetime=\"2009-01-29T07:00:00Z\"\u003e\n      January 29, 2009\n    \u003c/time\u003e\u003c/em\u003e\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/in-a-dry-and-waterless-place/\"\u003eIn a Dry and Waterless Place\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/routine/\"\u003eRoutine\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003cp\u003e\nDespite the morning’s wind and low visibility, colleague Joanna just\narrived from Berkeley hand-carrying some cables and a special surprise\nfrom Jerry at LBNL, carefully packaged in anti-static plastic and\nbubble wrap.\u003c/p\u003e\n\u003cp\u003e\nIt’s the printed circuit board from one of our Digital Optical\nModules, one which failed visual inspection and is therefore scrap for\nengineering purposes. I.e., a nice, flat, attractive paperweight. I’m\ntouched, particularly because it has my name etched on it along with\nthose of several of my current and former LBNL colleagues, and because\nI have just been told that all the the DOMs deployed in IceCube are\nthus enscribed.\u003c/p\u003e\n\u003cp\u003e\nThough it’s not quite a burial fit for a king (not to mention the fact\nthat I’m still alive and kicking), our names entombed inside the polar\nice cap will endure for many millennia, far beyond the current age of\nthe Pyramids of the pharaohs. When some future civilization visits the\nbarren ruins of earth and goes prospecting for technological artifacts\nin the polar ice, they will find the sigils which make up our names\nand wonder at their significance. Or, in a hundred thousand years,\nwhen the flowing river of ice finally reaches the ocean, they may rust\nfree of their mutual tethers and drift the ocean currents… five\nthousand messages in spherical glass bottles to be found by whatever\nforms of life might remain to roam the seas or shores of future Earth.\u003c/p\u003e\n\u003cp\u003e\nThanks Jerry and Joanna.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/in-a-dry-and-waterless-place/\"\u003eIn a Dry and Waterless Place\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/routine/\"\u003eRoutine\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003c/main\u003e",
  "Date": "2009-01-29T07:00:00Z",
  "Author": "John Jacobsen"
}