{
  "Source": "johnj.com",
  "Title": "Faults in Ice and Rock",
  "Link": "http://johnj.com/posts/faults-in-ice-and-rock/",
  "Content": "\u003cmain class=\"content\"\u003e\n\n\n\u003ch1\u003eFaults in Ice and Rock\u003c/h1\u003e\n\n\n\u003cp\u003e\n\n\u003ca class=\"tag\" href=\"/tags/southpole\"\u003e\u003cspan class=\"southpole-tag\"\u003esouthpole\u003c/span\u003e\u003c/a\u003e\n\n  ..... \u003cem\u003e\u003ctime class=\"postdate\" datetime=\"2011-01-03T09:35:00Z\"\u003e\n      January 3, 2011\n    \u003c/time\u003e\u003c/em\u003e\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/thats-the-way/\"\u003eThat\u0026#39;s the Way\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/bardo/\"\u003eBardo\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/5403518166_c4ce4036e4_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/5403518166_c4ce4036e4_o_huf6f368625856910c1b9f060d3aa6f459_377405_700x0_resize_q75_box.jpg\" style=\"width:500px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\u003c/p\u003e\n\u003cp\u003e\nMy stay here in Christchurch may be a short one. Arrived yesterday\nafternoon to the heat of high summer and found out directly that our\nclothing date would be this evening — and that we were scheduled to\nfly immediately after receiving our cold weather gear. That gives just\nover a day here, which is shorter than I might have liked, but which\nmight result in arriving at the Pole and getting settled in sooner,\nwhich would also be nice.\u003c/p\u003e\n\u003cp\u003e\nThe flight schedule has been screwy, apparently because of cracks in\nthe ice runway at Pegasus airfield. Some folks have been here in\nChristchurch for 10 days waiting for a flight (lengthy delays or even\ncancelled trips are an ever-present danger when traveling to\nAntarctica). Another advantage to reaching McMurdo tonight would be to\navoid such a fate. I once stayed here for a week while waiting for a\npart to arrive for a C-130; it was a nice vacation, but my stay at the\nPole will be short enough that to lose 10 days would be a bit of a\nsetback.\u003c/p\u003e\n\u003cp\u003e\nSpeaking of cracks, I felt a small earthquake yesterday just after\narriving (we also had one in Chicago last week, followed by a\nThunderstorm on New Year’s Eve!). Evidence of the big earthquake which\nhit in September is everywhere, mostly in the form of scaffolding,\nmissing buildings, and friendly signs saying DO NOT APPROACH OR ENTER\nTHIS BUILDING.\u003c/p\u003e\n\u003cp\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/5403518534_a57509f3b8_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/5403518534_a57509f3b8_o_hud1a3444e3b3d054b9afd142ef5a7c5c8_401163_700x0_resize_q75_box.jpg\" style=\"width:500px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\u003c/p\u003e\n\u003cp\u003e\nIt is nice to smell New Zealand again. Pictures and words can convey a\nbit of the feeling of being here, but I realized yesterday after\nleaving the International Terminal in Auckland how much of my\nexperience here is tied up in smells. Part of that may have been\nreinforced by the repeated shock of going from the Pole, where smells\nof burning fuel, body odors, stale beer, steel, and various synthetic\nthings dominate, to the opulent, moist smells of the late summer air\nin Christchurch. Even my hotel, the Devon, has its own distinctive and\ninstantly recognizable smells, whether from the flowers outside, the\ncleaning substances they use, or some combination of the two.\u003c/p\u003e\n\u003cp\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/5403520598_40b2f4de1a_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/5403520598_40b2f4de1a_o_hu214e9c46fd56eb78bc02490f03533673_400093_700x0_resize_q75_box.jpg\" style=\"width:500px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\u003c/p\u003e\n\u003cp\u003e\nI am a bit jet lagged, but slept well. Sleeping the whole night, with\nthe windows open and the breeze blowing in, with no screens and only\nthe occasional electric tram going by, was lovely. Tonight what little\nsleep I get may be on a C-17, bundled up in my red parka with a bunch\nof similarly-attired humans and God knows what sort of cargo. Or, the\nschedule may slip and I may sleep in a real bed again… we shall see.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/thats-the-way/\"\u003eThat\u0026#39;s the Way\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/bardo/\"\u003eBardo\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003c/main\u003e",
  "Date": "2011-01-03T09:35:00Z",
  "Author": "John Jacobsen"
}