{
  "Source": "johnj.com",
  "Title": "t=0",
  "Link": "http://johnj.com/posts/t-equals-zero/",
  "Content": "\u003cmain class=\"content\"\u003e\n\n\n\u003ch1\u003et=0\u003c/h1\u003e\n\n\n\u003cp\u003e\n\n\u003ca class=\"tag\" href=\"/tags/southpole\"\u003e\u003cspan class=\"southpole-tag\"\u003esouthpole\u003c/span\u003e\u003c/a\u003e\n\n  ..... \u003cem\u003e\u003ctime class=\"postdate\" datetime=\"2007-01-22T00:00:00Z\"\u003e\n      January 22, 2007\n    \u003c/time\u003e\u003c/em\u003e\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/giacometti/\"\u003eGiacometti\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/the-really-really-big-picture/\"\u003eThe Big (Really really big...) Picture\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003cp\u003e\nUnder way at last.\u003c/p\u003e\n\u003cp\u003e\nMy flight to LA leaves in 40 minutes - the first of five flights, a\nmigration of sorts. Flying south for the winter. Well, summer…\u003c/p\u003e\n\u003cp\u003e\nThis is trip number six; as such, what I write about won\u0026#39;t be a\ncomplete blow-by-blow as I have done in earlier years \u003cdel\u003e(see the links\nto previous years on the sidebar)\u003c/del\u003e, but you will get to see the trip\ndigested through the eyes of an \u0026#34;old hand.\u0026#34; To get in the mood, let\u0026#39;s\nstart with a few excerpts from my first trip, ten years ago…\u003c/p\u003e\n\u003cblockquote\u003e\n\u003chr/\u003e\n\u003cp\u003e\nDecember, 1996.\u003c/p\u003e\n\u003cp\u003e\nFLYING TO NEW ZEALAND\u003c/p\u003e\n\u003cp\u003e\n8:47 AM New Zealand time, Aukland airport.\u003c/p\u003e\n\u003cp\u003e\nNew Zealand is cool!!!!\u003c/p\u003e\n\u003cp\u003e\nEveryone drives on the wrong side of the road. It\u0026#39;s green and wet.\u003c/p\u003e\n\u003cp\u003e\nA cyclone is expected to hit tonight. I totally love this place\nalready.  Gotta go, we\u0026#39;re taking off.\u003c/p\u003e\n\u003cp\u003e\n[…]\u003c/p\u003e\n\u003cp\u003e\nI think I have found the one place in the world more beautiful than\nWisconsin. Way better than Hawaii, California, Switzerland… we\u0026#39;ll\nhave to see about France.\u003c/p\u003e\n\u003cp\u003e\nOn the coast near the Aukland airport, tiny green trees stick out of\nthe shallow water like little puffballs. Everything is green and lush,\na shock after Wisconsin. Apparently it frosts only a few times a year,\nand those are the bad winters. Lots of tiny roads and houses scattered\nabout on irregularly-shaped land. Impending cyclones with 150 km/hr\nwinds provide added excitement. I believe our aircraft took off just\nahead of the storm.\u003c/p\u003e\n\u003cp\u003e\nBefore takeoff, I thought we had a problem–smoke or steam was\ndrifting into the cabin above our heads through long slits. No one\nelse seemed to mind, so this is apparently normal. Maybe they want to\nkeep people from drying out. I sure could use a hot bath, come to\nthink of it.\u003c/p\u003e\n\u003cp\u003e\nHorse racing and cricket figure predominantly in sports news in the\nNew Zealand Herald.\u003c/p\u003e\n\u003cp\u003e\nOn the airplane telly last night (gotta start talking like the locals)\nthere was a blurb on some sport that looked like it might be rugby,\nbut I couldn\u0026#39;t tell. It was total mayhem–people running and kicking a\nfootball-like thing, catching it, tossing it around. Pure action but\nmuch more three-dimensional than soccer or football; it looked more\nlike the pure hand-to-hand combat that all sports must have arisen\nfrom. [It was Australian Rules Football.]\u003c/p\u003e\n\u003cp\u003e\nTime for the second airplane breakfast of the day. I\u0026#39;m having fun!\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003e\n4:45 PM, Jan 1, 1997, Hotel California, McMurdo Base, Antarctica\nTemperature, about 30 degrees F.\u003c/p\u003e\n\u003cp\u003e\n[…]\u003c/p\u003e\n\u003cp\u003e\nFLYING TO MCMURDO\u003c/p\u003e\n\u003cp\u003e\n\u0026#34;Few people have ever seen this,\u0026#34; said Neck [our pilot]. I felt amazed\nthat I had ever doubted that I would want to make this trip.\u003c/p\u003e\n\u003cp\u003e\nWhat began as a faint line of mountains gradually became a spectacular\nview. As we approached, I studied the approaching topography on the\nnavigation chart, noticing the special symbol for crashed aircraft,\nand finding where one lay on the map not all that far from where we\nwere flying. But the view soon overwhelmed my interest in the chart. I\ntook many pictures which I hope will mitigate my inability to describe\nthe mountains and long, winding glaciers. I [tried to see] the aerial\nview with both scientific and artistic eyes. Looking at rivers of ice\nand the clouds that flowed around them, I could see that ice and\nclouds/air have a lot in common in appearance and underlying\nform. Both flow through available channels, though on different\ntimescales, and reflect the light hitting them with so much purity\nthat one is not distracted by color, and can appreciate the near-still\ndance of pure form.\u003c/p\u003e\n\u003cp\u003e\nEspecially beautiful were the contrasts between the raw, jagged faces\nof exposed rock and the breathlessly smooth contours of white, flowing\nice, occasionally ripped in striations caused by sudden shifts of\ninclination in flow.\u003c/p\u003e\n\u003cp\u003e\n[…]\u003c/p\u003e\n\u003cp\u003e\nWe passed close by town before landing on the skiway on the ice sheet\nbeyond. From the air (and from the ground too), the town itself looks\nmore like a collection of industrial freight boxes on black dirt and\nrock than a real town. It is, however, an actual town, with a peak\nsummer population of 1200, a post office, a bank, a chapel, bars,\napartments and dorms, laboratories, \u0026#34;roads\u0026#34; (stretches of dirt that\npeople drive on, as opposed to stretches of dirt people don\u0026#39;t drive\non), a hospital, and a power plant. As far as I know, the only thing\nMcMurdo lacks is a cemetery. None of this is really apparent to the\nnew observer from the air, cockpit view notwithstanding.\u003c/p\u003e\n\u003cp\u003e\nWe passed the town and the rocky point it is on, and descended to the\nrunway just behind it. All this while the crew was going through their\nlanding checklist, acting very efficiently and professionally. I\nalways like to see people do something they\u0026#39;re good at. And it was of\ncourse a tremendous thrill to see the runway rise up to greet the\naircraft with a soft thud. Suddenly we were sliding down the ice,\nslowing down with reverse thrust, watching odd, orange tracked\nvehicles and equipment slide past. We went to the end of the skiway,\nturned 180 degrees, and parked. Not long after, I thanked the crew,\nand the other \u0026#34;beakers\u0026#34; [scientists] and I were led out on the ice\ntowards a van with big tires and high suspension (like most McMurdo\nvehicles). It was quite warm, warmer than the Wisconsin I had left\njust a few days ago. I looked around. There was a great expanse of\nice, and then mountains across the bay; nearby, the black hills hiding\nMcMurdo from us jutted into the white plain. A single seagull or skua\nstood not far away. I was very excited. I had landed on The Ice.\u003c/p\u003e\n\u003cp\u003e\n[…]\u003c/p\u003e\n\u003cp\u003e\nAT THE POLE\u003c/p\u003e\n\u003cp\u003e\nI dozed and listened to music for a few hours, unpacked a few things,\nand pondered my situation while taking several trips in the snow out\nto the toilet and shower shack. It was there I met the guy who told me\nabout the piss cans [makeshift chamber pots]. We also talked about\nother things about the Ice in general. I told him my impression of\nMcMurdo was better because there was scenery there. He replied,\n\u0026#34;There\u0026#39;s scenery here, too. All you have to do is close your eyes.\u0026#34;\nWords to live by.\u003c/p\u003e\n\u003cp\u003e\nThere really is no scenery here. It\u0026#39;s like being out in the middle of\na frozen lake, except there is no end to it! The dome, various\nbuildings, odd tracked vehicles known as \u0026#34;sprytes\u0026#34; as well as other\ntrucks and construction equipment, the runway, and the ceremonial and\ntrue geographic poles, are it. They are within about a mile of each\nother. This is a small speck on an immense plain of ice. To think that\nScott and his men made it here on foot boggles the mind. (Amundsen,\nwho beat Scott by a few weeks, used sled dogs both to move men and\ngear, and to feed the men as well towards the end of the\nexpedition. Amundsen made it back alive. Scott didn\u0026#39;t. The station is\nnamed after both of them.)\u003c/p\u003e\n\u003chr/\u003e\n\u003c/blockquote\u003e\n\u003cp\u003e\nFast-forward to 2007.\u003c/p\u003e\n\u003cp\u003e\nAirborne now en route to LAX, listening to \u0026#34;Dub Side of the Moon,\u0026#34; a\nthoroughly postmodern Reggae-Floyd mash-up (thanks, Todd) on the new\nred Nano courtesy of Santa Jobs and the Apple-cheeked elves of\nCupertino. Fell asleep already before takeoff, and realized as I awoke\nto the trill of the engines that I could happily stay asleep until\nmagically waking up in my small room in the A wing of the station, go\nfor a quick jog on the treadmill, take my 2 minute shower, and start\nworking. Sad, eh? I\u0026#39;m ready to be there before the trip has even\ngotten under way. I may think I know what to expect, but I know enough\nto know that there can be surprises\u003csup class=\"footnote-reference\"\u003e\u003ca id=\"footnote-reference-1\" href=\"#footnote-1\"\u003e1\u003c/a\u003e\u003c/sup\u003e good and bad when traveling to\nthe Ice. If nothing worse than previous years occurs, I\u0026#39;ll be\nperfectly content. Once I get to Christchurch I\u0026#39;ll be in good\nshape. The concatenated series of three flights (4+13+2 hrs) is the\nhardest part of the trip.\u003c/p\u003e\n\u003cp\u003e\nFor newcomers to the blog, the flight sequence is\nORD-\u0026gt;LAX-\u0026gt;CHC-\u0026gt;MCM-\u0026gt;NPX: Chicago to LA to Auckland, NZ to\nChristchurch, NZ; get extreme cold weather (ECW) gear, fly to McMurdo\nstation on the edge of Ross Island, then to South Pole. Acclimate to\nthe altitude, then accomplish miracles.\u003c/p\u003e\n\u003cp\u003e\nA suitcase, a small backpack and a manly-purse are my only luggage\nitems. Packing light is a challenge and a pleasure. Most of the way I\nwon\u0026#39;t have to schlepp the big bag, but a long schlepp it is indeed,\nand I know what not to take now. Colleague Bob Morse told me, \u0026#34;all you\nreally need is a toothbrush and some underwear.\u0026#34; He\u0026#39;s not far off. A\nlaptop and a towel are the other necessities, though some people\nmanage to do without the laptop (how?) and one colleague I know forgot\nhis towel and had to suffer through until a fellow South-bound\ntraveler could liberate one from a hotel in Christchurch for him. Some\nthings I do take I wouldn\u0026#39;t have thought of on the first trip: spray\nbottle for extra humidity, clothesline for same (most clothes hang dry\nin \u0026lt;8 hrs in the driest, highest desert in the world). An extra bag to\nstore summer clothes and other stuff I won\u0026#39;t need in Christchurch, and\nfor gifts on the way home. Similarly, I give back perhaps 1/3 of the\nECW gear in Christchurch, since I know I won\u0026#39;t wear it.\u003c/p\u003e\n\u003cp\u003e\nAs the engines gunned for takeoff from Chicago I thought of the\nsoftware tests on \u0026#34;new DAQ\u0026#34; we have been running for the past few\nweeks. Three or more of us in separate offices, separate cities,\ntethered together by online chat and daily conference calls, putting\nthe software out on the \u0026#34;runway\u0026#34; (a bunch of networked computers),\ngiving it lots of gas, and watching with bated breath to see if it\ntook off. Cheering when it did, sighing when it crashed and burned,\nsending us back to the proverbial (digital) drawing board. It\u0026#39;s not\nexactly the way you build jet engines – thankfully, I thought, as we\nsoared into the skies above O\u0026#39;Hare.\u003c/p\u003e\n\u003cp\u003e\nOr is it?\u003c/p\u003e\n\u003cp\u003e\nA few small personal and work goals for the trip:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHelp to achieve and maintain hitherto-unseen stability and elegance\nin the data acquisition (DAQ) software;\u003c/li\u003e\n\u003cli\u003eStick to a routine of sleep, meditative stretching, and running that\nkeeps me healthy and positive. Keep up my running conditioning for\nShamrock Shuffle and \u0026#39;07 Chicago Marathon;\u003c/li\u003e\n\u003cli\u003eMaintain good-natured and constructive dialogue with\ncolleagues. Steer as clear as possible of any of the ugly politics\nthat tend to crop up during summers at Pole;\u003c/li\u003e\n\u003cli\u003eFinish or at least take a good whack at Pynchon\u0026#39;s \u0026#34;Gravity\u0026#39;s\nRainbow,\u0026#34; a brown-paged paperback copy of which I \u0026#34;borrowed\u0026#34; from\nthe AMANDA lab in MAPO in the Dark Sector at Pole in 1998. I\u0026#39;ll be\nleaving the book (sans overdue book fines) behind in the library in\nthe new station. I like Pynchon but have had trouble finishing\nanything except \u0026#34;The Crying of Lot 49.\u0026#34; But I\u0026#39;ve beaten Stephenson\u0026#39;s\namazing Baroque Cycle (almost 3000 pages) twice now, so I may be\nready for the \u0026#34;\u0026#39;Rainbow,\u0026#34; and if I can finish that maybe I\u0026#39;ll try\n\u0026#34;V\u0026#34; again or his latest brain-bashing brick of a novel;\u003c/li\u003e\n\u003cli\u003eKeep moving my drawing forward in bits and pieces. It has been a\nreal source of pleasure of late to return to drawing. My focus has\nbeen on figurative drawing from life and from imagination, steered\nby a measure of storytelling or narrative intent. Originally I was\ngoing to make this a blog of drawings, and I may post some drawings\nif they \u0026#34;work,\u0026#34; but I\u0026#39;m going to leave it open-ended for the\nmoment. But I have four sketchbooks and plenty of implements to play\nwith;\u003c/li\u003e\n\u003cli\u003eGet completely caught up on episodes of Battlestar Galactica (my new\nfavorite guilty pleasure);\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOf course, the first goal (doing the actual work) will probably take\nup 99% of my time and energy.\u003c/p\u003e\n\u003cp\u003e\nOther differences between this trip and last year:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eI\u0026#39;m supposedly lodging in the A wing rather than the B wing of the\nstation - which may mean a larger, or at least a quieter, room.\u003c/li\u003e\n\u003cli\u003eThe new gym (and, in fact, the remaining half of the\nnewly-constructed station) is available.\u003c/li\u003e\n\u003cli\u003eI have no management responsibilities, since Kael (IceCube DAQ\nsoftware lead) is coming at the same time - whew!\u003c/li\u003e\n\u003cli\u003eThis trip is shorter by a week - also a good thing. Anything shorter\nthan three weeks is perhaps not worth the long slog to the\nIce. Anything longer starts to feel too long, though I\u0026#39;ve done six\nweeks and, of course, some people go for a year or more….\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAbout this blog: apologies in advance if things are not explained\nenough or background details (such as what we\u0026#39;re building) go\nmissing - if people have specific questions, they\u0026#39;re more than welcome\nto write – I\u0026#39;ll try to answer them here. Check out the old blogs too.\u003c/p\u003e\n\u003cp\u003e\nLater!\u003c/p\u003e\n\u003cdiv class=\"footnotes\"\u003e\n\u003chr class=\"footnotes-separatator\"/\u003e\n\u003cdiv class=\"footnote-definitions\"\u003e\n\u003cdiv class=\"footnote-definition\"\u003e\n\u003csup id=\"footnote-1\"\u003e\u003ca href=\"#footnote-reference-1\"\u003e1\u003c/a\u003e\u003c/sup\u003e\n\u003cdiv class=\"footnote-body\"\u003e\n\u003cp\u003eSurprises I or other colleagues have experienced en-route:\nwandering herds of penguins; tours of Scott\u0026#39;s Hutt; unexpected cabin\ndepressurizations; being invited to sit in the cockpit during\nlandings; flights \u0026#34;boomeranging\u0026#34; (having to turn back due to weather\nor mechanical issues); scenic flights over active volcanoes or through\ncanyons; and, of course, sitting around Christchurch or McMurdo for\nhours to dozens of days, waiting for the weather to clear or for a\nneeded replacement aircraft part to arrive from somewhere in the US\nmilitary\u0026#39;s global infrastructure.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/giacometti/\"\u003eGiacometti\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/the-really-really-big-picture/\"\u003eThe Big (Really really big...) Picture\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003c/main\u003e",
  "Date": "2007-01-22T00:00:00Z",
  "Author": "John Jacobsen"
}