{
  "Source": "johnj.com",
  "Title": "Routine",
  "Link": "http://johnj.com/posts/routine/",
  "Content": "\u003cmain class=\"content\"\u003e\n\n\n\u003ch1\u003eRoutine\u003c/h1\u003e\n\n\n\u003cp\u003e\n\n\u003ca class=\"tag\" href=\"/tags/southpole\"\u003e\u003cspan class=\"southpole-tag\"\u003esouthpole\u003c/span\u003e\u003c/a\u003e\n\n  ..... \u003cem\u003e\u003ctime class=\"postdate\" datetime=\"2009-01-29T00:00:00Z\"\u003e\n      January 29, 2009\n    \u003c/time\u003e\u003c/em\u003e\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/immortality/\"\u003eImmortality\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/tourists/\"\u003eTourists\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_2270.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_2270_hu4e5faf52a2df2a97a7b4d2b5be0ec2f8_42974_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\u003c/p\u003e\n\u003cp\u003e\nIt’s 10:05 AM and getting close to bed time. The weather today is\nstrange – quite warm (almost minus 10F) but with 21 knot winds, making\nthe wind chill about 50 below. The snow is blowing high and visibility\nis poor at times. But it’s quite beautiful.\u003c/p\u003e\n\u003cp\u003e\nLife is settling down into a routine, of sorts. Wake up as late as\npossible, usually before dinner. Clean up room, go to gym, meditate,\nhave breakfast. Start work when satellite rises around 11:30 PM. Work\nuntil mid-morning, and then wind down until I have to do it again.\u003c/p\u003e\n\u003cp\u003e\nMost of the other late-season \u0026#39;Cubers are on night shift. Our \u0026#39;days’\nconsist of testing new pieces of the detector and new bits of code,\ntroubleshooting, adding features, all somewhat endlessly. We have\nregular consultations with colleagues up North via phone meetings and\ninstant messaging; and a daily 8 AM face-to-face meeting here just to\ncheck in and make sure everyone has what they need to get things\ndone. There are a lot of things happening at once and it turns out I\nhave to orchestrate and schedule quite a bit. But, so far it’s going\nok. We have tested an additional 9 strings combined with the 40 we ran\nthroughout 2008. If we can get the remaining 10 more strings added in\nand calibrated, that will be a good start to the winter season. In\naddition, the experiment control software I wrote throughout 2008 is\nstarting to come together and be fully operational here.\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_2215.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_2215_hu10deaf049e77fbbe818313d9c6127b6f_89133_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nIceCube Laboratory\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nOne strange feature about being here is that current and past summer\nseasons blend together into a sort of day-lit constancy, where the\nreal world up North seems not exactly unreal, but somehow parallel and\nseparate in both space and time. The sameness of the surroundings, the\nwork, and, to some extent, the people (many of the denizens here are\n\u0026#39;repeat offenders’ like me) all contribute to this. Lots of people\nhave a summer home… mine seems to be a January slot in a late-season\npopulation of 250 or so people dreaming of Christchurch and points\nbeyond. Part of the strange timelessness of this place is also the\nabsence of people who have been here before, never to return, and\nwhose spirits somehow knock about the place still.  What part of me\nwill be left behind when I get on that northbound plane for the last\ntime?\u003c/p\u003e\n\u003cp\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_2161.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_2161_huee8588126438b56127b25c0ced46ccbc_14643_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\u003c/p\u003e\n\u003cp\u003e\nLast night I dreamt a great rainstorm fell here. It was delightful at\nfirst, but quickly turned terrifying because everything started to\nmelt and submerge. I knew that when the cold came back everything\nwould be frozen in place. I have no idea what that means, but images\nof liquid water are powerful in a place where showers are tightly\nrationed and the daily per-person water consumption is flashed up on\nthe video scroll in the galley.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/immortality/\"\u003eImmortality\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/tourists/\"\u003eTourists\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003c/main\u003e",
  "Date": "2009-01-29T00:00:00Z",
  "Author": "John Jacobsen"
}