{
  "Source": "johnj.com",
  "Title": "Bardo",
  "Link": "http://johnj.com/posts/bardo/",
  "Content": "\u003cmain class=\"content\"\u003e\n\n\n\u003ch1\u003eBardo\u003c/h1\u003e\n\n\n\u003cp\u003e\n\n\u003ca class=\"tag\" href=\"/tags/southpole\"\u003e\u003cspan class=\"southpole-tag\"\u003esouthpole\u003c/span\u003e\u003c/a\u003e\n\n  ..... \u003cem\u003e\u003ctime class=\"postdate\" datetime=\"2011-01-03T02:39:00Z\"\u003e\n      January 3, 2011\n    \u003c/time\u003e\u003c/em\u003e\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/faults-in-ice-and-rock/\"\u003eFaults in Ice and Rock\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/chasing-the-sun/\"\u003eChasing the Sun\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/5402916721_83a6e80031_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/5402916721_83a6e80031_o_hu4b204cedf554837b3cf8cdbb2f9884f6_581941_700x0_resize_q75_box.jpg\" style=\"width:500px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\u003c/p\u003e\n\u003cp\u003e\nI didn’t get a post in yesterday, because it was only January 2 for a\nfew hours, just before I crossed over the International Date Line. Not\nto mention the fact that there was no WiFi on the flight (though\napparently some planes have that now).\u003c/p\u003e\n\u003cp\u003e\nMy second flight didn’t take off until nearly midnight, local time. I\ndread the flight to Auckland more than any other stage of the trip; it\nfeels like the bardo state from Tibetan Buddhism, in which one has\ndied and is waiting to incarnate into one’s next form — a state of\nunsettled in-between-ness, which somehow passes both quicker than\nexpected and with excruciating slowness (a little like some meditation\nsessions, come to think of it). I did manage to sleep a bit (breathe\ndeeply, follow the out-breath, notice thoughts and sounds,\n…. zzzzz), waking at least half a dozen times, and then watched “The\nSocial Network,” which I enjoyed but which I dearly hope will resemble\nthe coming trip not in the slightest.\u003c/p\u003e\n\u003cp\u003e\nOne sees “Ice people” in increasing amounts as one gets closer to The\nIce (slang for Antarctica). I met an IceCube colleague from Madison in\nChicago; noticed a few others at LAX and several more in Auckland. You\ncan tell them by their clothes (take all the geeks or professors you\nknow, and all the rock climbers you know, and imagine how the\nintersection of those two sets would dress) and by the little yellow\npenguin tags hanging off of their luggage or the red, white and blue\nUS Antarctic program patches on their jackets. Often we don’t talk to\none another, but there are all sorts of interesting people with\ninteresting stories. For example, on the flight to Auckland I managed\nto sit next to the Program Psychologist on his way to evaluate the\npsyches of people staying over the winter at South Pole and at\nMcMurdo, but didn’t know that (or anything about him) for the 13 hours\nwe sat together until we landed in Auckland and finally indulged in\nsome small talk.\u003c/p\u003e\n\u003cp\u003e\nIn short, the trip so far has been relatively painless — by far the\nworst of it was the Mexican food (and service) I got at LAX, not\nrealizing that they would have dinner on the plane despite the late\ndeparture. Now I’m waiting for my flight to Christchurch and, soon,\nsoon! a shower and a real bed.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/faults-in-ice-and-rock/\"\u003eFaults in Ice and Rock\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/chasing-the-sun/\"\u003eChasing the Sun\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003c/main\u003e",
  "Date": "2011-01-03T02:39:00Z",
  "Author": "John Jacobsen"
}