{
  "Source": "johnj.com",
  "Title": "Metric",
  "Link": "http://johnj.com/posts/metric/",
  "Content": "\u003cmain class=\"content\"\u003e\n\n\n\u003ch1\u003eMetric\u003c/h1\u003e\n\n\n\u003cp\u003e\n\n\u003ca class=\"tag\" href=\"/tags/art\"\u003e\u003cspan class=\"art-tag\"\u003eart\u003c/span\u003e\u003c/a\u003e\n\n  ..... \u003cem\u003e\u003ctime class=\"postdate\" datetime=\"2009-03-02T00:00:00Z\"\u003e\n      March 2, 2009\n    \u003c/time\u003e\u003c/em\u003e\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/posing-rigs/\"\u003ePosing Rigs\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/cuba/\"\u003eCuba\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003cp\u003e\nBeing a geek, I’ve always liked the word \u0026#39;metric.’ A metric is a\nnumber or other quantitative object (physicists like \u0026#39;metric tensors’)\nwhich measures something.\u003c/p\u003e\n\u003cp\u003e\nI have three paintings drying right now (i.e., too wet to work into\nwithout screwing up areas). A thought occurred to me as I was\nthinking about what to work on next, that the number of drying\npaintings could be a metric of how artistically busy you happen to be\nat the moment. Call that number of drying paintings the \u0026#39;D-number.’\nIf I start working on another, it would make a \u0026#39;D-number’ of four. A\nmoderately busy period, by my standards.\u003c/p\u003e\n\u003cp\u003e\nI wonder what my highest D-number has been. Seven? Surely not ten.\u003c/p\u003e\n\u003cp\u003e\nI like working on lots of pieces at once. When you get bored or\nstuck, just pick up another. It’s especially nice if your paintings take a long\ntime to finish, because you might be in the wrong mood for one particular painting, \nbut in the right mood for another. If you glaze a lot, you have to wait for\nlayers to dry (I don’t use resins because of the fumes), which artificially \ninflates your D-number.\u003c/p\u003e\n\u003cp\u003e\nOther painters just pick up a panel and don’t touch anything else\nuntil it’s done. Their D-numbers are always equal to one (that is, if\nthey paint in oils — acrylic painting makes your D-number usually zero,\ndue to the quick drying times).\u003c/p\u003e\n\u003cp\u003e\nThen there is the U-number — the number of paintings which are\nunfinished, kicking around the studio, that you hope to get around to\nsometime. Mine’s probably about 15 or 20. A recent goal of mine is\nto make U=0, though probably that’s a fool’s hope.\u003c/p\u003e\n\u003cp\u003e\nFinally, there is the I-number, which counts the paintings you plan to\ndo next, or sometime soon, or in a future lifetime. As Van Gogh quoted to\nEmile Bernard, “the most beautiful pictures are those one dreams about\nwhen smoking pipes in bed, but which one will never paint.”\nI like to keep my I-number as high as possible — it means I’m feeling\nespecially inspired.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/posing-rigs/\"\u003ePosing Rigs\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/cuba/\"\u003eCuba\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003c/main\u003e",
  "Date": "2009-03-02T00:00:00Z",
  "Author": "John Jacobsen"
}