{
  "Source": "johnj.com",
  "Title": "End of the Second Act",
  "Link": "http://johnj.com/posts/end-of-the-second-act/",
  "Content": "\u003cmain class=\"content\"\u003e\n\n\n\u003ch1\u003eEnd of the Second Act\u003c/h1\u003e\n\n\n\u003cp\u003e\n\n\u003ca class=\"tag\" href=\"/tags/southpole\"\u003e\u003cspan class=\"southpole-tag\"\u003esouthpole\u003c/span\u003e\u003c/a\u003e\n\n  ..... \u003cem\u003e\u003ctime class=\"postdate\" datetime=\"2009-02-06T00:00:00Z\"\u003e\n      February 6, 2009\n    \u003c/time\u003e\u003c/em\u003e\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/broken-glasses/\"\u003eBroken Glasses\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/pigs-and-fish/\"\u003ePigs and Fish\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_2388.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_2388_hu6b25d96b29e5b85f10bf469de41463bf_41181_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nStation as seen through the window of IceCube\u0026#39;s Ford \u0026#34;Gran Neutrino\u0026#34; truck\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nAlmost exactly one week to go, for me. It is sort of the end of the\nsecond act, when you think you know what is going to happen, but\nsurprises can still occur, and the final conflict has yet to sort\nitself out.\u003c/p\u003e\n\u003cp\u003e\nThings are going smoothly enough that we (the night crew) were able to\nwatch “The Big Lebowski” in the B1 lounge after midnight. Those who\ngot up early were able to see the Super Bowl (at breakfast, I caught\nthe amazing play just before half-time, which was enough football for\nme, and got to watch all the Springsteen-style Americana with my\nGerman, Dutch and New Zealand colleagues). I cannot actually remember\nthe last time I saw a Super Bowl in the US… but they are entertaining\nto see here, because of all the Armed Forces Network commercials in\nbetween plays, tempting people to reinlist. Hmmm…. Army, Navy or\nMarines? So many choices….\u003c/p\u003e\n\u003cp\u003e\nActually, it really is like being on a very roomy and safe aircraft\ncarrier in some ways. I haven’t been outside except to poke my head\nout on the upper deck for a couple of days. When planes land here,\ncomms broadcasts the announcement that “the aircraft is on-deck.” And\nthen there are the two-minute \u0026#39;Navy’ showers, which I am actually\nfeeling used to. Though I could get used to a hot bath pretty\nquickly. Fortunately nobody is shooting at us, the pay is better (for\nsome of us, anyways), we don’t have to salute, and, for us summer\nfolks, the tour of duty is mercifully short.\u003c/p\u003e\n\u003cp\u003e\nThough at times uncomfortable and stressful, this trip has been quite\nvivid in a way, with almost a sort of real-time nostalgic feel to\nit. I feel peaceful about the likelihood that it’s the last time I’ll\nbe here, and I find myself noticing the texture of the station floor,\nthe views out the windows, the galley food, the unwashed heads of\nhair, the grumbling in my stomach and the smiles in the hallways of\npeople I’ve seen year after year, whose names I have never learned.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/broken-glasses/\"\u003eBroken Glasses\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/pigs-and-fish/\"\u003ePigs and Fish\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003c/main\u003e",
  "Date": "2009-02-06T00:00:00Z",
  "Author": "John Jacobsen"
}