{
  "Source": "johnj.com",
  "Title": "Wind Storm and Moon Dust",
  "Link": "http://johnj.com/posts/wind-storm-and-moon-dust/",
  "Content": "\u003cmain class=\"content\"\u003e\n\n\n\u003ch1\u003eWind Storm and Moon Dust\u003c/h1\u003e\n\n\n\u003cp\u003e\n\n\u003ca class=\"tag\" href=\"/tags/southpole\"\u003e\u003cspan class=\"southpole-tag\"\u003esouthpole\u003c/span\u003e\u003c/a\u003e\n\n  ..... \u003cem\u003e\u003ctime class=\"postdate\" datetime=\"2011-11-25T00:00:00Z\"\u003e\n      November 25, 2011\n    \u003c/time\u003e\u003c/em\u003e\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/turkey-stuffing-eclipse/\"\u003eTurkey, Stuffing, Eclipse\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/shower-instructions/\"\u003eShower Instructions\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003cp\u003e\nNov. 25, 2011 15:32 NZDT B2 Science, Amundsen-Scott South Pole Station\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/6396999069_412f0e7463_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/6396999069_412f0e7463_o_hu752226d2e0a545cbdfc755aac567713a_534760_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nThe \u0026#34;South Pile\u0026#34; in windstorm\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nFor those of you who don’t know, December and January are the\ncentennial anniversaries of Amundsen and Scott’s arrival at the South\nPole, respectively. I think a lot of people are writing online about\nthe event, and at any rate, I’m going to miss the celebration here, so\nI won’t go too much into the preparation and planning that’s being\ndone to prepare for a record number of \u0026#39;tourists’; but it is\ninteresting to contemplate the history a bit and to think about how\ncomfortable it is here compared to what Amundsen and Scott went\nthrough.\u003c/p\u003e\n\u003cp\u003e\nToday we received an email \u0026#39;status report’ of where Amundsen and Scott\nwere about this time one hundred years ago. Amundsen recorded that the\ndogs were doing well and that he had pitched his tent in the most\nbeautiful campsite in the world. Scott wrote, “quite the most trying\nmarch we’ve had…. If it were not for the surface and bad light, things\nwould not be so bad. There are few sastrugi and little deep snow. For\nthe most part men and ponies sink to a hard crust some 3 or 4 inches\nbeneath the soft upper snow…. Our forage supply necessitates that we\nshould plug on the 13 (geographical) miles daily under all conditions,\nso that we can only hope for better things. It is several days since\nwe had a glimpse of land, which makes conditions especially gloomy. A\ntired animal makes a tired man, I find, and none of us are very bright\nnow after the day’s march, though we have had ample sleep of late.”\u003c/p\u003e\n\u003cp\u003e\nOther interesting tidbits on Thanksgiving Day (in the States, anyways\n— it’s Friday here): there is a partial solar eclipse this evening at\nabout 6:30. Unfortunately it is cloudy and windy here and you cannot\neven see the horizon. Yesterday is was even windier. We have not had\nflights for three days or so because of the weather here and in\nMcMurdo.\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/6397008155_f99c2a8a07_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/6397008155_f99c2a8a07_o_hud57d69da81cf55874358c2bf9cf82457_789823_700x0_resize_q75_box.jpg\" style=\"width:500px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nHalo in windstorm\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nLast night I went to the greenhouse to read a bit before bed. I’ve\nlearned that it’s OK to be in there when the greenhouse guy is\nworking, so I didn’t clear out when he came in. He introduced himself\nas Jon and we talked for quite awhile. We both agreed that one of the\nbest things about coming to Antarctica is meeting all sorts of really\ninteresting people and learning about what they do, but Jon himself\npersonifies that very phenomenon. He explained in fascinating detail\nabout the greenhouse, its control systems and its yearly cycle of\noperation. In the winter, it produces enough veggies for one salad per\nperson each week (!). But what I found most interesting is that he\nalso studies greenhouse designs for possible lunar and Martian\nhabitats. Did you know that there are recent indications that the dirt\non Mars is extremely toxic, which could severely impact the\npossibility for creating long-term habitations there? That the\nInternational Space Station has (or has had) a small greenhouse that\nrevolves around an axis to create simulated gravity for plants? Or\nthat the lunar south pole contains lots of water ice and is possibly\nthe coldest place in the solar system? He has also touched (studied)\nmoon dust — I dare say a lot more people have been to the South Pole\nthan have touched objects from the moon.\u003c/p\u003e\n\u003cp\u003e\nToday I’m feeling a bit under the weather, perhaps due to something in\nthe food not agreeing with me. But I have less than four days to go,\nthe winter-overs are doing well, and I’m eager to start heading back\nnorthwards. The weather will have to clear up first, however!\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/6397005637_97b2fdd110_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/6397005637_97b2fdd110_o_huce8bcee0dcc481ed951525f963f75265_1081156_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nCeremonial Pole from B2\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/6397004085_29c7e595ea_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/6397004085_29c7e595ea_o_hu63c97f6512d56ed4252db93cb485f733_691472_700x0_resize_q75_box.jpg\" style=\"width:400px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nSven and David\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/turkey-stuffing-eclipse/\"\u003eTurkey, Stuffing, Eclipse\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/shower-instructions/\"\u003eShower Instructions\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003c/main\u003e",
  "Date": "2011-11-25T00:00:00Z",
  "Author": "John Jacobsen"
}