{
  "Source": "johnj.com",
  "Title": "Reveille",
  "Link": "http://johnj.com/posts/reveille/",
  "Content": "\u003cmain class=\"content\"\u003e\n\n\n\u003ch1\u003eReveille\u003c/h1\u003e\n\n\n\u003cp\u003e\n\n\u003ca class=\"tag\" href=\"/tags/southpole\"\u003e\u003cspan class=\"southpole-tag\"\u003esouthpole\u003c/span\u003e\u003c/a\u003e\n\n  ..... \u003cem\u003e\u003ctime class=\"postdate\" datetime=\"2011-11-14T00:00:00Z\"\u003e\n      November 14, 2011\n    \u003c/time\u003e\u003c/em\u003e\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/traveller-and-the-human-chain/\"\u003eTraveller and the Human Chain\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/drifts/\"\u003eDrifts\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003cp\u003e\nNov. 15, 2011 05:36 NZDT Berthing A4-209, Amundsen-Scott South Pole Station\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/6338734777_956cbb8234_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/6338734777_956cbb8234_o_hud98c73f6d8992e18ffe337abe491fd48_510165_700x0_resize_q75_box.jpg\" style=\"width:500px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nFire sled next to refueling pit\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nWell, that’ll wake you up nice and quick. We just had a fire alarm\nwhich went on for long enough to get everyone out of bed and the fire\nteam half-dressed for action. False alarm, apparently.\u003c/p\u003e\n\u003cp\u003e\nI’ve ad a checkered history with fire alarms here. A few years ago\nwhen they were testing out the system, I was on night shift. Of\ncourse, testing only occurred during the day. So for about four days I\ncould be practically guaranteed to be pulled out of bed (or at least\nwoken up by the shrieking of the alarm in my room) a couple of times a\nnight. Sleep is a precious commodity at South Pole (altitude and noise\nconspire to make it challenging for me), and I was not a happy camper.\u003c/p\u003e\n\u003cp\u003e\nBut testing or no, frequent fire alarms are a fact of life\nhere. Though it may seem counter-intuitive with the cold, the\npractically zero percent humidity and frequent high winds make fire an\never-present hazard. Couple that with the remoteness of the Station\nand, well, you take it seriously. If a fire starts, help will not\narrive from McMurdo on time, except to collect the injured.\u003c/p\u003e\n\u003cp\u003e\nAnd even that assistance can only come in summer. As I understand it,\nevery winter-over is either on the fire team or the trauma team. There\nis no “Let’s sit around and let’s see how it plays out” team.\u003c/p\u003e\n\u003cp\u003e\nWe had a real incident here a few days ago with a glycol spill in the\npower plant. Fortunately everyone was OK but we had to reduce power\nconsumption for several hours afterwards while they cleaned up and\nbrought everything back online. A similar episode happened a few years\nago which resulted in injuries and medical evacuations.\u003c/p\u003e\n\u003cp\u003e\nSo I’m OK with false alarms.\u003c/p\u003e\n\u003cp\u003e\nNow to try to get back to sleep. Morning, all! :-)\u003c/p\u003e\n\u003cp\u003e\n(Postscript: beat the odds and managed to sleep a few more\nhours. Sometimes you’re so tired that you can just sleep no matter\nwhat.)\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/traveller-and-the-human-chain/\"\u003eTraveller and the Human Chain\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/drifts/\"\u003eDrifts\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003c/main\u003e",
  "Date": "2011-11-14T00:00:00Z",
  "Author": "John Jacobsen"
}