{
  "Source": "johnj.com",
  "Title": "Daily Memory Drawings",
  "Link": "http://johnj.com/posts/daily-memory-drawing/",
  "Content": "\u003cmain class=\"content\"\u003e\n\n\n\u003ch1\u003eDaily Memory Drawings\u003c/h1\u003e\n\n\n\u003cp\u003e\n\n\u003ca class=\"tag\" href=\"/tags/art\"\u003e\u003cspan class=\"art-tag\"\u003eart\u003c/span\u003e\u003c/a\u003e\n\n  ..... \u003cem\u003e\u003ctime class=\"postdate\" datetime=\"2017-01-03T00:00:00Z\"\u003e\n      January 3, 2017\n    \u003c/time\u003e\u003c/em\u003e\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/repainting/\"\u003eRepainting\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/questions-to-ask/\"\u003eQuestions to Ask\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/dc-12-20-2016-wide.png\"\u003e\u003cimg class=\"resize\" src=\"/dc-12-20-2016-wide_huc7b7e87c6c5f0bed97e9eaf096fe1326_5004701_700x0_resize_box_3.png\" style=\"width:600px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nRiverside Plaza Memory Sketch\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nEvery day for the past three months I have drawn some\nscene or event that I saw that day, purely from memory.\u003c/p\u003e\n\u003cp\u003e\nUsually this is something I saw on the way to work, or, if I\u0026#39;m home\nthat day, something I saw when out for a run or a walk somewhere in\nthe neighborhood.\u003c/p\u003e\n\u003cp\u003e\nSince I usually make the drawing at the end of the day, several hours\nwill have passed by the time I get around to recording what I saw. To\nkeep this purely about memory (with bits of invention as needed), I\ndon\u0026#39;t allow myself any notes or photo references.  As a result, while\ngoing about my day, I need to work extra hard to have a chance to\nremember the things I see. Sometimes I\u0026#39;ll stop on the street and spend\nextra time looking at something, perhaps making little drawing\ngestures in the air to build a little muscle memory about the shapes, and\nno doubt drawing a stare or two from passersby. Other times if I\u0026#39;ve\nseen something transitory while walking I\u0026#39;ll look down at the sidewalk\nand go over the scene in my mind with minimal distraction from new\nvisual inputs.\u003c/p\u003e\n\u003cp\u003e\nThroughout the day, if I think of it, I\u0026#39;ll try to recall one or two\nthings I\u0026#39;ve seen to increase the chance of recall later.\u003c/p\u003e\n\u003cp\u003e\nWhen I sit down to draw, I first make a list of all the things I can\nremember seeing, sometimes accompanied by small thumbnail\nsketches.\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_20161224_0012_copy.png\"\u003e\u003cimg class=\"resize\" src=\"/IMG_20161224_0012_copy_hu79567f7d6e1ac201b0a29cd15676cd39_2318719_700x0_resize_box_3.png\" style=\"width:600px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nDetails remembered from Walk in Hyde Park\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nThen I choose one thing as the subject of a larger, 15- to 20-minute drawing, usually 6\u0026#34;x8\u0026#34;.\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/barber-9-26-2016sm.png\"\u003e\u003cimg class=\"resize\" src=\"/barber-9-26-2016sm_hue887fb740575a8b525e748ed9ddb17c3_514041_700x0_resize_box_3.png\" style=\"width:600px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nVan Buren Barber Shop\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_20161224_0013_copy.png\"\u003e\u003cimg class=\"resize\" src=\"/IMG_20161224_0013_copy_hu374714dba65df99e7594aebeb07016c5_2288191_700x0_resize_box_3.png\" style=\"width:600px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nA Capella Band at Metra Entrance\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nWhile the drawings are usually not particularly good (and definitely\nnot \u0026#34;finished\u0026#34; by my usual standards), doing this exercise religiously\nfor awhile has had a few noticeable effects:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eThe exercise forces me to get out of the house at least once per\nday, no matter my schedule or the weather.\u003c/li\u003e\n\u003cli\u003eThe drawings seem to be getting a little better, and a little more\ncomplex, on average.\u003c/li\u003e\n\u003cli\u003eI can remember more at the end of the day, often enough to fill two\npages of notes and drawings.\u003c/li\u003e\n\u003cli\u003eThings I see throughout the day are more vivid and can pack more\nemotional punch.  I feel a stronger connection to my surroundings,\nthe city of Chicago in particular.\u003c/li\u003e\n\u003cli\u003eImagining or inventing things, coming up with ideas for drawings or\ncompositions, seems easier.\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eI have been appreciating the last two items especially.\u003c/p\u003e\n\u003cp\u003e\nI don\u0026#39;t have a great memory, so this exercise sometimes feels\nimpossible, and involves a fair amount of staring off into space.\nLike writing down dreams, however, once I get going, I tend to\nremember more than I thought I would.\u003c/p\u003e\n\u003cp\u003e\nThis activity is, with a minor variation or two, the \u0026#34;Daily\nComposition\u0026#34; exercise proposed by Kimon Nicolaïdes in \u003cem\u003eThe Natural Way\nto Draw\u003c/em\u003e.  Without giving much explanation, he asserts,\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003eNo other exercise in the book is more important than this one. These\ncompositions do not have to be right. They can be \u003cem\u003eall wrong\u003c/em\u003e. The\nimportant thing is to do them — three hundred and sixty-five of them\nbetween today and this date next year. It will be helpful if you keep\nthis up for a year, and it will be twice as helpful if you keep it up\nfor two years. The really serious student will make a quick\ncomposition every day for the rest of his life despite everything else\nhe has to do.\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003e\nI first read about this exercise in the 1980s. How I wish I had\nfollowed that advice consistently since then! Nevertheless, when I go\nback and look at old sketchbooks and discover my occasional Daily\nCompositions, no matter how bad the drawings, I do feel the strings of\nmemory vibrating strongly.\u003c/p\u003e\n\u003cp\u003e\nI think this exercise is hard to do consistently because, at first,\nthere isn\u0026#39;t much to work with… nothing to \u003cem\u003ecopy from\u003c/em\u003e.  A newcomer\nto the exercise will struggle when all he or she has to work with is a\nfew wispy clouds of memory and spotty knowledge of lighting, anatomy,\nweather, architecture, costume, etc. But working on one\u0026#39;s weak spots\nis a great way to improve.  In particular, when I go back to a spot\nI\u0026#39;ve tried to draw, I notice many things I missed the first time. It\u0026#39;s\nfun to re-draw those things, armed with the extra knowledge.\u003c/p\u003e\n\u003cp\u003e\nIt\u0026#39;s also nice to have a fairly clear idea of \u003cem\u003ewhat to draw\u003c/em\u003e at least\nonce per day, without worrying about making it anything complicated or\nclever. (Generally one of the day\u0026#39;s memories stands out clearly as the\nbest subject for a drawing.)\u003c/p\u003e\n\u003cp\u003e\nAll art considerations aside, this exercises exposes the vast extent\nof my ignorance of the simplest things I encounter every day. The\nprocess of learning to notice my environment more feels like a healthy\n(albeit upstream) direction to take in a world where constant\ndistraction by one\u0026#39;s smartphone has become the norm.\u003c/p\u003e\n\u003cp\u003e\nSince starting this exercise I\u0026#39;ve looked around for other references\nto working from memory. It seems that the practice was more common in\nthe 19th Century.  Degas, in particular, and Whistler used memory\nextensively in their work. More on this, perhaps, in later posts. In\nany case, it seems to me that the practice is not given its due in\ncontemporary teaching and discourse (I don\u0026#39;t remember any discussion\nof it in art school).\u003c/p\u003e\n\u003cp\u003e\nWhat things that you see every day are worthy of your repeated\nattention and study… or even memorization?\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_20161224_0008_copy.png\"\u003e\u003cimg class=\"resize\" src=\"/IMG_20161224_0008_copy_huaa77ccea697f4a7b7f3d0084e8c21a1d_4975314_700x0_resize_box_3.png\" style=\"width:600px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nVan Buren Memory Sketch\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/repainting/\"\u003eRepainting\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/questions-to-ask/\"\u003eQuestions to Ask\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003c/main\u003e",
  "Date": "2017-01-03T00:00:00Z",
  "Author": "John Jacobsen"
}