{
  "Source": "johnj.com",
  "Title": "Mummification",
  "Link": "http://johnj.com/posts/mummification/",
  "Content": "\u003cmain class=\"content\"\u003e\n\n\n\u003ch1\u003eMummification\u003c/h1\u003e\n\n\n\u003cp\u003e\n\n\u003ca class=\"tag\" href=\"/tags/southpole\"\u003e\u003cspan class=\"southpole-tag\"\u003esouthpole\u003c/span\u003e\u003c/a\u003e\n\n  ..... \u003cem\u003e\u003ctime class=\"postdate\" datetime=\"2011-01-23T11:18:00Z\"\u003e\n      January 23, 2011\n    \u003c/time\u003e\u003c/em\u003e\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/takeoff/\"\u003eTakeoff\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/eleventh-hour/\"\u003eEleventh Hour\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/5378107113_62775b6b01_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/5378107113_62775b6b01_o_hu53138e44c09952838042f7af7459c93c_335781_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\u003c/p\u003e\n\u003cp\u003e\nA full day in Christchurch, a Pole month’s worth of showers, sushi,\nphotos of graffiti, walking around, going to the Christchurch art\ngallery, good conversations, and a nap have all helped get me back\ninto the Real World™. I would like to try and remember the trail of\nevents that led here from the last long blog post, because if I wait\nanother day they will be gone down whatever tunnel of emptiness my\nleaky memory feeds into. They are gone already, of course, but I\nperhaps I can share bits and pieces with you nonetheless.\u003c/p\u003e\n\u003cp\u003e\nMy last day at Pole was good. I disengaged with work long enough to\nwander the Station quite a bit, shooting videos of the place and the\npeople and savoring and digesting the smells and the sights and the\nlow, thrumming vibrations of the place. One nice thing about having\nthe camera which does stereo video is that it captures the sounds\nalmost adequately (I have long dreamed of bringing enough equipment to\nthe Ice to do really good audio recordings of very banal things like\nwind and machinery and radio traffic and the ebb and flow of\nconversations in the Galley — the Canon S-95 let me do that with the\nvideo well enough as an approximation without having to haul a lot of\ngear all over the place).\u003c/p\u003e\n\u003cp\u003e\nFriday morning I got up as usual, skipped my gym workout, meditated,\nhad breakfast in the Galley, did the 0800 and 0830h meetings, had a\ngood talk w/ our cadre of Polies about software development within\nIceCube, then did the final packing and cleaning up of my room. There\nwas a lot of discussion about whether we would actually go that day —\nthere had been a lot of delays due to weather, people were delayed\nSouthbound into McMurdo and the forecast for Pole hadn’t been great\nthe previous day, but it cleared up to be fairly nice (partly sunny\nand -18 F or so, which was the coldest it ever got for me this trip —\nquite a bit warmer than previous trips, though I came midsummer rather\nthan the usual end-of-season). Also the northbound Polies from a few\ndays previous were all stuck in McMurdo, including a bunch of “DV“s\n(distinguished visitors) who I’m sure had to get back home for Various\nImportant Things. It wasn’t at all clear whether we would get stuck in\nMcMurdo with them or whether the logjam would break with our arrival.\u003c/p\u003e\n\u003cp\u003e\nThe day you leave, the cadence and excitement builds, starting, if the\nweather and mechanical gods allow, with an all-call announcement\naround 9AM of your plane taking off from McMurdo (“Attention South\nPole… we have our first off-deck of the day, skier 93 arriving South\nPole at 12:10 PM… this is our inbound/outbound passenger\nflight…”). Comms tells everyone your flight “has reached Pole-3”\n(about 25 minutes away) and then “the flight is 10 minutes out… the\ncrossing beacon is on… please stay clear of the skiway…” and then\n“aircraft is on deck… crossing beacon is off” and finally, “passengers\nplease proceed to the flight deck.”\u003c/p\u003e\n\u003cp\u003e\nWe were four \u0026#39;Cubers and one radio guy, and a few people I didn’t\nknow. It was nice to have several of those who were staying come to\nsee us to the plane — a sort of karmic reward for having greeted\nseveral of them, I suppose. We all made our way out, took the\nobligatory group photos, and killed time while Cargo unloaded and\nloaded the plane and the fuels person sucked AN-8 fuel out of the Herc\nto add one more increment to the winter’s fuel supply. Some over-eager\npassengers headed to the plane a few seconds early and had to wait\nuntil the Air Guard gave the all-clear; I was the last person to the\nplane, waved a final goodbye to the remaining IceCubers out on the\nsnow, and then piled into the Herc after everyone else. As soon as\nthey closed up the hatches the flight crew blasted the heat and it\nwent from -18F to probably 60F in about 5 minutes, and people shed\nvarious hats and gloves (the parkas, though warm, are excellent to nap\nin, since you can pull your hood over your head to shut out light and\nsome sound and sort of self-mummify yourself to sleep). We all\njuddered in our seats as the plane literally skated down the skiway,\ngradually gaining speed… it takes a good bit of time for the C-130s to\nactually get airborne and I cheered the plane on, twisting around in\nmy seat to film my goodbye takeoff video from the window behind\nme. Then we were in the air and past the last skiway flags and over\nthe great white void that is the polar ice cap.\u003c/p\u003e\n\u003cp\u003e\nThe cabin pressurized almost immediately and I happily sucked down the\nextra oxygen. I spent the flight writing a bit and photographing the\n\u003ca href=\"http://www.flickr.com/photos/eigenhombre/sets/72157625758147573/\"\u003eTransantarctic Mountains\u003c/a\u003e. Though I thought I recognized some of the\nplaces, it is scenery one doesn’t tire of. Then I dozed a bit and\nbefore I knew it we were descending down to Pegasus field. When we got\nout it was nearly 60 degrees F warmer than when we left — above\nfreezing, not quite slushy but definitely a different character of\nsnow. We snapped a few pix and then got a brief van ride to a much\nlarger Delta transport vehicle, the least comfortable transportation I\nknow of (the passengers rattle around in a compartment completely\nseparate from the driver, so she tosses in a radio after loading them\nin so they can call her in case of emergency).\u003c/p\u003e\n\u003cp\u003e\nIt was ironic to have to take the hour-plus journey into McMurdo,\nknowing that the plan was to have us back out there for a night flight\nin just a few hours. I took it as a sign that they didn’t actually\nexpect the C-17 to arrive from Christchurch, and that we would be\nstuck in Mac Town for several days. But, whatever, I was at low\naltitude, with warm air, in a place with actual landforms. We jostled\nand jolted into town and immediately bag-dragged for\nChristchurch. Afterwards it was nearly dinner time so we headed\ntowards “building 155” which is the main hive of activity in town…\nSebastian and Andrew in T-shirts, all of us skipping down the wooden\nsteps and crossing actual an actual stream of water, then headed down\nthe road and kicking at rocks and watching dust blow hither and yon.\u003c/p\u003e\n\u003cp\u003e\nWhen Shackleton’s crew, having survived a desperate winter and the\ncrushing of their vessel in the sea ice, reached Elephant Island, the\nmen were delirious with joy to tread upon something other than\nice. “They were laughing uproariously, picking up stones and letting\nhandfuls of pebbles trickle through their fingers like misers gloating\nover hoarded gold,” he wrote. Though McMurdo is quite an ugly place by\nmost peoples’ standards, to see actual dirt, rocks, and running water\nin McMurdo is quite a pleasure after the Pole, a pleasure I wasn’t\nimmune to this trip despite my relatively short stay at the Pole.\u003c/p\u003e\n\u003cp\u003e\nAt dinner we ran into the other \u0026#39;Cubers who were stuck in town waiting\nto go North, and I saw several other people I recognized from other\nPole seasons. The consensus was that there was no way we were going to\nget out that day; the next day was Sunday (no flights) and the rumor\nwas that no flights had gone on Monday either for several weeks. So I\nbasically was preparing to have to completely rethink my New Zealand\nplans. Afterwards we headed to \u003ca href=\"http://en.wikipedia.org/wiki/Discovery_Hut\"\u003eDiscovery Hut\u003c/a\u003e and saw the lone Adelie\npenguin which has apparently been hanging around for several days or\nmore. Colleague Mike came out with us in just a thin shirt and in fact\nall of us were a bit underdressed; the wind started picking up quite\nquickly and we hurried back and then headed to the Coffee House (which\nis really more like a bar) and killed time waiting for news of the\nflight from Christchurch. Again the consensus was that there was no\nway, we were all going to be stuck there for days.\u003c/p\u003e\n\u003cp\u003e\nFinally, two bottles of wine later, around 11 PM someone came in and\ngave us the news: the C-17 had taken off from Christchurch and was en\nroute; we were to report at 1 AM for transport to the airfield. At\nthis point I began to simultaneously get optimistic that we would go,\nand very tired (I typically went to bed around 10 PM at Pole). From\nthen on things gradually became more and more dreamlike, as we headed\nback to Pegasus (this time in Ivan the Terra Bus, a step up from the\nDeltas but still a long ride in the middle of the “night”… though we\ndid see five emperor penguins!!!), rattled around the “terminal” (a\nsquare orange trailer on skis with chairs for maybe 80 people) while\nthe C-17 was unloaded, then, finally, about 45 minutes standing around\nthe snow watching while they filled the C-17 with our bags, a bunch of\nretrograde waste cargo, and, oddly, the propellor of an airplane. We\nleft the Ice around 4 AM as I sunk into a slightly delirious cycle of\nhalf-sleep, dreaming for a few minutes, blearily waking up and\nfidgeting and then sleeping a bit more. As in all long distance\nflights, it took forever and was over before I knew it.\u003c/p\u003e\n\u003cp\u003e\nWhen we arrived it was raining. People even complained.\u003c/p\u003e\n\u003cp\u003e\nI was happy to be back in New Zealand, to have a full week of rest and\ncreativity and the pleasures of summer, and to go home after\nthat. Immigration and customs took only a few minutes (“Did you leave\nfor the Ice from Christchurch? OK, thanks very much.”). I have no idea\nhow they de-palletized our bags and got them to the terminal so\nquickly. Before I knew it I was shedding 40 pounds of gear (it is\nalways SUCH a relief to give it back) and heading to my hotel. By 10\nAM I was at the Grange B\u0026amp;B waiting for my room to be readied (I had\nexpected to have to go nap by the river since check-in time is usually\nlate afternoon, so this was a big relief as well). While waiting I\ntalked to another guy from the C-17 — he had spent two months in the\nDry Valleys, a helicopter ride away from McMurdo, with NO SHOWERS,\nsleeping in constant daylight, drilling ice cores. He spoke of\n2000-year-old mummified seals and penguins (the air is so cold and dry\nthat normal decay is essentially stopped).\u003c/p\u003e\n\u003cp\u003e\nSince arriving I have basically sleeping, showering, eating and\nwalking around. And speaking of sleep, it is time to do that. I was\ngoing to add a bunch of photos and videos to make this a very\nmultimedia post but it is too late… perhaps tomorrow will be an\nall-media day. Good night to all.\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/5379302962_3ef79337ec_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/5379302962_3ef79337ec_o_hu0b6f0de22ec4982d67e6aa7b6551c635_1381460_700x0_resize_q75_box.jpg\" style=\"width:500px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nMcMurdo: Actual dirt (and water!)\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/5377163133_5a5df79e9c_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/5377163133_5a5df79e9c_o_hua6237c25f19876e364b482c315dc4c6e_1959163_700x0_resize_q75_box.jpg\" style=\"width:400px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nNew Zealand, Summer, the Real World\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/takeoff/\"\u003eTakeoff\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/eleventh-hour/\"\u003eEleventh Hour\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003c/main\u003e",
  "Date": "2011-01-23T11:18:00Z",
  "Author": "John Jacobsen"
}