{
  "Source": "johnj.com",
  "Title": "Revolution Number Nine",
  "Link": "http://johnj.com/posts/revolution-number-nine/",
  "Content": "\u003cmain class=\"content\"\u003e\n\n\n\u003ch1\u003eRevolution Number Nine\u003c/h1\u003e\n\n\n\u003cp\u003e\n\n\u003ca class=\"tag\" href=\"/tags/southpole\"\u003e\u003cspan class=\"southpole-tag\"\u003esouthpole\u003c/span\u003e\u003c/a\u003e\n\n  ..... \u003cem\u003e\u003ctime class=\"postdate\" datetime=\"2011-01-06T00:46:00Z\"\u003e\n      January 6, 2011\n    \u003c/time\u003e\u003c/em\u003e\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/settling-in-2011/\"\u003eSettling In\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/red-eye-to-mcmurdo/\"\u003eRed Eye to McMurdo\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/5403596908_021836421a_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/5403596908_021836421a_o_hua863683cd40918025747fc430cef26bb_289308_700x0_resize_q75_box.jpg\" style=\"width:500px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nThe Emperor and I\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nIf you are reading this post, then we have made it to the South Pole.\u003c/p\u003e\n\u003cp\u003e\nAt the moment we are airborne on Flight P-106. There are 17 of us\ntoday plus a palette or so of cargo, with plenty of room on the C-130\nto spread out. I, for one, am standing in the middle of the plane,\nwith the laptop perched atop some bags. A few others have found spots\non the floor or are checking out the flight deck one by one.\u003c/p\u003e\n\u003cp\u003e\nYesterday’s blog post was written in Crary Lab, still one of my\nfavorite places on the Ice. A building in multiple wings or “Stages”\nwhich reminds me of the architecture from “Space, 1999” (now you know\nhow old I am if you didn’t already), the lab is Ground Zero for much\nof the science carried out in Antarctica, with dozens of different\nrooms, each serving various support roles for biology, physics,\nastronomy, meteorology, geology, vulcanology and probably even\nsociology. Stuffed penguins, seal skulls, fish in formaldehyde jars,\ndried sea sponges, alternately shiny and encrusted instruments from\ndays of Antarctic yore, and similar artifacts are on display at\nvarious locations, as are posters from dozens of science projects and\neven a few lovely oil paintings of landscapes which can be reached by\nhelicopter from McMurdo.\u003c/p\u003e\n\u003cp\u003e\nThe top floor of Crary has enormous picture windows looking out over\nthe nearby mountains — Black Island, White Island, Mount\nDiscovery. This is a great place to sit and work if you get stuck in\nMcMurdo for a few days.\u003c/p\u003e\n\u003cp\u003e\nOne of my favorite labs in Crary is the aquarium, where there is a\n“touch tank” containing sea creatures such as anemones, small fish,\nsea stars, something which looks like an ocean cockroach larger than a\nsparrow, and extremely alien-looking orange sea spiders, things which\nare all legs, very creepy and fascinating.\u003c/p\u003e\n\u003cp\u003e\nAfter exploring Crary and touching the sea monsters, we headed off to\nthe cafeteria for a dinner of butter chicken, dal, and various vegan\nsalads — I am trying to eat healthy this trip, and I think so far it\nhas paid off in terms of overall energy and fitness despite the truly\nwhacked sleep schedule. Following dinner was Bag Drag, which is an\nextremely aptly-named procedure (it involves schlepping all your Bags\nand is a Drag) which is more or less the equivalent of what you do\nwhen you check in your bags at any commercial airline, except that\nthey weigh you with your Extremely Cold Weather (ECW) gear as well.\u003c/p\u003e\n\u003cp\u003e\nAfter Bag Drag, Sebastian and I hiked up Observation Hill to see what\ncould be seen. The town below was stretched out in all its glory like\nan Alaskan stevedore’s acid-trip version of a malignant model train\nlayout, a matrix of pale oranges, greens and dusty browns spattering\nthe basin between Arrival Heights and Ob hill, the distant sounds of\nconstruction equipment competing with the wind and our conversation as\nwe slowly climbed, shooting lots of pictures on the way. We talked\nabout the early Arctic and Antarctic explorers and the race to be “the\nfirst,” and how those missions (and, in smaller ways, the current\nexpeditions across the Ice, which strive to be the first person or\ngroup of category X or nation Y to traverse such-and-such piece of\nAntarctica) are similar to the field of High Energy Physics, where the\nfirst person (or, almost always, group) to discover a new particle or\nbreakthrough result, gets the “prize” — the prize being all the\ncredit, or in rare cases the actual Nobel Prize. The drive to be the\nfirst seems to be a key driving factor in both science and\nexploration, but seems to me actually somewhat antithetical to the\ntrue collaborative nature of each (collaborative in that the teams\ninvolve several or many people, but also in that multiple teams have\nto try in order to reach the extremely challenging goal, since some\nteams will fail). IceCube is a collaboration of a few hundred people,\nand, having experienced both collaboration and competition in spades,\nI have found, perhaps as a result of getting older, collaboration to\nbe a much more satisfying mode.\u003c/p\u003e\n\u003cp\u003e\nWe also considered the difficult question, what is the intrinsic value\nof large science projects in Antarctica (or elsewhere)? IceCube cost\nupwards of $270 million US to build (not including future operations),\nwhich could have been used for other science projects, or, say, for\nseveral schools on the South Side of Chicago — or for a small fraction\nof a new fighter jet. Comparing schools with neutrino detectors is\ndifficult, not just because they are so different from each other, but\nbecause the things they attempt to do are, as they say on the Master\nCard ads, truly priceless. What would you pay to give your child a\nsafe and good education and prepare them for a good life? What would\nyou pay to allow humanity to understand the intricate and gorgeous\nworkings of the universe? What would you pay for peace (for I do think\nthat cooperative, international ventures such as science in Antarctica\nare conducive to world peace)? What would you pay to own a piece of\nartwork you fall in love with… or to create it? For your own spiritual\nawakening or that of others? In today’s world, these things all take\nmoney, and it boggles my mind somewhat to contemplate such costs… but\nas I approach the work site for the project I have so long been a part\nof, supported by taxpayer money and the hard work of thousands of\npeople, it feels appropriate, somehow, to contemplate the matter, even\nif there are no easy answers.\u003c/p\u003e\n\u003cp\u003e\nReturned back to our dorm in Building 155 to sleep early prior to our\ntransport for our flight at 0645h. Around 0200 our roommate came in an\npromptly began snoring. I have never heard snoring so loud — it was\nlike listening to the vivisection of a dying bull. Real nice guy,\nthough (awake). Up and at \u0026#39;em at 0530 with breakfast and then packing\nup to catch the van for the hour-long ride to Williams Field.\u003c/p\u003e\n\u003cp\u003e\nI’m excited to see the Pole, to unpack and have a place to call home\nfor a few weeks, and to take a 20 second shower.\u003c/p\u003e\n\u003cp\u003e\nUpdate: just arrived safe and sound and it is good to be back! Will\npost more news and pictures when I can.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/settling-in-2011/\"\u003eSettling In\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/red-eye-to-mcmurdo/\"\u003eRed Eye to McMurdo\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003c/main\u003e",
  "Date": "2011-01-06T00:46:00Z",
  "Author": "John Jacobsen"
}