{
  "Source": "johnj.com",
  "Title": "Man on Wire",
  "Link": "http://johnj.com/posts/man-on-wire/",
  "Content": "\u003cmain class=\"content\"\u003e\n\n\n\u003ch1\u003eMan on Wire\u003c/h1\u003e\n\n\n\u003cp\u003e\n\n\u003ca class=\"tag\" href=\"/tags/misc\"\u003e\u003cspan class=\"misc-tag\"\u003emisc\u003c/span\u003e\u003c/a\u003e\n\n  ..... \u003cem\u003e\u003ctime class=\"postdate\" datetime=\"2009-10-09T00:00:00Z\"\u003e\n      October 9, 2009\n    \u003c/time\u003e\u003c/em\u003e\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/photoshop-on-a-dime/\"\u003ePhotoshop on a Dime\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/pole-videos/\"\u003eSouth Pole Videos\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/man-on-wire.jpg\"\u003e\u003cimg class=\"resize\" src=\"/man-on-wire_hued93c0502ecf75be3780d56c0d804b11_29850_700x0_resize_q75_box.jpg\" style=\"width:400px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nStill from James March\u0026#39;s \u0026#34;Man on Wire\u0026#34;\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nGrowing up in the Midwest speaking English like everyone else around\nme, I always thought my native tongue was somewhat ordinary, even\nugly. In high school and beyond, I loved studying French for the\nglimpses it afforded into other ways of thinking, ways which I may\nhave presumed were more culturally sophisticated. French was the\nlanguage of Baudelaire, of wine and cuisine, of Louis XIV and\nNapoléon; of Monet, Delacroix, Ingres.\u003c/p\u003e\n\u003cp\u003e\nI think it took me many years of reading English prose and making\nsmall forays into other languages (something I still enjoy) to truly\nappreciate how marvelous a language English really is. For one thing,\nat roughly 1 million words, it far outstrips most other languages in\nterms of vocabulary (though perhaps half of those are technical\nterms). The sheer lexicographic heft of English provides enormous\nexpressive power — when several similar words exist for the same\nthing, one can choose the one with exactly the right associations or\npoetic impact.\u003c/p\u003e\n\u003cp\u003e\nYet, as with any language, English has words whose equivalents in\nother languages are more beautiful. “Beautiful,” for example, is not a\nbeautiful word. It sounds a bit prim, or prissy. “Beau,” on the other\nhand, is such a simple word, barely an exhale, or a sigh. It is far\nsuperior to its English cousin, in my opinion.\u003c/p\u003e\n\u003cp\u003e\n“Beau” is a word you hear a lot towards the end of \u003ca href=\"http://en.wikipedia.org/wiki/Man_on_Wire\"\u003eMan on Wire\u003c/a\u003e, a\nfilm by James March which portrays the efforts of Frenchman \u003ca href=\"http://en.wikipedia.org/wiki/Philippe_Petit\"\u003ePhilippe\nPetit\u003c/a\u003e, in 1974, to cross between the Twin Towers of the World Trade\nCenter on a tightrope. While the film itself is very well made, what\nis particularly captivating is the story — how Petit and his friends\ncombined vision and inspiration, careful planning, stealth, stamina\nand, above all, courage, to stage an act which transformed not just\nthemselves, but also the public’s view of the Towers.\u003c/p\u003e\n\u003cp\u003e\nI was somewhat incredulous to hear, years after the fact (I was only\neight years old at the time of the stunt) that someone had tightroped\nbetween the two buildings. Now, of course, the imagery in the film is\namped and torqued in gut-wrenching ways by the ghastly absence of the\nTowers themselves and the collective memory of their destruction,\nburned on the retinas and the psyches on so many of us who remember\nseeing them fall on live television. Yet the tears shed by the\nparticipants in the film, interviewed decades after the fact, do not\nseem to be about the fallen towers themselves, but about the purity\nand intensity of the moments before, during, and after Petit’s walk,\nand the beauty created, however briefly, on that day — August 7, 1974.\u003c/p\u003e\n\u003cp\u003e\nSeeing the film (made just last year) transforms the memory of the\nTowers from one of trauma to something more like transcendence. One of\nthe film’s ironies is that it invites comparison between the\nclandestine, overseas preparations of the youthful Petit and his\nfriends to what one imagines the nineteen hijackers’ final months and\ndays were like (it would make an interesting film to try to capture\ntheir point of view honestly, but I doubt the world is ready for such\na film). The contrast, very vivid, and never stated in any form in the\nfilm itself, is an obvious one: the sheer horror of Sept. 11, versus\nthe joy and amazement generated by the simple feat of walking between\nthe two buildings, more than 400 meters above the streets below. Yet\nperhaps it shows the power of art that such comparisons fade when one\nis shown Petit’s feat on its own terms. In the space left behind by\nthe towers, one imagines the space between them — and the courage\nrequired to face imprisonment by a foreign police force or, equally\nlikely, death at the hands of high winds and gravity. To achieve the\nimpossible — not for the sake of destruction, but for beauty.\n\u003cem\u003eComme c’est beau.\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/photoshop-on-a-dime/\"\u003ePhotoshop on a Dime\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/pole-videos/\"\u003eSouth Pole Videos\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003c/main\u003e",
  "Date": "2009-10-09T00:00:00Z",
  "Author": "John Jacobsen"
}