{
  "Source": "johnj.com",
  "Title": "Fruition",
  "Link": "http://johnj.com/posts/fruition/",
  "Content": "\u003cmain class=\"content\"\u003e\n\n\n\u003ch1\u003eFruition\u003c/h1\u003e\n\n\n\u003cp\u003e\n\n\u003ca class=\"tag\" href=\"/tags/southpole\"\u003e\u003cspan class=\"southpole-tag\"\u003esouthpole\u003c/span\u003e\u003c/a\u003e\n\n  ..... \u003cem\u003e\u003ctime class=\"postdate\" datetime=\"2011-01-18T23:25:00Z\"\u003e\n      January 18, 2011\n    \u003c/time\u003e\u003c/em\u003e\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/baby-its-cold-outside/\"\u003eBaby, It\u0026#39;s Cold Outside\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/friendly-radiation/\"\u003eFriendly Radiation\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/5368589094_9b5a8035f2_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/5368589094_9b5a8035f2_o_hubea61026f891701895305dc1dda718bb_1066291_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\u003c/p\u003e\n\u003cp\u003e\nBack in the Galley again, the smell of dozens of lunch burgers\ngrilling and the very same licorice spice Stash tea I always drink\nhere setting the olfactory tones for this post.\u003c/p\u003e\n\u003cp\u003e\nAlmost exactly twenty years ago, when I was working at CERN in Geneva,\nSwitzerland, I was preparing to return to Madison to take some art\nclasses and I emailed some physics colleagues there to see if there\nwas any student work to be had. Colleagues Bob Morse and Francis\nHalzen replied that there was a new project under way, which was to\nbuild a neutrino detector in the Ice in Antarctica. Bob had done an\nexperiment at the Pole to detect cosmic rays, and Francis was a\nparticle theorist who specialized increasingly in astro-particle\nphysics, and neutrinos in particular. Computer simulations were needed\nto see how effective light sensors, placed deep in the ice, might be\nat detecting neutrinos.\u003c/p\u003e\n\u003cp\u003e\nWhat started as an art-school day-job turned into a doctorate in\nphysics as the Antarctic Muon and Neutrino Detector Array (AMANDA)\nbecame a reality and the computer simulations I and other students\nwrote became important tools for the understanding of the data from\nthe first instruments deployed by the growing collaboration in the\npolar ice cap. But in the very earliest years, it was understood even\nby using back-of-the-envelope calculations that a much larger detector\nwould be needed… a Cubic kilometer of Ice, in fact … an Ice\nCube. AMANDA paved the way by detecting high-energy neutrinos, by\nsetting limits on astrophysical sources, and, perhaps most crucially,\nby providing technological prototypes for the hot water drilling which\nwould be needed to deploy the sensors, and for the design of the\nsensors themselves which evolved from simple photomultiplier tubes at\nthe ends of long coaxial cables to sophisticated computers in their\nown right which would provide the maximum signal quality by digitizing\nthe light down in the ice and sending them to the surface with no loss\nof signal quality.\u003c/p\u003e\n\u003cp\u003e\nThe difficulties faced by AMANDA were daunting. The drilling in\nparticular was an immense engineering challenge, requiring a kind of\nspecialized expertise found in only a handful of individuals (if that\nmany) worldwide. One man in particular, the late Bruce Koci, brought a\nkind of preternatural understanding, intuition and tenacity to the\ntask which allowed the 2-km holes for the AMANDA instrument to be\ndrilled successfully, though not without delays, logistical and\nengineering nightmares, burst hoses, and endless worry\nCollaboration-wide. After the holes were drilled, deployments of the\n“strings” of sensors themselves were an ordeal in their own right,\nsometimes involving \u0026#39;stuck’ strings, free-falling cables, injuries\nand, in the best of times, 20-hour deployments out-of-doors in a\nsingle shift (one of my most vivid memories of these deployments was\nthe enormous amounts of food one could eat during the breaks, and the\nutter contentment of exhaustion when the task was done).\u003c/p\u003e\n\u003cp\u003e\nHandling the data in AMANDA times was a challenge in and of\nitself. The data volume and mathematical complexity of the analysis\nstrained the computing resources available at the time; crunching the\nnumbers to find the first neutrino candidates required time on Cray\nsupercomputers and a scrum of dedicated grad students and postdocs\nworking at the limits of their programming abilities.\u003c/p\u003e\n\u003cp\u003e\nSince it was understood that AMANDA would eventually give way to a\nlarger instrument, work began well before the final stages of AMANDA\nto design the IceCube detector and to procure funding. Several\ncompeting prototype designs for a next-generation sensor were created\nand tested in later AMANDA deployments, including a design created\nwhile I was at LBNL in Berkeley. The LBNL “Digital Optical Module”\n(DOM) took some of the signal processing computations down into the\nice itself in order to get the maximum signal quality. Though more\nsophisticated (and expensive) than the usual AMANDA modules, the\ninterface to the surface required only the usual copper coaxial\ncables, with far better quality of data. A test AMANDA “string” (#18)\ndeployed in 2000 worked well enough (barely!) to show that the DOM\ntechnology was workable and could be used to detect particles in the\nice. The early LBNL prototype would be extensively improved for\nIceCube.\u003c/p\u003e\n\u003cp\u003e\nIceCube itself received a first real jolt of funding in 2002 and work\nbegan to quickly implement the vision of a kilometer-cubed detector. I\nwas put to work on the communications interface which would connect\nthe deployed DOMs down in the ice to a network of off-the-shelf\ncomputers running on the surface, a design which would make IceCube an\nexperiment with relatively little custom-built electronics from a\nhigh-energy physics standpoint (the DOMs, cables, and a computer\ninterface card plugged into a commodity chassis are the only hardware\nwe had to design ourselves… the rest of the experiment looks like a\ndata center you’d find at any medium-sized Internet company).\u003c/p\u003e\n\u003cp\u003e\nThe first three IceCube holes were planned for early 2005, but the\nfirst version of the new drilling equipment (an enormous engineering\ntask in and of itself) proved exceptionally challenging, and after an\ninjury in the drill camp and many other difficulties, the first\nIceCube string was deployed in early January. After freeze-in, the\nDOMs were powered on for the first time by National Science Foundation\nRepresentative Jerry Marty and Station Manager BK Grant, with all of\nus watching with bated breath to see if the DOMs communicated. They\ndid.\u003c/p\u003e\n\u003cp\u003e\nThe following seasons were all very challenging. Drilling improved\nsubstantially with experience, with 8, 12, 19, 19, 20 and 7 strings\ndeployed in the following years, respectively. Software was written,\nand rewritten, to read out the data generated by 5500 DOMs and to\nprogressively reduce the huge volume of noise to a size small enough\nto be sent over the satellites to the North. Tasks such as writing the\nembedded software for the DOMs themselves, to the system which sifts\nthrough the detected light to “trigger” on signals from real particles\ntraveling through the Ice, to the filtering of these particles for\nneutrinos, to the overall control and monitoring of the system, to the\nsimulation of the entire process to be able to make firm quantitative\nstatements about what we are seeing — all this has taken a tremendous\namount of effort, collaboration, acquisition of knowledge and skill,\npolitical struggles, failures and triumphs.\u003c/p\u003e\n\u003cp\u003e\nIt has seemed that since we started this project, there has been\nbarely enough time to catch one’s breath. Now we are at the end of the\nconstruction of this utterly strange device. I have put nearly a\ndecade of my life into this project alone. If you count AMANDA, I have\nspent almost half my life in this field.\u003c/p\u003e\n\u003cp\u003e\nLast night we took the first runs with the completed IceCube detector\n— all 86 strings. Though hopefully the experiment will run for\ndecades, in some sense last night’s runs were for me the fruition of\nyears of effort, since I have been more a builder than a user of this\ninstrument. I was going to write more about how it feels to hit this\nmilestone (one which I was never at all certain we would reach), and\nless about the history… but how I feel seems somehow not that\nimportant right now. We built it. Many of us. It is good. May it run\nlong and see deep into the fabric of things. May it teach all of us\nabout many new and beautiful things. May we all benefit from working\ntogether and take the knowledge gained, from the trivial to the\nprofound, out into the world to do good things.\u003c/p\u003e\n\u003cp\u003e\nTime to greet the dozen or so of new IceCube arrivals from the flight\nlanding now — the last big batch of \u0026#39;Cubers for the season… maybe the\nlast big batch ever.\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/5368589556_99e1380a8c_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/5368589556_99e1380a8c_o_hufa4afe0e6a224acd957532582f1f3e63_189106_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nIceCube on-Ice lead Greg Sullivan starts the first 86-string run using IceCube Live\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/5368605334_d21905313a_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/5368605334_d21905313a_o_huc34453fee5eff8989638141e8ea09174_1003230_700x0_resize_q75_box.jpg\" style=\"width:400px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nCelebrating the run\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/baby-its-cold-outside/\"\u003eBaby, It\u0026#39;s Cold Outside\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/friendly-radiation/\"\u003eFriendly Radiation\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003c/main\u003e",
  "Date": "2011-01-18T23:25:00Z",
  "Author": "John Jacobsen"
}