{
  "Source": "johnj.com",
  "Title": "Traveller and the Human Chain",
  "Link": "http://johnj.com/posts/traveller-and-the-human-chain/",
  "Content": "\u003cmain class=\"content\"\u003e\n\n\n\u003ch1\u003eTraveller and the Human Chain\u003c/h1\u003e\n\n\n\u003cp\u003e\n\n\u003ca class=\"tag\" href=\"/tags/southpole\"\u003e\u003cspan class=\"southpole-tag\"\u003esouthpole\u003c/span\u003e\u003c/a\u003e\n\n  ..... \u003cem\u003e\u003ctime class=\"postdate\" datetime=\"2011-11-17T00:00:00Z\"\u003e\n      November 17, 2011\n    \u003c/time\u003e\u003c/em\u003e\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/fresh-air-and-bananas/\"\u003eFresh Air and Bananas\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/reveille/\"\u003eReveille\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003cp\u003e\nNov. 17, 2011 11:39 NZDT B2 Science, Amundsen-Scott South Pole Station\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/6351772267_d0663ae803_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/6351772267_d0663ae803_o_huf363a68f05629496b8f94956765b6eab_1321159_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nSummer Camp from the A4 wing\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nJust helped form a human chain to bring the mail into the Station,\nbrought to Destination Zulu by a snowmobile/sled combo and a\nfront loader from Cargo, and swapped hand-to-hand up the stairs into\nthe airlock to the Post Office. Mail is a big deal here, and I’ve\nenjoyed getting it in the past, so it’s fun to be a part of that, even\nif just a few minutes.\u003c/p\u003e\n\u003cp\u003e\nThough I’ve continued to acclimate and have started running in the\nGym, I have not been sleeping well. Not sure why, because, though\nnoisy, it’s not as loud as it’s been in the past. It’s still\nbearable. But I have to admit it feels as there is no getting away\nfrom this place sometimes. Getting through a few weeks is enough of a\nchallenge that I find it hard to imagine a whole year (much less\nmultiple years like some winter-overs here have done). I do remember,\nhowever, that it always seems to take a period of adjustment to get\ninto a rhythm here. The irony of the short trips I usually take is\nthat I’m generally more or less settled in by the time I leave.\u003c/p\u003e\n\u003cp\u003e\nAt some point I owe returning readers to this blog an\nexplanation. Though I’ve always looked at my trips to the Pole as\npotentially “the last time” (as any visit to an extremely\nstrange/strangely extreme place can be), I was pretty sure last season\nWOULD be the last time, since we were done with IceCube\nconstruction. I kind of made a big deal out of it, and said my\ngoodbyes to this place in this blog last January.\u003c/p\u003e\n\u003cp\u003e\nClearly I was wrong, since here I am. The reason why is that we still\nhave to run the experiment we built, at great cost and effort, for\nmany years to come. Each season we have new winter-over scientists,\nwho have to get trained in many different, rather technical and\nesoteric areas relating to the operation of the detector itself. This\nincludes the maintenance of roughly 150 servers in our laboratory\nbuilding, keeping an eye on network switches, disk and tape drives,\nUPSs, etc.; and running a dozen or so homebrew software subsystems,\neach written (mostly) by physicists, and each with its own\ncharacteristic quirks and features. Though we do some days training on\na test system in Madison, Wisconsin, there is no substitute like\ntraining \u003cem\u003ein situ\u003c/em\u003e, and so my task for this early-season visit is to\nhelp facilitate that training, to answer those questions I can answer,\nto provide exercises and training tasks which will help them prepare\nfor the coming year. My hope was also to get a bit more caught up on\nvarious programming tasks (a hope so far not really realized).\u003c/p\u003e\n\u003cp\u003e\nAll this raises the question, how many more times am I going to do\nthis? Some of you probably figured out long before I did that I might\nhave to actually “decline further missions” if I want to be certain\nthat this trip (or any future one) is the last.\u003c/p\u003e\n\u003cp\u003e\nTo contemplate further trips requires some notion of how such work\naligns with one’s goals and aspirations.\u003c/p\u003e\n\u003cp\u003e\nIn the 1980s, at the height of the Dungeons and Dragons-inspired\ncraze, my friends and I would occasionally take a break from D\u0026amp;D to\nplay a science-fiction variant called Traveller. The basic idea is the\nsame as D\u0026amp;D — one person \u0026#39;creates the world’ and the other players\ncreate characters who do various things in the world, with a sort of\nstory unfolding spontaneously out of the interactions between the\ncharacters and the world, and each other. But rather than knights and\nmagicians entering lairs of monsters, in Traveller, one learns\nesoteric skills and then travels from planet to planet to carry out\nvarious adventures. Worlds can vary wildly in climate, culture, and\ntechnological sophistication, from backwards forested planets to\ndazzling urban arcologies to frozen wastes….\u003c/p\u003e\n\u003cp\u003e\nThe first few times I arrived at Pole, it felt like I was in a\nTraveller game. The military modes of transportation; the quirky,\nunwashed characters; the utter lack of scenery; the\nonly-slightly-breatheable atmosphere; and the elusive sub-atomic\nquarry we were hunting… it was all just \u003cem\u003eso damned sci-fi\u003c/em\u003e. Of course\nthe old Station with its ’70s-era geodesic aluminum dome and the\nsomewhat ramshackle orange buildings within, the slightly chaotic,\ndirty charm of the place, contributed to the atmosphere of\nduct-tape-and-gritty-humor. I loved that aspect of it… in a way, I\nguess I was living out the dream we had carved out gaming in my friend\nFred’s basement fifteen years earlier, and in the books and films I\nconsumed wholesale throughout my (er, extended?) adolescence.\u003c/p\u003e\n\u003cp\u003e\nNow, much of that feeling has been worn away with familiarity. I’ve\nbeen asking myself what’s left when you take away that sci-fi\nfeeling. The South Pole is a job site. People make money here, make\nand lose friends, fall in and out of love, go to the bathroom, get\ninspired or depressed (or both), have accidents, get older. What\narises to fill the absence of the fantasies that this place used to\nfulfill? Other than, of course, the physical and emotional discomfort\n— sleeplessness, chapped hands/lips/elbows/…, headaches,\nlight-headedness, shortness of breath, sinuses made of wood, lack of\nfresh fruits and vegetables, two minute showers twice a week, lack of\nprivacy, restricted entertainment options, lots of rules, nowhere to\ngo.\u003c/p\u003e\n\u003cp\u003e\nI don’t have the answer now but I’m living it, whatever it is. It\nseems to be something about how to maintain cheerfulness under\ndiscomfort and duress. About trying to stay curious about other people\nwhen your own life doesn’t feel that easy. About the gap between when\nsomeone coughs in an adjacent berthing and when the wind rattles the\nwall behind your pillow. About enjoying small things like a good\ncookie or a shared laugh. About accomplishing what you set out to do,\nwith as much contentment as you can manage. And, when you leave, about\nthe satisfaction of seeing night time, and leaves, and (liquid) water,\nand loved ones again.\u003c/p\u003e\n\u003cp\u003e\nRegardless of whether or how I return here in the future, at the\nmoment, getting to know some of these things better is the way\nforward: both the effort, and the reward.\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/6352516056_61d0b512c1_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/6352516056_61d0b512c1_o_hu7597228307098d1f97d41c29b75c246b_788294_700x0_resize_q75_box.jpg\" style=\"width:500px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nGary tries out a helmet\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/6351773993_d95f3db9bc_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/6351773993_d95f3db9bc_o_hu17896fa864626f058c32c15ba50738ce_540178_700x0_resize_q75_box.jpg\" style=\"width:500px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nDeparting Hercules\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/6351771287_f0cab14fa2_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/6351771287_f0cab14fa2_o_hu4d44562616911add8a124c60b297c866_679218_700x0_resize_q75_box.jpg\" style=\"width:500px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nShadow and Summer Camp\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/6352513606_c67643da5d_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/6352513606_c67643da5d_o_hubcc1361c9646f1e0833d5f4c4190d6f3_962988_700x0_resize_q75_box.jpg\" style=\"width:500px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nStation Exterior\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/6351769881_1778912bd9_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/6351769881_1778912bd9_o_hu2ab2125864ed0e3643d0330018a1a278_384543_700x0_resize_q75_box.jpg\" style=\"width:500px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nDestination Alpha\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/6351768757_63943f1268_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/6351768757_63943f1268_o_hufe8c52da1d9eb4f1a44a5be923b1266f_863307_700x0_resize_q75_box.jpg\" style=\"width:500px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nCarlos after a 10k run at -40F/-40C\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/fresh-air-and-bananas/\"\u003eFresh Air and Bananas\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/reveille/\"\u003eReveille\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003c/main\u003e",
  "Date": "2011-11-17T00:00:00Z",
  "Author": "John Jacobsen"
}