{
  "Source": "johnj.com",
  "Title": "Halfway Around the World; Dragging the Soul Behind",
  "Link": "http://johnj.com/posts/halfway-around-the-world/",
  "Content": "\u003cmain class=\"content\"\u003e\n\n\n\u003ch1\u003eHalfway Around the World; Dragging the Soul Behind\u003c/h1\u003e\n\n\n\u003cp\u003e\n\n\u003ca class=\"tag\" href=\"/tags/southpole\"\u003e\u003cspan class=\"southpole-tag\"\u003esouthpole\u003c/span\u003e\u003c/a\u003e\n\n  ..... \u003cem\u003e\u003ctime class=\"postdate\" datetime=\"2005-01-10T00:00:00Z\"\u003e\n      January 10, 2005\n    \u003c/time\u003e\u003c/em\u003e\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/auckland/\"\u003eAuckland; Leaving Already?\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/launched/\"\u003eLaunched\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\n\u003c/p\u003e\u003cdiv id=\"outline-container-headline-1\" class=\"outline-2\"\u003e\n\u003ch2 id=\"headline-1\"\u003e\nHalfway Around the World\n\u003c/h2\u003e\n\u003cdiv id=\"outline-text-headline-1\" class=\"outline-text-2\"\u003e\n\u003cp\u003e\n09:14h\u003c/p\u003e\n\u003cp\u003e\nI\u0026#39;m still stuck in LA but feel as if I\u0026#39;m already halfway around the\nworld. Went out for a jog, just around the block, smelling forgotten,\nfriendly smells, but somehow got stuck in a run down neighborhood and\nhad to jump two fences just to get back to my hotel, which was within\nline-of-sight the whole time. As everyone knows, this place is not set\nup for pedestrians. All the trees here third-world-nation different\nand people drive gleamingly new cars but live in shabby\napartments… I love California but even after living here for five\nyears it feels more like a tourist destination than Home.\u003c/p\u003e\n\u003cp\u003e\nI\u0026#39;m on the same flight to Auckland tonight so I still have 8.5 hours\nto kill. Time for a nap.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003cdiv id=\"outline-container-headline-2\" class=\"outline-2\"\u003e\n\u003ch2 id=\"headline-2\"\u003e\nDragging the Soul Behind\n\u003c/h2\u003e\n\u003cdiv id=\"outline-text-headline-2\" class=\"outline-text-2\"\u003e\n\u003cp\u003e\n12:13h\u003c/p\u003e\n\u003cp\u003e\nI\u0026#39;m listening to an audio book on my iPod: William Gibson\u0026#39;s \u0026#34;Pattern\nRecognition.\u0026#34; The main character is in London with major jet lag. I\u0026#39;m\nnot officially too jet lagged yet but am tired from being\nairport-bound until 3 AM this morning. Gibson\u0026#39;s protagonist describes\njet lag as your soul being reeled in from whatever far away place you\ncame from, drifting like a kite through the troposphere, slower than\nthe trans-oceanic jet you came in on. I\u0026#39;m trying to reel in my soul\njust as quick as can be, \u0026#39;cause soon he\u0026#39;ll have a long distance to\nmake up.\u003c/p\u003e\n\u003cp\u003e\nWhen you\u0026#39;re tired but in your normal routine, you\u0026#39;ve still got the\nglue of that routine keeping you together and productive. When you\u0026#39;re\nin a new place, with time to kill, but alert and rested, you can\nhappily go exploring, or, if you\u0026#39;re a mobile tech warrior,\nproductively tick items off your lists of things to do. But one of the\nparadoxes of killing time while on travel is that you\u0026#39;re both uprooted\nand exhausted, so you live moment to moment, in a kind of blurry fog,\nnot sure what to do next, and too tired to care very much.\u003c/p\u003e\n\u003cp\u003e\nTime to repack, head to LAX and take another stab at Aotearoa, the\nLand of the Long White Cloud (New Zealand).\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/auckland/\"\u003eAuckland; Leaving Already?\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/launched/\"\u003eLaunched\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003c/main\u003e",
  "Date": "2005-01-10T00:00:00Z",
  "Author": "John Jacobsen"
}