{
  "Source": "johnj.com",
  "Title": "The Future",
  "Link": "http://johnj.com/posts/the-future/",
  "Content": "\u003cmain class=\"content\"\u003e\n\n\n\u003ch1\u003eThe Future\u003c/h1\u003e\n\n\n\u003cp\u003e\n\n\u003ca class=\"tag\" href=\"/tags/southpole\"\u003e\u003cspan class=\"southpole-tag\"\u003esouthpole\u003c/span\u003e\u003c/a\u003e\n\n  ..... \u003cem\u003e\u003ctime class=\"postdate\" datetime=\"2011-01-10T00:00:00Z\"\u003e\n      January 10, 2011\n    \u003c/time\u003e\u003c/em\u003e\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/transitions/\"\u003eTransitions\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/sunday/\"\u003eSunday\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003cp\u003e\nMonday, Jan. 10 2011 12:05 a.m. UTC\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/5340553129_1848504cf2_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/5340553129_1848504cf2_o_hu99391a5f15db540d398ce4311e6404f7_767519_700x0_resize_q75_box.jpg\" style=\"width:400px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nDestination Alpha\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nI have a few minutes before today’s passenger flight arrives. Several\n\u0026#39;Cubers are leaving on this flight and are very excited to go (some\nhave been here since November). One colleague says the last thing he\ndoes on the last day is strip the linens off his bed — and only when\nthe flight is 20 minutes out and there is no danger of it going back\nto McMurdo without landing and picking up passengers. Some new people\nare arriving too and I will go out to meet them.\u003c/p\u003e\n\u003cp\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/5340551951_50bd87d933_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/5340551951_50bd87d933_o_hue18bef1313b73f8c1e9afd87a9b5edd1_469445_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\u003c/p\u003e\n\u003cp\u003e\nWork has been going reasonably well from my standpoint. Until the last\nseven strings are handed over, I am basically supporting the WOs [winter-overs] and\nothers and trying to catch up with my backlog of programming\ntasks. Once the final set of strings is tested, then it will be my job\n(with one other fellow and the winter-overs) to bring those new\nstrings in with the other 79 and to test the completed detector for\nthe first time. Jim H. gave us a bottle of champagne to celebrate the\nfirst 86-string IceCube test run — this will be a real milestone and\nI’m excited to get there, having worked on this project for many\nyears.\u003c/p\u003e\n\u003cp\u003e\nLast night some colleagues gave the Sunday Science Lecture in the\nGalley and described a new neutrino telescope in the very early stages\nof construction here at the Pole. It will use radio frequencies rather\nthan light to detect the very highest energy neutrinos. Since the\ntarget neutrino energies are so large (and the particles themselves\nare correspondingly so rare), the radio detector will be 80 square\nkilometers in size — which makes IceCube (at 1 km squared) look like a\npotato chip. The technologies differ in many ways from how IceCube was\nbuilt and is operated; hey are exploring the use of solar and wind\npower to energize the stations, since it will be very difficult to\nsupply power over such a wide area. It was neat to get a glimpse of\nthe future.\u003c/p\u003e\n\u003cp\u003e\nTalking to the drillers and other IceCube folks I can sense a slightly\nbittersweet feeling in the air. The task of drilling and deploying all\nof IceCube, which seemed extremely daunting in 2005, is now done\nsuccessfully, with a remarkable safety record, on schedule and on\nbudget. It is a big victory, but we will all be doing other things\nsooner or later, and as with all accomplishments I think that along\nwith the sense of victory there is a small sense of loss in completion\nof the task. This enterprise which consumed so much of the attention\nof so many of us for nearly a decade is entering a very different\nphase. The completed experiment will continue to run for the next\n10-20 years and will continue to measure some of the most esoteric and\nmysterious fluxes of energy detectable by current methods, in the\nhopes of discovering new sources of neutrinos, and possibly stranger\nkinds of matter as well (supersymmetric particles, monopoles,\n…). Meanwhile, many of us who are not as concerned with the actual\nanalysis per se will be moving on to other pastures. (As someone\nactive in the actual operation of the detector, I currently still have\na lot to do, but this, too, will eventually change, as things become\nmore streamlined.)\u003c/p\u003e\n\u003cp\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/5340556717_3ed06e0480_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/5340556717_3ed06e0480_o_huf90e29304bfa66576961345307007a78_719341_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/transitions/\"\u003eTransitions\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/sunday/\"\u003eSunday\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003c/main\u003e",
  "Date": "2011-01-10T00:00:00Z",
  "Author": "John Jacobsen"
}