{
  "Source": "johnj.com",
  "Title": "Drifts",
  "Link": "http://johnj.com/posts/drifts/",
  "Content": "\u003cmain class=\"content\"\u003e\n\n\n\u003ch1\u003eDrifts\u003c/h1\u003e\n\n\n\u003cp\u003e\n\n\u003ca class=\"tag\" href=\"/tags/southpole\"\u003e\u003cspan class=\"southpole-tag\"\u003esouthpole\u003c/span\u003e\u003c/a\u003e\n\n  ..... \u003cem\u003e\u003ctime class=\"postdate\" datetime=\"2011-11-13T00:00:00Z\"\u003e\n      November 13, 2011\n    \u003c/time\u003e\u003c/em\u003e\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/reveille/\"\u003eReveille\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/bon-voyage/\"\u003eBon Voyage\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/6338735475_78d2300746_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/6338735475_78d2300746_o_hu752226d2e0a545cbdfc755aac567713a_685828_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\u003c/p\u003e\n\u003cp\u003e\nFeeling a bit run down this afternoon. Got up and decided it was my\nfirst “workout” day, working out consisting of twenty minutes of\nwalking since this is still just my fourth day here. Had a nice walk\nand a bit of a stretch, and then a SHOWER, my first since\nMcMurdo. Feeling pretty peppy, I had decided today would mostly be a\nday off, to rejuvenate and prepare for the week ahead. I was headed\nback to my room to practice, and ran into WO Carlos who informed me\nthat a server had crashed in the IceCube Lab (ICL) and that the\ndetector was therefore running short one string. So much for a day\noff, but this was another training opportunity, training being\nprimarily what I came down for. Sven and Carlos and I suited up and\nSven got a snowmobile with passenger sled ready (I was happy not to\nhave to walk the half-mile distance there and back, having perhaps\nalready pushed it a bit by walking in the gym).\u003c/p\u003e\n\u003cp\u003e\nI’ve been thinking more about what I wrote the other day, about being\ntuned into differences between this trip and previous ones. In fact, I\nhave mostly been struck by the \u003cem\u003esameness\u003c/em\u003e. The rhythm of the plane rides\nhere, the same faces year after year, the process of acclimatizing to\naltitude, the same nooks and crannies (unmarked bathrooms, locations\nof semi-private phones for calling home) — much has simply not changed\nat all (at least in the past several years, since the new station was\nbuilt). It feels as though this place is on another plane altogether,\nnot part of Earth or the world at all, a kind of parking ground for\n(temporarily?) lost souls. I would liken it to the Tibetan notion of\nbardo, but bardo is an in-between state between incarnations, and this\nplace doesn’t feel in-between at all to me, but somehow out of the\nnormal flow of things. Limbo, perhaps.\u003c/p\u003e\n\u003cp\u003e\nA shift in perspective came to me as I was riding the sled out to the\nICL. The winds are still quite high, keeping the wind chills below\n-60F, and making snow drifts and sastrugi everywhere. As we crossed\nthe skiway I looked out across the vast space and thought about the\ndrifting snow, the constant shifting and drifting, and realized that\nthe change I was curious about, in myself and in others, is more\nsubtle, a building and shifting over time which is hard to notice even\non the time scale of months or years. Yesterday in the galley a\ncolleague of many years, Robert, looked at me and said, “You’re\ngetting grey, man.” True enough. The wearing of time sometimes is\nnoticed not in sudden shifts but in gradual drifting, accumulation,\nwear and tear and the greying of hair. Doesn’t sound cheerful, I\nguess, but it was actually a pleasant notion to contemplate as we\nzipped across the wide white waste.\u003c/p\u003e\n\u003cp\u003e\nAfter which, of course, we quickly fixed what needed fixing and headed\nback for brunch.\u003c/p\u003e\n\u003cp\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/6339469060_6153b75109_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/6339469060_6153b75109_o_huba42abb340334b5a3ffa1de759e28c8e_858411_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/reveille/\"\u003eReveille\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/bon-voyage/\"\u003eBon Voyage\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003c/main\u003e",
  "Date": "2011-11-13T00:00:00Z",
  "Author": "John Jacobsen"
}