{
  "Source": "johnj.com",
  "Title": "Wickets",
  "Link": "http://johnj.com/posts/wickets/",
  "Content": "\u003cmain class=\"content\"\u003e\n\n\n\u003ch1\u003eWickets\u003c/h1\u003e\n\n\n\u003cp\u003e\n\n\u003ca class=\"tag\" href=\"/tags/southpole\"\u003e\u003cspan class=\"southpole-tag\"\u003esouthpole\u003c/span\u003e\u003c/a\u003e\n\n  ..... \u003cem\u003e\u003ctime class=\"postdate\" datetime=\"2009-02-16T00:00:00Z\"\u003e\n      February 16, 2009\n    \u003c/time\u003e\u003c/em\u003e\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/cuba/\"\u003eCuba\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/safe/\"\u003eSafe\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_2964.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_2964_hudb040880a10993b6d74d07b4ea9b104b_61420_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\u003c/p\u003e\n\u003cp\u003e\nMonday morning and Jan, Timo and I are on the Northbound train from\nChristchurch to Picton. Outside, greens and browns of grasses, dry\nscrub, and trees blur together with grey skies, rain and the dun coats\nof sheep. It always seems to rain during my train trips here. It’s\nhard to believe that just Friday morning we were at the South Pole.\u003c/p\u003e\n\u003cp\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_2983.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_2983_hu83c81733d43bb6cb6c7d59ef3961d231_31739_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\u003c/p\u003e\n\u003cp\u003e\nThursday night, having Bag Dragged and then sweated in the sauna\n(\u0026#39;Epic’ was how colleague Stephanie described that last, crowded,\nlengthy steam-bath — with multiple trips outside to Destination Zulu\nto photograph the steam rising off our bodies, trips which were\nsurprisingly pleasant despite the 260 degree Fahrenheit temperature\ntransitions involved), the younger crowd stayed up partying all night,\nwhile comparatively \u0026#39;old’ folks like myself turned in for a few hours\nof sleep. Friday \u0026#39;dawned’ (not a word which applies literally at South\nPole for more than one long week per year) abruptly, with the\nannouncement of the early off-deck of our plane from McMurdo… an\nannouncement which I missed somehow, but caught on the online\n\u0026#39;scroll.’ Given that the flight was going to arrive, and therefore\nleave, early, I spent a few minutes tracking everyone down so that\nnobody would miss the flight.\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_2704.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_2704_hu01b5865000b0022ef6b0aa012d95db35_90794_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nAnna at Bag Drag\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_2720.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_2720_hu570414147740bc86b2592cdc0ba476a6_81845_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nWaiting for the flight\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nThe last few summer flights from Pole are somewhat bittersweet for all\nconcerned. The winter folks are glad to have the Station to themselves\nat last, but of course it marks the beginning of eight and a half\nmonths of isolation. The Summer crew eagerly await oxygen, moisture,\n\u0026#39;freshies,’ night, family, vacation and sleep. But many of us will\nnever return to the Pole.\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_2734.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_2734_hu1c0254238c10d3b7b406f8bc55804507_58275_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nErik documents the departure\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_2747.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_2747_hu2a817e846ff66454418c2730171f23b2_58543_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nBoarding the flight North\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nWinter-overs Camille and Erik came out to say goodbye to the last ten\nor so of us \u0026#39;Cubers to leave. The flight came and we huddled around in\nthe -50F air like a bunch of penguins until we were signaled to\napproach the plane. Awash in the deafening roar of the props near the\nnose of the aircraft, I turned and waved to Erik and saw his wave in\nresponse. Then it was climb the stairway, stuff myself and my bags\ninto the nearest available seat, and buckle in. There actually weren’t\nenough seats for the available passengers, so Stephanie, who got on\nlast, was pulled aside and got to experience take-off from South Pole\nwith the flight crew in the cockpit. After takeoff the pilots\npressurized the cabin to more atmospheres than I’d had since Jan. 20.\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_2766.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_2766_hu2ffb3b8fd5703677a94362600a54dfb6_44598_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nTimo takes one last picture of the South Pole\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_2811.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_2811_hu9043f16e55f9e0c07887732beef8d31c_71265_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nLC-130 Flight Deck\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_2815.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_2815_hu63d7c7663caae8bcfe6d41865c0ecbee_68060_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nStephanie and Anna\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nWe arrived at the Pegasus ice runway to overcast weather, with Castle\nRock and Ob. Hill barely visible, Mt. Erebus not at all. The Herc\ndisgorged us and our bags and immediately took to the air again to\nland at Williams field, a mere handful of miles away. We had our\nchoice of rattling around on the ice outside (the weather was\ncertainly warmer than Pole, with Real Snow™ but rather windy) or the\n\u0026#39;pax terminal,’ a grungy orange box on skis, big enough to hold fifty\nor so people. After taking the obligatory photos of the various\nfirefighting vehicles nearby, we packed inside and settled in for the\ntwo hour wait for the C-17 from Christchurch.\u003c/p\u003e\n\u003cp\u003e\nWe debated whether we could feel the difference in the\naltitude. Stephanie was the only one who said she felt nothing at\nall. I could, as usual: I find the sensation of returning to sea level\nto be a vertiginous cross between a caffeine dose, a feeling of having\ncome in from the rain and changed clothes, and, paradoxically, being\nso relaxed I feel like taking a nap (though that last part could have\nmore to do with shifting from night shift to days in less than 48\nhours).\u003c/p\u003e\n\u003cp\u003e\nTo kill time we set up my laptop and fired up The Incredibles (with\nsubtitles, because of the noise of other people talking), the audience\neventually expanding to include a couple of non-Cubers. The C-17\narrived just after Helen and the kids were shot down in their aircraft\nand \u0026#39;paddled’ to shore. The plane’s arrival meant we all felt we had\nto suit up and watch the unloading and loading of cargo despite the\nfact that it clearly would be a full hour before we were waved onto\nthe plane.\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_2940.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_2940_hu086184da8fc615e4bd0a390b526dca3a_31247_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nWaiting to board the C-17\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nAt some point each of us started to remember that it doesn’t have to\nbe -50F to feel extremely cold (it was probably about 20F but much\nmore humid than at Pole). But soon enough we were packing into the\nC-17. Just before I entered the plane, I turned around and took what\nmay have been my last look at Antarctica: a panorama of whites and\nsubtle, pale grays… a few distant mountains shrouded by low-hanging\nclouds, outcroppings of rock, and a handful of human artifacts out on\nthe airfield. Not much to look at, but special somehow in some way I\nhave never quite been able to articulate.\u003c/p\u003e\n\u003cp\u003e\nOne’s first look at Antarctica is thrilling: here you are in a place\nmost people will never see except in pictures or on film or TV. It is\nan otherworldly place whose few native inhabitants, while familiar\nthrough media and popular culture, are quite alien up\nclose. (Penguins, for example, are somehow much odder \u0026#39;in the flesh’\nthan one would expect). The people, too, tend to be a breed apart\nsomehow. Many of them young, most of them white and lower to middle\nclass, they come from all over the world but often hail from the US\nMidwest or mountain states; are often better educated than their\non-Ice job descriptions would suggest; and have robust senses of humor\nand very tight social ties with one another. \u0026#39;Repeat offenders’ such\nas myself tend to be both specialists who have niched themselves so\ntightly into their work that they are hard to replace, and people who\ncherish the sense of community that exists on the Ice. In addition to\nthe colleagues you know and don’t get to see except on the Ice, it is\nsomehow reassuring to see all those other familiar faces season after\nseason, even when you don’t know their names. One feels like one is\npart of something, though it is hard to say what that something\nis. Surely, we are there to do or to support science… but there are\ngeopolitical angles as well, a fact which adds a slight tinge of\nartificiality to the whole enterprise. And then there is the fact that\none reason we are there is … because it is there. Antarctica is a\nmountain to be climbed, a planet to visit, a river to cross.\u003c/p\u003e\n\u003cp\u003e\nIn November, an expeditioner named \u003ca href=\"https://en.wikipedia.org/wiki/Todd_Carmichael#Adventure_Travel\"\u003eTodd Carmichael\u003c/a\u003e set off from a\ncoastal location called Hercules Inlet and broke the world’s speed\nrecord for unassisted traverse to the Pole. His ski bindings broke\nsoon after beginning his trip, so he proceeded the rest of the way on\nfoot. By the time he reached the Pole he was so disoriented that he\ntalked to his sled and had trouble finding the station even when it\nwas right in front of him. A colleague interviewed him on video while\nhe was recovering in the medical clinic at the Pole. At the other end\nof what had turned out to be a near-death experience, Carmichael\ntalked about endurance not just as a means to reach a goal but as a\nvalue in itself. “Hard things are good for you too.” That value\nresonates for me, and I suspect it does as well for other travellers\nto the Ice.\u003c/p\u003e\n\u003cp\u003e\nSometimes, after sweating through my daily session in the station’s\ngym, I’d step directly outside into the cold air on the upper level\ndeck outside the Station. With nothing on but running shoes, shorts\nand a t-shirt, someone who is warmed up can last up to a minute or two\noutside without even getting particularly cold. It’s enough time to\nreestablish the sense of where you are: the incredible brightness; the\nview of the experimental buildings in the Dark Sector; the crossing\nbeacon for the skiway; a thousand half-buried flags indicating buried\ncables, buildings, fuel lines; the view, off to one’s left, of Summer\nCamp and the cargo berms. The cold so sharp it makes your lungs ache\nto take a deep breath. A momentary flash of the South Pole, of the\ndiamond-crisp beauty of the place, the infinitely flat wisps of clouds\non the rim of the sky at the very edge of the world. No longer novel,\nAntarctica, but personal, and deadly, and dear.\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_2943.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_2943_hufe302e4c4e753535983d980fd38791d0_51145_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nBoarding the last flight\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nThe C-17 flight back to New Zealand seemed short thanks to my having\nslept, sitting up, through most of it… waking often, sore, desperately\nwishing for a bed, and then falling unconscious again. By the time I\nwoke completely we were readying for our descent into\nChristchurch. People stripped out of their gear and emerged as\nindividuals, with long hair, piercings, tattoos, shorts, sandals. You\nhave to go through customs again before they’ll let you back into New\nZealand. The customs officials ask, “Did you fly to the Ice from\nChristchurch?” Not being Todd Carmichael, the answer, of course, is\nalways yes. Night time, humidity, wait for a shuttle, then back at the\nDevon, were the beckoning of the bed trumps even that first, long\nshower.\u003c/p\u003e\n\u003cp\u003e\nThe weekend was spent shopping for gifts from home, delighting in real\nfood (bananas, beer, fish, salads, Banoffee Pie from the Dux again!)\nand, Sunday, watching a four hour cricket match at a park on the\noutskirts of town. Stephanie and Suruj, both colleagues from\nCanterbury University in Christchurch, were there to teach the rules\nand the finer points of strategy and culture (trivia question: Who\nplayed the first international cricket game? Answer: the United States\nvs. Canada). I would always rather watch a sporting match in person\nthan on TV, and would rather play than watch. Suruj presciently\nobliged by bringing a cricket bat and ball: at half time we took to\nthe field with about a thousand underage Kiwis and he taught us how to\nbowl and to bat.\u003c/p\u003e\n\u003cp\u003e\nNow it is Tuesday and I am perched in the top floor of a house looking\nout over the Queen Charlotte Sound, about twenty minutes by boat from\nPicton. My gracious hosts at the Fern Ridge Homestay are Nicki and\nNeil. I spent the morning walking a four-hour portion of the Queen\nCharlotte Track, similar to what I did last year. Nicki took me by\nboat to Torea Bay and picked me up at Mistletoe Bay. As I walked along\nthe Track, cicadas as large as small hummingbirds thudded against my\nhat, their collective cries throughout the bush loud enough to drown\nout a C-130. I also passed a six hundred year old rimu tree, a\nspecimen of the kind that used to cover much of New Zealand, a tree\nsimilar in size, age and kind to the redwoods of California. On our\nway back, after picking me up, Nicki stopped the boat in a small\nharbor along the way to feed breadcrumbs to the herring and mackerel,\nwhich swarmed so thick to the food that I could feel their slimy,\nwriggling bodies as I swept my hand through the water.\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_3102.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_3102_huad29a189ad83fad69b700a1810417e48_37701_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nQueen Charlotte Sound\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_3127.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_3127_huaf35178e7197168fcb2fce2587779ecb_70365_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nView from Queen Charlotte Track\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_3135.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_3135_hu2b61f777a94d614f42cdf2b7795606f3_50286_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nView from Queen Charlotte Track\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_3139.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_3139_hu1069c9020a6eb017a6b5d206bd504108_61946_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nView from Queen Charlotte Track\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_3225.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_3225_hu6c1216c75c2e5b3964d93643bfff989f_77742_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nFern Ridge still life\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nI have another night here and another day on the Sounds; then a night\nin Picton, after which I take the ferry to Wellington to see Neil and\nAmelia. The it’s back to winter in Chicago, which will hopefully be\nalmost over. I am looking forward to seeing Eden, family, friends, to\nbeing in my studio, and to being in one place again for awhile.\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_3226.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_3226_hu979ae954978985e7a39f2d4bf8863a17_17989_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nNight view from Fern Ridge Homestay\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\n\u003ca href=\"./galleries/pole09/index.html\"\u003eMore pictures, from the Pole\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\n\u003ca href=\"./galleries/postpole09/index.html\"\u003eMore pictures, Post Pole\u003c/a\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/cuba/\"\u003eCuba\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/safe/\"\u003eSafe\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003c/main\u003e",
  "Date": "2009-02-16T00:00:00Z",
  "Author": "John Jacobsen"
}