{
  "Source": "johnj.com",
  "Title": "In Defense of Hobbies",
  "Link": "http://johnj.com/posts/in-defense-of-hobbies/",
  "Content": "\u003cmain class=\"content\"\u003e\n\n\n\u003ch1\u003eIn Defense of Hobbies\u003c/h1\u003e\n\n\n\u003cp\u003e\n\n\u003ca class=\"tag\" href=\"/tags/code\"\u003e\u003cspan class=\"code-tag\"\u003ecode\u003c/span\u003e\u003c/a\u003e\n\n\u003ca class=\"tag\" href=\"/tags/art\"\u003e\u003cspan class=\"art-tag\"\u003eart\u003c/span\u003e\u003c/a\u003e\n\n  ..... \u003cem\u003e\u003ctime class=\"postdate\" datetime=\"2011-05-29T00:00:00Z\"\u003e\n      May 29, 2011\n    \u003c/time\u003e\u003c/em\u003e\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/sketchup-and-makehuman/\"\u003eSketchUp and MakeHuman\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/closure/\"\u003eClosure\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003cp\u003e\nI’ve been thinking about hobbies lately. Though “hobby” isn’t a word I\nhear much these days, when I was a kid I thought about my hobbies all\nthe time. In fact, I can subdivide my youth into the various hobbies I\nwas interested in:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eModel trains\u003c/li\u003e\n\u003cli\u003eModel airplanes\u003c/li\u003e\n\u003cli\u003eRock collecting\u003c/li\u003e\n\u003cli\u003eShell collecting and study of fish and ocean life\u003c/li\u003e\n\u003cli\u003eModel rockets\u003c/li\u003e\n\u003cli\u003eElectronics\u003c/li\u003e\n\u003cli\u003eScience fiction\u003c/li\u003e\n\u003cli\u003eSkateboarding\u003c/li\u003e\n\u003cli\u003eGaming (role playing, military, board games, …)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThe first two were big ones. Trains were a first love, and my\ngrandfather had a beautiful old HO-gauge steam train set with which I\nwas obsessed. During one family visit I was allowed to sleep with the\nengine and tender. They smelled faintly of multi-purpose electric\nmotor oil and of the tablets which were placed in its smokestack\nwhich, when heated during normal operation, simulated smoke. I can\nalso remember the smell of the HO-gauge green and white Burlington\nNorthern diesel engine I had, and the excitement and frustrations\ninvolved with setting up my first layout in our basement.\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/sleeping-with-trains.jpg\"\u003e\u003cimg class=\"resize\" src=\"/sleeping-with-trains_huaa6c4229caf85465b469549283022c9e_47904_700x0_resize_q75_box.jpg\" style=\"width:500px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nSleeping with Trains\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nMy favorite store at the mall was called Hobby Horse [the etymology of\n\u003cem\u003ehobby\u003c/em\u003e is late Middle English \u003cem\u003ehobyn\u003c/em\u003e or \u003cem\u003ehoby\u003c/em\u003e, from nicknames for the\ngiven name Robin, which also, along with \u003cem\u003eDobbin\u003c/em\u003e (aka Robert), denoted\na small horse]. Hobby Horse had a glass case with N-scale train\nengines and cars in crystal boxes which you could shuffle or rotate\nlike a heavenly train-jukebox by pressing green “forward” and\n“backwards” buttons.\u003c/p\u003e\n\u003cp\u003e\nWhen I was a little older I used to wander off on my own to spend my\nallowance at the Midvale Hobby Shop. This trip used to involve a\nseveral-mile trek on foot out the train tracks on the west side of\nMadison, Wisconsin (this was back in the days when parents used to let\ntheir kids wander around unattended as opposed to driving them\neverywhere in minivans). After buying gum at the nearby grocery store,\nI would wander the densely-packed aisles of the hobby shop, lusting\nafter the model airplanes and occasionally buying the cheaper ones\nthat were within my budget. These would get assembled by me and my\nfriends, painted and decal-ed somewhat haphazardly, and then have\nbullet holes burned in the fuselage with magnifying glasses and\nsunlight (like plenty of boys of that era, we were obsessed with the\nSecond World War and its aircraft in particular).\u003c/p\u003e\n\u003cp\u003e\nLong before it became its own focus of interest, drawing was a\nmeta-hobby — all my childhood hobbies involved drawing. Drawing could\nbe done just about anywhere, required very little hardware (a ball\npoint pen on IBM punch cards worked just fine, thank you very much),\nand afforded the free ranging of the imagination over any aspect of\none’s obsession, whether trains, sharks, or Curtiss P-40 “Flying\nTiger” aircraft.\u003c/p\u003e\n\u003cp\u003e\nIn High School, drawing metastasized into Art, including ceramics,\nsculpture, woodworking, painting, and graphic design. No longer\nhobby-like, since it was school, and therefore not leisure time\n(“hobby” is defined as an activity done regularly for pleasure during\none’s leisure time), art was a social nucleus and a way to understand\nand define who I was — not a mere hobby, but a core of identity.\u003c/p\u003e\n\u003cp\u003e\nAfter childhood, I hardly thought about hobbies at all. A decade-long\nobsession with physics started (physics is a bit unforgiving to have\nhobbyists, though there are some); I also went to art school and spent\nsome time growing an art career, and the fastest way to piss off an\nart student or fledgling “serious” artist is to suggest that he or she\nis doing it as a hobby.\u003c/p\u003e\n\u003cp\u003e\nNow it is another decade or two on and I hardly ever hear the word\n“hobby” anymore. This may be in part because people have less leisure\ntime to begin with (particularly in the wake of the economic downturn\nand shrinking incomes in general). It may also be due to the enormous\nincrease in variety and sophistication of entertainment, from video\ngames to movies and television, to social media and other online\ndistractions, any of which could I suppose could be called hobbies but\nwhich lack the sort of active creativity I associate with the word.\u003c/p\u003e\n\u003cp\u003e\nLast night over dinner with my mom and stepdad and friends of theirs,\nwe were discussing hobbies. Ron’s brother simulates baseball games. He\nand his pals gather virtually over the Internet (and, from time to\ntime, in the real world), accumulate deep wells of player-related\nstatistics, trade actual real-world players back and forth on virtual\nteams, and slug out simulated National League games using intricate\nrule systems. Ron’s brother apparently thinks (and talks) a great deal\nabout this activity despite, or perhaps because of, the fact that it\nprovides absolutely no illusion that, if only one worked hard enough,\none could eke out some sort of living as a “professional.”\u003c/p\u003e\n\u003cp\u003e\nThe boundary between hobby and profession seems to be whether the\nactivity is paying the bills (this distinction is especially important\nto the IRS, which essentially uses the profitability of one’s activity\nto determine whether expenses in support of that activity are tax\ndeductible). Yet many of my friends in the visual or performing arts,\nmyself probably included, will never support themselves and their\nfamilies solely on their artistic activities (even art and dance\nprofessors still have to teach, and teaching is a profession in its\nown right). Nevertheless, they would not consider themselves hobbyists\n— a word that we associate with dilettantism or lack of seriousness.\u003c/p\u003e\n\u003cp\u003e\nI think it’s time to rehabilitate the word “hobby.” Unlike\nprofessions, hobbies can wax and wane without shame. To have a hobby\nis to be an amateur, meaning one who loves something. To have a craft,\nwhether it’s needlework, growing orchids, or fixing your car. My dad’s\nhobby is making deep Web sites for family genealogy and media. I know\nguys who collect, fix and modify 1970s and ’80s era personal\ncomputers. Another friend restores prairies.\u003c/p\u003e\n\u003cp\u003e\nAt the moment, I am, among other things, a professional programmer. I\nwonder what it would be like to be a hobbyist programmer. One who\nprograms solely for the love of programming, who has the luxury of\ntaking time to make things as beautiful and as clean as possible, to\npolish and craft code like a jeweler or a fine cabinetmaker. Instead\nof walking for hours on the railroad tracks to the hobby store (the\nstore is long gone and the tracks have been replaced by a bike trail),\nI imagine a similar preparatory activity, walking outdoors among the\ntrees, calming my head and refreshing my body, and then sitting down\nto engage with … my hobby.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/sketchup-and-makehuman/\"\u003eSketchUp and MakeHuman\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/closure/\"\u003eClosure\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003c/main\u003e",
  "Date": "2011-05-29T00:00:00Z",
  "Author": "John Jacobsen"
}