{
  "Source": "johnj.com",
  "Title": "The Cruel Stranger",
  "Link": "http://johnj.com/posts/the-cruel-stranger/",
  "Content": "\u003cmain class=\"content\"\u003e\n\n\n\u003ch1\u003eThe Cruel Stranger\u003c/h1\u003e\n\n\n\u003cp\u003e\n\n\u003ca class=\"tag\" href=\"/tags/southpole\"\u003e\u003cspan class=\"southpole-tag\"\u003esouthpole\u003c/span\u003e\u003c/a\u003e\n\n  ..... \u003cem\u003e\u003ctime class=\"postdate\" datetime=\"2009-11-10T00:00:00Z\"\u003e\n      November 10, 2009\n    \u003c/time\u003e\u003c/em\u003e\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/ruby-plugins-for-sketchup/\"\u003eRuby Plugins for Sketchup\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/photoshop-on-a-dime/\"\u003ePhotoshop on a Dime\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/planetary_convergence_iii.jpg\"\u003e\u003cimg class=\"resize\" src=\"/planetary_convergence_iii_huef3270474b49a9d889d30cf2925c0dba_120217_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\u003c/p\u003e\n\u003cp\u003e\nCame across an interesting post today by author R. Scott Bakker,\nwriting on \u003ca href=\"http://www.tor.com/index.php?option%3Dcom_content\u0026amp;view%3Dblog\u0026amp;id%3D58246\"\u003eTor.com\u003c/a\u003e about his novel, “Neuropath.” He has \u003ca href=\"https://www.tor.com/2009/11/09/a-fact-more-indigestible-than-evolution/\"\u003esome\ninteresting things\u003c/a\u003e to say about the sometimes alien and unpalatable\nconclusions provided by science, an institution which he likens to a\n“cruel stranger”:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003eSo here’s the question: What other bitter pills does science hold in\nstore for us? The cruel stranger isn’t finished, you can bet the\nfamily farm on that simply because nothing is final in science. So\nwhat other stomach churning surprises does it hold in store for us?\nAnd what happens if it begins telling us things that are out and out\nindigestible?\u003c/p\u003e\n\u003cp\u003e\nWhat if science, the greatest institutional instrument of discovery in\nhistory, starts telling us there’s no such thing as choices, or\nstranger still, selves? What if the portrait of humanity that science\nultimately paints strikes us as immediately and obviously inhuman?\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003e\nI have been long intrigued by the ability of science to dish up\nconclusions in which are difficult to accept. The obvious example is\nevolution, but evolution is something I personally grew up with and\nactually find comforting (our literal kinship with the rest of the\nanimal kingdom). However, some of science’s conclusions about the\nphysical world are hard to swallow. Einstein, for one, could never\naccept the randomness inherent in the quantum theory (“God does not\nplay dice with the universe”). I, for one, am pained by notions such\nas the \u003ca href=\"https://en.wikipedia.org/wiki/Interstellar_travel#Interstellar_distances\"\u003einaccessibility of distant stars\u003c/a\u003e or the notion of \u003ca href=\"http://en.wikipedia.org/wiki/Heat_death_of_the_universe\"\u003ethe end of\nthe universe\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\nThe latter idea is particularly difficult and intriguing for me. As a\n\u003cdel\u003enon-theist with strong\u003c/del\u003e Buddhist \u003cdel\u003eleanings\u003c/del\u003e, what I \u003cem\u003ewant\u003c/em\u003e to believe (so\nlong as I have beliefs!) is that the universe will continue to\nmanifest forever in a sort of infinite, awesome, endless dance of\nchange. However, while the cosmological picture has evolved\ntremendously even in my lifetime, and will probably change more, the\ndominant theory (as I understand it) currently has the universe\ncontinually expanding at ever increasing speeds under the influence of\ndark energy, as the stars gradually burn out, grow cold and\ndark. Ultimately, very little can happen in such an asymptotic\nuniverse… certainly not any form of life as we can currently imagine\nit.\u003c/p\u003e\n\u003cp\u003e\nOn the human scale, one struggles to accept one’s own mortality, but\nit is a comfort to think of the world continuing on. Of course, the\neventual fate of the Earth is likely \u003ca href=\"http://en.wikipedia.org/wiki/Red_giant#The_Sun_as_a_red_giant\"\u003eevaporation as the sun\nexpands\u003c/a\u003e. But the cosmos will always be there, with new beings, new\ncivilizations, or at least, the vast beauty of astronomical\nphenomena. Or will it?\u003c/p\u003e\n\u003cp\u003e\nForget mortality, forget the utter insignificance of humanity in the\ncrushing vastness of the cosmos. If the universe itself dies (becomes\nstatic), then \u003cem\u003echange itself\u003c/em\u003e will come to an end. Where is the comfort\nin that? Fortunately, cosmology as a science is truly in its infancy\n(for example the vast majority of the mass-energy in the universe, in\nthe form of dark energy and dark matter, are still almost completely\nunknown to us), so the picture will probably continue to evolve. But\nwhat if science tells us that the universe really has a finite (if\nvery very very long) life span? The Cruel Stranger will have struck\nyet again… and, certainly, not for the last time.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/ruby-plugins-for-sketchup/\"\u003eRuby Plugins for Sketchup\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/photoshop-on-a-dime/\"\u003ePhotoshop on a Dime\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003c/main\u003e",
  "Date": "2009-11-10T00:00:00Z",
  "Author": "John Jacobsen"
}