{
  "Source": "johnj.com",
  "Title": "Repainting",
  "Link": "http://johnj.com/posts/repainting/",
  "Content": "\u003cmain class=\"content\"\u003e\n\n\n\u003ch1\u003eRepainting\u003c/h1\u003e\n\n\n\u003cp\u003e\n\n\u003ca class=\"tag\" href=\"/tags/art\"\u003e\u003cspan class=\"art-tag\"\u003eart\u003c/span\u003e\u003c/a\u003e\n\n  ..... \u003cem\u003e\u003ctime class=\"postdate\" datetime=\"2017-05-14T00:00:00Z\"\u003e\n      May 14, 2017\n    \u003c/time\u003e\u003c/em\u003e\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/daily-composition-lessons-learned/\"\u003eReflections on a Year of Daily Memory Drawings\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/daily-memory-drawing/\"\u003eDaily Memory Drawings\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_6813.JPG\"\u003e\u003cimg class=\"resize\" src=\"/IMG_6813_hu4c68a40be79557ff6be54f4f6372944c_1450283_700x0_resize_q75_box.JPG\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nPainting in Progress - from imagination\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nAs I return to the painting on my easel, reworking both the major\nfigures and probably everything else as well, I am put to mind of a\nlesson by a former teacher, \u003ca href=\"http://www.carolpylant.com/HOME.html\"\u003eCarol Pylant\u003c/a\u003e.  She told me to be paint\nover the edges of my foreground figures when working on backgrounds,\nso the backgrounds don’t get too “stiff.” Of course, this applies not\njust to edges.  “If you painted it once, you can paint it again,” she\nsaid.\u003c/p\u003e\n\u003cp\u003e\nThere are some variants to this last phrase which come to mind:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eIf you painted it once, and are afraid you won’t be able to paint it\nas well or better, you probably need more practice.\u003c/li\u003e\n\u003cli\u003eIf you painted it once, and had fun doing so, you can have fun doing\nit again.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eI think a major source of strength in a drawing or a painting (or a\ncomputer program, for that matter) is the ability of letting go of\nwork completed so that better work can emerge.\u003c/p\u003e\n\u003cp\u003e\nThis was vividly reinforced for me when I watched \u003ca href=\"http://steven-assael-mr8x.squarespace.com/work\"\u003eSteven Assael\u003c/a\u003e paint\nfor two days in February.  He built up beautiful passages again and\nagain and destroyed them… mostly.  Traces remained, in the layers of\nmarks and paint and texture.  Same thing, last month, watching him\ndraw the figure, and encouraging students to make radical changes even\nin the last few minutes of a pose… destroying what was there to open\na path for something much better to emerge.  As time goes on I can see\nthat opening that path over and over again is absolutely critical for\nsuccessful work. Destruction is often a prerequisite for successful\ncreation.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/daily-composition-lessons-learned/\"\u003eReflections on a Year of Daily Memory Drawings\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/daily-memory-drawing/\"\u003eDaily Memory Drawings\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003c/main\u003e",
  "Date": "2017-05-14T00:00:00Z",
  "Author": "John Jacobsen"
}