{
  "Source": "johnj.com",
  "Title": "A Place That Wants You Dead",
  "Link": "http://johnj.com/posts/a-place-that-wants-you-dead/",
  "Content": "\u003cmain class=\"content\"\u003e\n\n\n\u003ch1\u003eA Place That Wants You Dead\u003c/h1\u003e\n\n\n\u003cp\u003e\n\n\u003ca class=\"tag\" href=\"/tags/southpole\"\u003e\u003cspan class=\"southpole-tag\"\u003esouthpole\u003c/span\u003e\u003c/a\u003e\n\n  ..... \u003cem\u003e\u003ctime class=\"postdate\" datetime=\"2011-01-17T00:00:00Z\"\u003e\n      January 17, 2011\n    \u003c/time\u003e\u003c/em\u003e\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/friendly-radiation/\"\u003eFriendly Radiation\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/marathon/\"\u003eMarathon\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003cp\u003e\nSunday, Jan. 16 2011 11:32 p.m. UTC\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/5361440207_200b747959_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/5361440207_200b747959_o_huc055aae857cf1c1d11b4b4e890863d19_531347_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nMarathon finish line at the Geographic Pole\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nIt’s a little before the lunch rush here in the galley and I’m using a\nbit of the quiet time here to write today’s post. From where I sit I\ncan see nearly half the entire horizon — as close to a completely flat\nline as you can get, apart from being on an ocean-going boat, I\nsuppose. There is a meditation technique in which one raises one eyes\nto whatever horizon, real or imaginary, is in front of one, and one\nsimply watches thoughts arise and fall away. That horizon is nowhere\nmore perfect than here.\u003c/p\u003e\n\u003cp\u003e\nThe minimalism of the view means that any human construction (antenna,\ncaterpillar tractor, futuristic building, or any of the many thousands\nof flag markers), no matter how distant, stands out in relief. That\nvisual fact underscores a notion I have about this place. Except for\nfeatureless plains of snow, a wide-open sky, wind, and extreme cold,\none’s experience of this place is almost exclusively that of humans\nand human-made things. No trees, no terrain, no insects or animals, no\nsmells, nothing — except what we have brought here. In this way, this\nalien location is perhaps the most \u003cem\u003ehuman\u003c/em\u003e place I will ever\nvisit. Music in the galley, jokes over email and posted on the\ncorridor walls, footsteps in the hallway outside your room while\nyou’re trying to sleep, the fuel smells mixing with food cooking in\nthe galley, one’s own body odors and those of one’s colleagues, and,\nmost of all, one’s own mundane or esoterically technical work — these\nare the parameters of life here. The strange irony of this place is\nthat it is all fellowship and craft, in one of the harshest spots on\nEarth.\u003c/p\u003e\n\u003cp\u003e\nThere is \u003ca href=\"http://www.nytimes.com/2011/01/16/world/16pole.html?_r%3D1\u0026amp;scp%3D2\u0026amp;sq%3Dsouth%2520pole\u0026amp;st%3Dcse\"\u003ea New York Times article\u003c/a\u003e today about Antarctic tourism\ncommemorating Scott’s and Amundsen’s expeditions here:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003eDespite the potential circus atmosphere, some veterans insist that\nAntarctica is not for novices.\u003c/p\u003e\n\u003cp\u003e\n“It’s a place that wants you dead,” said Robert Swan, an\nenvironmentalist who walked Scott’s route to the South Pole\nin 1985. “Scott found that out 100 years ago.”\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003e\nTrue enough — particularly for tourists who try to walk, ski, or drive\nhere (yes, people do drive to the South Pole from time to time). But\nfor us, ensconced relatively comfortably in this space station /\naircraft carrier / submarine, it is certainly less hazardous than it\nwas for Amundsen and Scott, and nothing more than human. When we visit\nthe stars, we will take everything about ourselves with us… and that\nmay provide the biggest challenge, and the biggest joy.\u003c/p\u003e\n\u003cp\u003e\nYesterday after dinner I took a turn in the dish pit washing\ndishes. The galley serves 200 people for dinner and so there is a real\nafter-dinner rush for the dishwashers; they rely partly on volunteers\non Sunday (and Ricky, one of the dishwashers, had just finished\nwinning the marathon). It was a pleasure to work fast, with my body\nand hands, to feel warm water and the spray of errant droplets on my\nface. Computer work is exceptionally hard to do with full-body\nawareness, but when washing dishes that awareness is an easy\npleasure. Fleetwood Mac off of someone’s iPod kept the beat. The\ngratitude of the galley staff was palpable. It was a high point of\nthis trip, simply to turn dirty dishes into clean ones.\u003c/p\u003e\n\u003cp\u003e\nThe lunch crowd is building. Time to eat.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/friendly-radiation/\"\u003eFriendly Radiation\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/marathon/\"\u003eMarathon\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003c/main\u003e",
  "Date": "2011-01-17T00:00:00Z",
  "Author": "John Jacobsen"
}