{
  "Source": "johnj.com",
  "Title": "Passing Notes",
  "Link": "http://johnj.com/posts/passing-notes/",
  "Content": "\u003cmain class=\"content\"\u003e\n\n\n\u003ch1\u003ePassing Notes\u003c/h1\u003e\n\n\n\u003cp\u003e\n\n\u003ca class=\"tag\" href=\"/tags/southpole\"\u003e\u003cspan class=\"southpole-tag\"\u003esouthpole\u003c/span\u003e\u003c/a\u003e\n\n  ..... \u003cem\u003e\u003ctime class=\"postdate\" datetime=\"2009-01-22T00:00:00Z\"\u003e\n      January 22, 2009\n    \u003c/time\u003e\u003c/em\u003e\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/tourists/\"\u003eTourists\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/translation/\"\u003eTranslation\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_2268.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_2268_hu7fab10e495c4e2559a0e807f3d223ac0_52961_700x0_resize_q75_box.jpg\" style=\"width:500px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nMy room in the A4 wing of the Elevated Station\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nBeen here about 58 hours so far and the reason I am counting in hours\ninstead of days is that my sense of days is pretty shot. I have a\nscrewy sleep routine: 10 hours awake, 3 hours asleep. Lather, rinse\nrepeat. I am trying to be up at night (we keep New Zealand time here)\nfor the satellite hours but usually that entails a long nap in the\nmiddle, which curtails my sleep during the day. I’ll figure it out.\u003c/p\u003e\n\u003cp\u003e\nDespite the goofy schedule and the altitude, last night I felt well\nenough to walk with Dave out to drill camp and watch the nineteenth\nand final IceCube string deployment. Being outside reminded me of how\nbeautiful it is here and how hard that is to see until you are\nactually out in it, seeing the changing sky, the sastrugi, the myriad\nstructures scattered about the snow, structures which do not qualify\nas architecture but are solely and completely engineering.\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_2213.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_2213_hu05d312d4414c527ed0d24ab5f8d4c66a_74212_700x0_resize_q75_box.jpg\" style=\"width:500px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nRyan takes a well depth measurement during deployment.\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nSeeing the last deployment was a real pleasure, partly because I\ndidn’t have to work it — I was a tourist, a real treat after having\nworked on perhaps a dozen or so deployments myself. It was also sweet\nbecause the drilling and deployment went so well this year… and also\nbittersweet, perhaps, because it was the last deployment I’m likely to\nsee. I took photos and some video which I will post as soon as I can.\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_2217.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_2217_hued77738277161904afc9f4cdd2db8b64_53300_700x0_resize_q75_box.jpg\" style=\"width:500px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nHeading back from the Dark Sector\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nAround midnight we decided to head back. A bunch of the drillers were\ndriving back in the “Ford Gran Neutrino” (the modified van which\nIceCube uses to shuttle back and forth to the Dark Sector), and Dave\nand I squeezed in. After we crossed the skiway, the van stopped and\nthe drillers started discussing the expedition which was camped near\nthe station. A small handful of jacked-up and modified Toyota trucks\nhave driven here from a Russian base in support of a ski race across\nAntarctica. It was decided to pay the campers a visit, so we drove the\nvan over there and piled out, admired their trucks, and started\ntalking with a member of the expedition.\u003c/p\u003e\n\u003cp\u003e\nApparently about 300 people have skied, walked, or driven to South\nPole this Summer. These people live in a sort of parallel universe\nwhich is disconnected with that of the station. They are allowed a cup\nof coffee inside and not much else; and few people walk over to their\nmakeshift camps near the Pole marker. So it was a treat to talk to\nthis fellow who has had a pretty different experience in\nAntarctica. After a few minutes of conversation he pointed to Sven and\nsaid, “Hey, you’re Sven!” Then he handed him a note written on a scrap\nof paper from a case of beer. It was given to him by a member of yet\nanother expedition which he encountered during his trip, to give to\nSven at the South Pole! We all laughed. Even though it is nearly as\nempty as Mars (i.e. nearly zero people per square kilometer),\nAntarctica is a small place!\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_2242.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_2242_hu2b86b70e28f1abad89f2e193263cd991_68591_700x0_resize_q75_box.jpg\" style=\"width:500px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nSven greets an expeditioner\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nAfter delicious burgers at Midrats, we started work. There is ever so\nmuch to do and I am starting to get acclimated enough to be able to\nfocus on it. The task at hand is to connect the nineteen new IceCube\nstrings to the rest of the detector, and to calibrate them to prepare\nfor the new physics run starting April 1. Also to carry out a variety\nof software upgrades and make sure everything works correctly. Also,\nto report progress to the north and to coordinate all the activities\nto minimize conflicts.\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_2263.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_2263_hu91e13bd0b9e1596a30051e9556552e0a_67363_700x0_resize_q75_box.jpg\" style=\"width:500px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nWatching the Obama Inauguration\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nThis evening, after another short sleep, we watched highlights of the\nObama inauguration, hand-carried on a DVD on today’s flight. (The CBS\nnews clips carried over the Armed Forces network carried the word\n“Live!” at lower right, which was certainly ironic in this setting,\ndays after the fact.) It was pretty amazing to see our Hyde Park\nneighbor take the oath for the Oval Office.\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_2265.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_2265_hua9a5dafb1aaf07f607575d3dc3cb1ac2_30020_700x0_resize_q75_box.jpg\" style=\"width:500px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nA solemn moment\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nNow for a first foray to the gym, and to start into work again.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/tourists/\"\u003eTourists\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/translation/\"\u003eTranslation\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003c/main\u003e",
  "Date": "2009-01-22T00:00:00Z",
  "Author": "John Jacobsen"
}