{
  "Source": "johnj.com",
  "Title": "Reflections on a Year of Daily Memory Drawings",
  "Link": "http://johnj.com/posts/daily-composition-lessons-learned/",
  "Content": "\u003cmain class=\"content\"\u003e\n\n\n\u003ch1\u003eReflections on a Year of Daily Memory Drawings\u003c/h1\u003e\n\n\n\u003cp\u003e\n\n\u003ca class=\"tag\" href=\"/tags/art\"\u003e\u003cspan class=\"art-tag\"\u003eart\u003c/span\u003e\u003c/a\u003e\n\n  ..... \u003cem\u003e\u003ctime class=\"postdate\" datetime=\"2017-09-18T00:00:00Z\"\u003e\n      September 18, 2017\n    \u003c/time\u003e\u003c/em\u003e\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/learning-muscular-anatomy/\"\u003eLearning Muscular Anatomy\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/repainting/\"\u003eRepainting\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\n\u003c/p\u003e\u003cdiv id=\"outline-container-headline-1\" class=\"outline-2\"\u003e\n\u003ch2 id=\"headline-1\"\u003e\n365 Drawings\n\u003c/h2\u003e\n\u003cdiv id=\"outline-text-headline-1\" class=\"outline-text-2\"\u003e\n\u003cp\u003e\nThe sketchbooks shown below are the result of doing one drawing from\nmemory every day for a year, a project I finished this month.\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_2934.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_2934_hufe5377f7dbdafeceb84531e72f204757_632148_700x0_resize_q75_box.jpg\" style=\"width:500px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nA year\u0026#39;s worth of Daily Compositions\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nThis drawing practice was based on the Daily Composition, which, as I\n\u003ca href=\"./daily-memory-drawing.html\"\u003eexplained\u003c/a\u003e last January, is an exercise from \u003cem\u003eThe Natural Way to Draw\u003c/em\u003e,\nby \u003ca href=\"https://en.wikipedia.org/wiki/Kimon_Nicola%25C3%25AFdes\"\u003eKimon Nicolaïdes\u003c/a\u003e (published posthumously in 1941).  The\nrequirements for this exercise are as follows:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003e\u003cem\u003eSee\u003c/em\u003e things and events that interest you throughout the day;\u003c/li\u003e\n\u003cli\u003e\u003cem\u003eRemember\u003c/em\u003e them, and\u003c/li\u003e\n\u003cli\u003e\u003cem\u003eCapture\u003c/em\u003e them on paper, in the form of a single image …\u003c/li\u003e\n\u003cli\u003e… \u003cem\u003eOnce per day\u003c/em\u003e.\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eEach of these is challenging in its own way, and each reinforces the\nother.  Maintaining the practice over a full year taught me a number\nof lessons.\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_20170917_0014-online.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_20170917_0014-online_huc9303298c96158595eef802625babfcd_249209_700x0_resize_q75_box.jpg\" style=\"width:600px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nExample drawing: 54th and Cornell\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cdiv id=\"outline-container-headline-2\" class=\"outline-3\"\u003e\n\u003ch3 id=\"headline-2\"\u003e\nLesson 1: The limits of visual memory\n\u003c/h3\u003e\n\u003cdiv id=\"outline-text-headline-2\" class=\"outline-text-3\"\u003e\n\u003cp\u003e\nI’d struggled with this exercise now and again over the years, and in\ntaking it up again I was immediately reminded just how little I\nremember of what I see throughout the day.\u003c/p\u003e\n\u003cp\u003e\nThe mind is able to recognize, and, to a greater or lesser extent, to\nrespond mentally and emotionally to a stunning variety of objects and\noccurrences in the world around us. This happens automatically and\nwithout effort. But this sort of ordinary seeing is not the same as\nbeing able to \u003cem\u003erecall\u003c/em\u003e and to visually \u003cem\u003ereproduce\u003c/em\u003e the things we\n\u0026#34;see.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\nTo demonstrate this to yourself, try to draw your spouse\u0026#39;s face, or a\nfriend\u0026#39;s, from memory. This is a person you would have no trouble\nrecognizing, even at some distance, yet you don\u0026#39;t really have access\nto how your brain stores that information. Now try to draw your car,\nor bicycle, or the front of your building. These are things you know\nwell, yet you probably cannot describe them visually in much detail.\u003c/p\u003e\n\u003cp\u003e\nDoing this exercise faithfully made this fact painfully obvious.  Each\nday, out of the millions of details that passed in front of my eyes, I\nwas left grasping only a handful of facts to work with at day\u0026#39;s end.\n(The number of memories was small, but I was surprised that it was\nnever zero.)\u003c/p\u003e\n\u003cp\u003e\nContrast this with the capabilities of a camera: it faithfully records\nthe details it is exposed to, millions of bits of data per shot. But\nthe camera, a mere machine, cannot recognize or react emotionally to\nthose details\u003csup class=\"footnote-reference\"\u003e\u003ca id=\"footnote-reference-1\" href=\"#footnote-1\"\u003e1\u003c/a\u003e\u003c/sup\u003e.\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_20170917_0004-online.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_20170917_0004-online_hu0ea7af58a6da6cea570eff02d354b584_247259_700x0_resize_q75_box.jpg\" style=\"width:600px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nAdams St. Bridge\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003cdiv id=\"outline-container-headline-3\" class=\"outline-3\"\u003e\n\u003ch3 id=\"headline-3\"\u003e\nLesson 2: Trying to remember amplifies seeing\n\u003c/h3\u003e\n\u003cdiv id=\"outline-text-headline-3\" class=\"outline-text-3\"\u003e\n\u003cp\u003e\nIt would be easy to think of the Daily Composition exercise as a way\nof learning how to do a camera\u0026#39;s job: you are exposed to scenes, and\nlater you record them on paper.  I did find myself, in fact, taking\nmental \u0026#34;pictures\u0026#34; most days, of a person or group doing something, in\nsome specific place.  I would see a person getting into a cab, or\nconstruction workers huddled over a hole, or (one day) a unicycle\nrider cresting a small hill, and I would think, \u0026#34;that\u0026#39;s it!\u0026#34; and try\nto remember, for that evening\u0026#39;s drawing, everything I could about the\nmoment I\u0026#39;d just seen.\u003c/p\u003e\n\u003cp\u003e\nDuring the course of the year, I didn\u0026#39;t actually get that much better\nin terms of the sheer number of details I could recall.  A half dozen\n\u0026#34;facts\u0026#34; (the size and shape of a doorway; the size and number of\nwindows in a storefront; the particular shape of a woman\u0026#39;s boots),\nalong with a rough gesture for and/or placement of the key figures,\nwere about as I could expect for any given day\u0026#39;s drawing.\u003c/p\u003e\n\u003cp\u003e\nA much bigger change occurred in my ability to \u003cem\u003enotice\u003c/em\u003e things, and my\nemotional response to them was amplified. Knowing that I needed\nmaterial for a drawing at the end of the day simply opened my eyes\nmore. It was like going on vacation somewhere totally new. I saw\nthings in my neighborhood, and on my commute, that I had passed by\nwithout noticing for years: the shapes and placement of signs, light\npoles, fire hydrants; the construction and weathering of steel\nsupports for elevated trains; the multitudes of ornamental details on\nbuildings. The endless variety of people\u0026#39;s faces… commuters,\nshopkeepers, construction workers, homeless men and women; the smiles,\ngrim stares (especially at commute times) or lines of care they bore;\ntheir postures and gestures (all too often, in relationship to their\nphones); the cut and fit of their clothing, coats, boots or shoes.\nThe endless repetitive movements of pigeons, and the surprising\nvariety of other birds (sparrows, hawks, cranes, herons, geese, ducks,\nswallows, and several migratory bird species I couldn\u0026#39;t identify).\nThe printed word, in steel or brass relief, to be seen everywhere in\nstreets and sidewalks, indicating lines of survey, or the origin or\nbuilders of utility covers or nearby buildings. All the endless\nvarieties of trees, contours of trunks, branching patterns, leaves,\nand all the grasses, flowers and weeds of the city… these things\ncame to my notice, were revealed fresh as though I had previously had\nsome sort of screen over my vision that had fallen away.\u003c/p\u003e\n\u003cp\u003e\nPart of \u003cem\u003eseeing\u003c/em\u003e these things became \u003cem\u003ecaring\u003c/em\u003e about them.  In that regard I\nbecame less, not more, like a camera.\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_20170917_0015-online.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_20170917_0015-online_hu682857db438bcaf09b607d766107e340_297220_700x0_resize_q75_box.jpg\" style=\"width:600px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nPromontory Point\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003cdiv id=\"outline-container-headline-4\" class=\"outline-3\"\u003e\n\u003ch3 id=\"headline-4\"\u003e\nLesson 3: Emotion aids recall\n\u003c/h3\u003e\n\u003cdiv id=\"outline-text-headline-4\" class=\"outline-text-3\"\u003e\n\u003cp\u003e\nIf I saw something I reacted to emotionally, it was usually a lot\neasier to recall later. This seems obvious, but to live the connection\nbetween emotion and memory as part of one\u0026#39;s daily routine for a year\nhad a cumulative effect.  This is what I meant when I said in my \u003ca href=\"./daily-memory-drawing.html\"\u003elast\npost\u003c/a\u003e that I felt a stronger connection to Chicago and my surroundings.\nI suspect that building these sorts of connections to daily life is\none of the main reason Nicolaïdes recommends the exercise as a daily\npractice.\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_20170917_0020-online.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_20170917_0020-online_hua377789cf694d236b6d7d4734ce9485b_188240_700x0_resize_q75_box.jpg\" style=\"width:600px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nSouth Loop Mural and Smoker\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003cdiv id=\"outline-container-headline-5\" class=\"outline-3\"\u003e\n\u003ch3 id=\"headline-5\"\u003e\nLesson 4: Other tricks for remembering\n\u003c/h3\u003e\n\u003cdiv id=\"outline-text-headline-5\" class=\"outline-text-3\"\u003e\n\u003cp\u003e\nAside from focusing on things that give an emotional charge, here are\nsome more tricks I used to remember things I saw:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003e\u003cstrong\u003ePractice drawing or painting something while you look at it.\u003c/strong\u003e This\nincludes making movements in the air as if you were drawing,\nbuilding a little actual muscle memory (and inviting curious\nglances from passersby).\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eRe-remember things\u003c/strong\u003e. If I saw something I wanted to \u0026#34;save up\u0026#34; for\nthe evening\u0026#39;s drawing, then whenever I saw something \u003cem\u003eelse\u003c/em\u003e that\nlooked interesting, I would look carefully at it, but then I would\nuse the whole noticing-something-noteworthy experience as a\nreminder to remember the \u003cem\u003eother\u003c/em\u003e thing I was trying to remember\nalso.  In other words, every new thing I noticed became a reminder\nto remember the other thing.  Occasionally, I would build a list of\nthings to remember and would then go through the list items\none-by-one whenever this occurred.\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eDe-distract and focus.\u003c/strong\u003e Of course, sometimes the above tricks got\nto be too much; at those times, I\u0026#39;d try to minimize my visual input\nby looking down at the sidewalk if safe to do so (allowing my\nperipheral vision or looking up when needed, in order to keep from\ngetting hit by buses, etc.), just making the effort to hold the\nmemories in my mind while I walked or ran.\u003c/li\u003e\n\u003c/ol\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_20170917_0030-online.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_20170917_0030-online_hu42afeab8f327e1cefe45e7f82cc91fb3_206907_700x0_resize_q75_box.jpg\" style=\"width:600px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nWeed whacking on the Lakefront\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003cdiv id=\"outline-container-headline-6\" class=\"outline-3\"\u003e\n\u003ch3 id=\"headline-6\"\u003e\nLesson 5: Invention and knowledge help fill in details\n\u003c/h3\u003e\n\u003cdiv id=\"outline-text-headline-6\" class=\"outline-text-3\"\u003e\n\u003cp\u003e\nGiven a relative paucity of remembered facts, how do you complete your\ndrawing? Just as our mind fills in details about what we see without\nour being consciously aware of it, one can invent the elements of a\nscene that elude our grasp when we try to recall them.  For this, a\nknowledge of perspective, of human anatomy and clothing, of the\nconstruction of builings and plants and trees, and especially of light\nand shadow are indispensible for adding extra life and believability to\na composition, no matter how quickly executed.  For example, I would\nrarely remember a \u003cem\u003especific\u003c/em\u003e shadow, but if I knew where I was and\nwhat time it was, I could place the shadows based on where the sun\nwould have been at the time. Used skillfully, invention can also \u003cem\u003eamplify\u003c/em\u003e\nwhatever emotional response led one to record the scene in one\u0026#39;s mind\nto begin with.\u003c/p\u003e\n\u003cp\u003e\nI think I got slightly better at \u0026#34;filling in the gaps\u0026#34; this way over\nthe year.  The exercise does seem to strengthen the connection\nbetween memory, knowledge, and imagination.\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_20170917_0032-online.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_20170917_0032-online_hu38bea71914962e890f2b451e88c0013d_264489_700x0_resize_q75_box.jpg\" style=\"width:600px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nDearborn subway entrance\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003cdiv id=\"outline-container-headline-7\" class=\"outline-3\"\u003e\n\u003ch3 id=\"headline-7\"\u003e\nLesson 6: Drawing can distort memory; revisiting a place helps\n\u003c/h3\u003e\n\u003cdiv id=\"outline-text-headline-7\" class=\"outline-text-3\"\u003e\n\u003cp\u003e\nI often noticed that, after drawing something that occurred in a\nspecific place, my memory would be strongly affected by whatever\ninventions (or mistakes) I came up with to compensate for my ignorance\nof the drawing\u0026#39;s setting.  For this reason, I sometimes disliked\nlooking at the drawings after the fact because they were so clearly\nwrong and they interfered with my \u0026#34;real\u0026#34; memory of where the event\noccurred.  An easy remedy for this was just to go back to the place in\nquestion and look around. One sees many more details the second time\naround, and it\u0026#39;s always amusing and humbling to realize how wrong you\ngot it the first time.\u003c/p\u003e\n\u003cp\u003e\nOn a related note, I find that taking and reviewing photographs\nshapes my memory as well. I remember things differently, and more\nemotionally, having drawn them, either from life or from memory, than\nI do when I\u0026#39;ve photographed them.  I sometimes limit my photography\nwhen I travel for this reason (although I still take a ton of\npictures).\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_20170917_0006-online.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_20170917_0006-online_hu8b6c5177a1ff645c7dbab9abe35fcc3c_263531_700x0_resize_q75_box.jpg\" style=\"width:600px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nNorth Avenue Apple Store\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003cdiv id=\"outline-container-headline-8\" class=\"outline-3\"\u003e\n\u003ch3 id=\"headline-8\"\u003e\nLesson 7: Don\u0026#39;t make it a big deal\n\u003c/h3\u003e\n\u003cdiv id=\"outline-text-headline-8\" class=\"outline-text-3\"\u003e\n\u003cp\u003e\nTo do the exercise three hundred and sixty five days in a row did\nrequire commitment, since I have a busy schedule and was generally\ndoing it at the end of the day when my \u003ca href=\"http://www.webmd.com/diet/features/willpower-facts#1\"\u003ewillpower budget\u003c/a\u003e and my ability\nto focus were all but spent.\u003c/p\u003e\n\u003cp\u003e\nNicolaïdes makes a point of not making a big deal of these drawings,\nsetting a fifteen minute time limit for each.  I broke this rule many\ntimes, especially at the beginning when I would try to recall as much\nas possible.  Eventually, however, I settled for just jotting down a\nfew things I remembered seeing (sometimes starting with just\nremembering where I was and what I did, which could be hard enough),\nand turning the most compelling memory into a small composition.  Even\non days when I was the most busy and distracted I could typically\nremember at least one thing to put down on paper.  And I found there\nwas only a loose correlation between how much effort I put into\nremembering things throughout any given day, and how much I liked the\ndrawing at the end of that day.  Some days I was excited about the\nresults, and some days I was just happy to put the drawing away\nafterward.  Part of what\u0026#39;s good about doing something like this is you\ncan fail over and over again, and your daily commitment to the\npractice means that any specific failure is no big deal.\u003csup class=\"footnote-reference\"\u003e\u003ca id=\"footnote-reference-2\" href=\"#footnote-2\"\u003e2\u003c/a\u003e\u003c/sup\u003e\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_20170917_0027-online.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_20170917_0027-online_hu65a14fda9bc1025f4372ab57161f87f4_260331_700x0_resize_q75_box.jpg\" style=\"width:600px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nCyclists kissing at The Point\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003cdiv id=\"outline-container-headline-9\" class=\"outline-3\"\u003e\n\u003ch3 id=\"headline-9\"\u003e\nLesson 8: More can be better\n\u003c/h3\u003e\n\u003cdiv id=\"outline-text-headline-9\" class=\"outline-text-3\"\u003e\n\u003cp\u003e\nAt least half the drawings are so bad, I find them pretty painful to\nlook at now.  Many of them show an interesting tidbit or idea worth\ndeveloping further.  And a small fraction, less than 10%, I enjoy\nlooking at and find appealing on their own terms. Some of these are\nshown here.\u003c/p\u003e\n\u003cp\u003e\nThe few successes illustrate an important rule that I still struggle\nwith: with art making, sometimes quantity wins.  I prefer to work for\na long time on paintings, but it is nice to complete something every\nday and, occasionally, to have it succeed.  No matter who you are, I\nsuspect if you make a drawing a day for a whole year, at least a few\nof them will suprise and please you.\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_20170917_0017-online.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_20170917_0017-online_hud1d9bdd2e932de8e899d4ade1a1cd75e_267478_700x0_resize_q75_box.jpg\" style=\"width:600px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nRandolph and Wabash\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003cdiv id=\"outline-container-headline-10\" class=\"outline-3\"\u003e\n\u003ch3 id=\"headline-10\"\u003e\nLesson 9: It\u0026#39;s about composition\n\u003c/h3\u003e\n\u003cdiv id=\"outline-text-headline-10\" class=\"outline-text-3\"\u003e\n\u003cp\u003e\nComposition is about choosing what goes in a picture and arranging\nthose things in a pleasing design which communicates one\u0026#39;s ideas or\nintentions.  One reason I took up this practice is that I find\ninventing compositions (e.g., in the studio) more challenging than\nfinding them directly in front of me.  Ultimately, memory and\nrendering are only part of the practice… the rest (perhaps the\nbiggest part) is design. Nearly four hundred drawings later I still\nfind it challenging, but solving a specific design problem every night\nhas made the whole problem of composition seem tractable in a way it\ndidn\u0026#39;t before.  This, I imagine, was another reason Nicolaïdes\nemphasized this exercise.\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_20170917_0008-online.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_20170917_0008-online_hua1052284a89d87368cd75d1203381277_313242_700x0_resize_q75_box.jpg\" style=\"width:600px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nPlanting Bulbs\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003cdiv id=\"outline-container-headline-11\" class=\"outline-2\"\u003e\n\u003ch2 id=\"headline-11\"\u003e\nMoving forward\n\u003c/h2\u003e\n\u003cdiv id=\"outline-text-headline-11\" class=\"outline-text-2\"\u003e\n\u003cblockquote\u003e\n\u003cp\u003eIt will be helpful if you keep this up for a year, and it will be\ntwice as helpful if you keep it up for two years. The really serious\nstudent will make a quick composition every day for the rest of his\nlife despite everything else he has to do. –Nicolaïdes\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003e\nIn later chapters of \u003cem\u003eThe Natural Way to Draw\u003c/em\u003e, variations on the\nDaily Composition are introduced, including a greater amount of\ninvention, and revisiting the same scene over several days in an\nextended composition.  For myself, I wanted the challenge of working\nprimarily from memory for a year, but have increasingly been craving\nmore time for both invention and for working from life. I intend to\ncontinue regular compositional practice, but more as a natural and\nplayful part of my creative rhythm, rather than as a tightly-defined\ndaily practice.  I don\u0026#39;t know where it will lead, but look forward to\nfinding out.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003cdiv id=\"outline-container-headline-12\" class=\"outline-2\"\u003e\n\u003ch2 id=\"headline-12\"\u003e\nMore Drawings\n\u003c/h2\u003e\n\u003cdiv id=\"outline-text-headline-12\" class=\"outline-text-2\"\u003e\n\u003cp\u003e\nHere are a few more drawings from the year.\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_20170917_0018-online.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_20170917_0018-online_hu7b8635e57b479d7f03d123778c4fd914_339149_700x0_resize_q75_box.jpg\" style=\"width:600px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nShambhala Center\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_20170917_0002-online.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_20170917_0002-online_hu3f64f42db65d063fe6960ff31007dffc_716727_700x0_resize_q75_box.jpg\" style=\"width:600px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\n54th and Cornell\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_20170917_0011-online.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_20170917_0011-online_hu2fc0759ea477e4946ac5db05f07128f5_265696_700x0_resize_q75_box.jpg\" style=\"width:600px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nVan Buren\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_20170917_0031-online.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_20170917_0031-online_hu7ff407efd7aaa2ff18c44a119c7ea327_637293_700x0_resize_q75_box.jpg\" style=\"width:600px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nTruck, alley off Van Buren\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_20170917_0022-online.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_20170917_0022-online_huf6f0d4c00749c383d9e38f290089510b_279977_700x0_resize_q75_box.jpg\" style=\"width:600px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nMarch for Science, Columbus Drive\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_20170917_0023-online.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_20170917_0023-online_huccf234a873cf42e1419f6be69221cb30_207413_700x0_resize_q75_box.jpg\" style=\"width:600px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nHipster cyclist crossing Metra tracks\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_20170917_0025-online.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_20170917_0025-online_hud04377e51e2552e826b99cd6e544e07a_339562_700x0_resize_q75_box.jpg\" style=\"width:600px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nStephen Assael class demo\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_20170917_0034-online.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_20170917_0034-online_hu59df6a04ab4cd534495cd048ce477733_259801_700x0_resize_q75_box.jpg\" style=\"width:600px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nPrinters\u0026#39; Row Book Fair\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_20170917_0012-online.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_20170917_0012-online_hu9b91e6e1e54133ec4db00b32003996ce_304307_700x0_resize_q75_box.jpg\" style=\"width:600px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\n55th St.\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_20170917_0013-online.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_20170917_0013-online_hub01a0514650a2525d2da66cc4a53b1f7_360742_700x0_resize_q75_box.jpg\" style=\"width:600px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nCement mixer, Lake Shore Drive under McCormick Place\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_20170917_0016-online.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_20170917_0016-online_hu6dfca6bd0eb3b77c64116df39d090ea5_306983_700x0_resize_q75_box.jpg\" style=\"width:600px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\n63rd St. Beach\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_20170917_0033-online.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_20170917_0033-online_hued97d59014c69ae99db0691bd9c072d5_311524_700x0_resize_q75_box.jpg\" style=\"width:600px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nChecking phone, near Oak St.\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003cdiv class=\"footnotes\"\u003e\n\u003chr class=\"footnotes-separatator\"/\u003e\n\u003cdiv class=\"footnote-definitions\"\u003e\n\u003cdiv class=\"footnote-definition\"\u003e\n\u003csup id=\"footnote-1\"\u003e\u003ca href=\"#footnote-reference-1\"\u003e1\u003c/a\u003e\u003c/sup\u003e\n\u003cdiv class=\"footnote-body\"\u003e\n\u003cp\u003eSome machine learning systems have gotten pretty good at recognizing specific objects in a digital image; thankfully, none of these has emotions yet.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003cdiv class=\"footnote-definition\"\u003e\n\u003csup id=\"footnote-2\"\u003e\u003ca href=\"#footnote-reference-2\"\u003e2\u003c/a\u003e\u003c/sup\u003e\n\u003cdiv class=\"footnote-body\"\u003e\n\u003cp\u003eThe ability to fail and to start anew, over and over again, is the most important creative skill that I know of.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/learning-muscular-anatomy/\"\u003eLearning Muscular Anatomy\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/repainting/\"\u003eRepainting\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003c/main\u003e",
  "Date": "2017-09-18T00:00:00Z",
  "Author": "John Jacobsen"
}