{
  "Source": "johnj.com",
  "Title": "The Quiet Earth",
  "Link": "http://johnj.com/posts/the-quiet-earth/",
  "Content": "\u003cmain class=\"content\"\u003e\n\n\n\u003ch1\u003eThe Quiet Earth\u003c/h1\u003e\n\n\n\u003cp\u003e\n\n\u003ca class=\"tag\" href=\"/tags/southpole\"\u003e\u003cspan class=\"southpole-tag\"\u003esouthpole\u003c/span\u003e\u003c/a\u003e\n\n  ..... \u003cem\u003e\u003ctime class=\"postdate\" datetime=\"2011-11-07T18:21:00Z\"\u003e\n      November 7, 2011\n    \u003c/time\u003e\u003c/em\u003e\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/a-nicer-guy/\"\u003eA Nicer Guy?\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/ten/\"\u003eTen\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003cp\u003e\n2011/11/8 05:01 AM NZDT Christchurch\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/6322623589_0fe8dbf022_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/6322623589_0fe8dbf022_o_hu5058c539f4a6667c6363172af274bc5f_1870452_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nSpring in Christchurch\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nWoke up a few minutes ago and started thinking about a blog post. I\nwould have happily slept more but my body tells me that’s not going to\nhappen. It’s quiet here, with the only sound the faint snoring noises\ncoming from the next room over.\u003c/p\u003e\n\u003cp\u003e\nI’m at a hotel in an area of Christchurch called Papanui whose\ndistinguishing feature seems to be a shopping district with a mall and\na number of smaller stores and eateries. The shops include several\nAsian restaurants, a comic store, and a small model train store. It’s\nnot bad area, but it feels like it could be anywhere in New\nZealand. I’m a bit sad not to stay at the Devon B\u0026amp;B, not to hear the\ntrolleys rattle by every so often, not to wander down to the Arts\nCenter or stroll down to the shops near Cathedral Square.\u003c/p\u003e\n\u003cp\u003e\nAfter my arrival yesterday, I tried to get out see a bit of what could\nbe seen. There is a rail line nearby with a path alongside it leading\nto Hagley Park, which is close to the center of town near where I used\nto stay. I went for a run down this path, perhaps a few miles, until I\nreached the far side of the park. But I was out of water and energy,\nso I didn’t go further.\u003c/p\u003e\n\u003cp\u003e\nPerhaps I’ll make it farther today or some other time. But, truth be\ntold, I’m not sure I have the stomach to see it. When we arrived at\nthe airport yesterday, we were met by a young woman who briefed us on\nthe conditions here. She made sure we kept our emergency information\ncards on us at all times. She told me that, though she was from\nChristchurch, she had yet to get the nerve up to go downtown and look\naround. The cordon around the entire downtown area was apparently just\nopened up a week or two ago — she said that the area is mostly a\nwrite-off, with most buildings needing to be torn down and\nrebuilt. Most of the Christchurch I have come to know over the years\nis apparently gone. The newer parts around here seem mostly fine\n(aside from a few fenced-off buildings), but the main reception area\nof our hotel is closed off, with a rather lovely, elegantly-designed\nshipping container structure serving as temporary office.\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/6322621813_8bca136732_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/6322621813_8bca136732_o_hud1a3444e3b3d054b9afd142ef5a7c5c8_481313_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nIce People checking in at temporary reception container\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nThe young woman described what it was like when the big earthquake hit\non February 22. She said that, out by the airport, it was eerily\nsilent just after the big shakes stopped. I was reminded of the 1980’s\nNew Zealand film, \u003ca href=\"http:http://en.wikipedia.org/wiki/The_Quiet_Earth_(film)\"\u003eThe Quiet Earth\u003c/a\u003e, in which most of humanity is\nsuddenly spirited away. She said they could tell by the number and\nintensity of the sirens which gradually filled that silence that it\nwas very bad for the downtown area.\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/6323138550_b9ed8ea1d3_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/6323138550_b9ed8ea1d3_o_hu4070eb1a134faebf28d3f71781926bb3_789075_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nFenced-off buildings in Papanui\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nMy trip to Christchurch was pleasant. I asked for, and got, an exit\nrow window seat from Chicago to LAX. It even looked as though our\nrow’s middle seat would be empty (even more room!), but at the last\nminute a large, Middle Eastern man got on and sat there. As we taxied\nhe pulled out a small book in Arabic, which I guessed was the Koran\nuntil I noticed the picture of Jesus on the cover. We conversed a bit\nand he told me he was a Copt, Copts being Egyptian Christians who,\naccording to Wikipedia, were the dominant religion there before the\nMuslim conquest in the seventh century. He told me of recent\natrocities against Christians in Egypt by the majority Muslims, and\nsaid that despite the Arab Spring things were not good now in Egypt\nfor Christians; in fact, he had won the Green Card lottery in the\nStates and went back to Egypt to settle some affairs before moving to\nLA permanently. Nice guy.\u003c/p\u003e\n\u003cp\u003e\nAt LAX, I managed to recharge my laptop and iPhone batteries at a\ncharging station and get my boarding pass for the Qantas flight to\nAuckland. I asked if there was any choice of seats, and the guy at the\ngate said, “no, but I got you an aisle seat.” Fair enough, I thought,\nand went back to the charging station to do some work. When they\nstarted calling my flight, I looked at my boarding pass and did a\ndouble-take: they had upgraded me to Business Class! I was pretty\nexcited about this — the difference between Business and Economy for\nme is 1-2 hours of sleep versus 5-7 hours, due to the extra space and\nthe fact that Business seats recline almost fully. I marched right on\nthe plane and sat down in the first row of seats and was happily\nchatting on the phone and sipping orange juice in minutes. The flight\nwas very smooth; I really enjoyed the conversations with the guy next\nto me, a lawyer from New York, and managed to both catch some sleep\nand get some work done (there was a regular electrical power outlet\nunder my seat, another major bonus).\u003c/p\u003e\n\u003cp\u003e\nElectrical power and leg room are interesting to me; possibly less so\nto potential readers. What does one write during one’s tenth trip to\nthe South Pole? I have written a journal of sorts during most or all\nof my previous trips, usually some kind of blog. You can go back and\nread a lot of that writing on this site. What can I say that hasn’t\nalready been said?\u003c/p\u003e\n\u003cp\u003e\nOne answer that comes to mind is to work with difference — with what\nhas changed for me, or in external circumstances. Christchurch is\ncertainly different; we shall see how the Ice is different, if at\nall. And I am different… older, certainly. Wiser? Perhaps. I plan to\nexplore some of these external and internal changes in future posts.\u003c/p\u003e\n\u003cp\u003e\nIf you are interested in reading shorter updates (say, \u0026lt; 140\ncharacters), I’ll be posting those to \u003ca href=\"https://twitter.com/eigenhombre\"\u003emy Twitter feed\u003c/a\u003e. And, as I did\nin January, I’m \u003ca href=\"http://flickr.com/eigenhombre\"\u003eposting the pictures to Flickr\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\nHotel fire alarm just went off. False alarm, but so much for the Quiet\nEarth. Time to hunt down some breakfast. We get our cold-weather gear\nat 1 PM.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/a-nicer-guy/\"\u003eA Nicer Guy?\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/ten/\"\u003eTen\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003c/main\u003e",
  "Date": "2011-11-07T18:21:00Z",
  "Author": "John Jacobsen"
}