{
  "Source": "johnj.com",
  "Title": "Closure",
  "Link": "http://johnj.com/posts/closure/",
  "Content": "\u003cmain class=\"content\"\u003e\n\n\n\u003ch1\u003eClosure\u003c/h1\u003e\n\n\n\u003cp\u003e\n\n\u003ca class=\"tag\" href=\"/tags/southpole\"\u003e\u003cspan class=\"southpole-tag\"\u003esouthpole\u003c/span\u003e\u003c/a\u003e\n\n  ..... \u003cem\u003e\u003ctime class=\"postdate\" datetime=\"2011-01-25T05:22:00Z\"\u003e\n      January 25, 2011\n    \u003c/time\u003e\u003c/em\u003e\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/in-defense-of-hobbies/\"\u003eIn Defense of Hobbies\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/takeoff/\"\u003eTakeoff\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/5408573430_8b09b037b9_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/5408573430_8b09b037b9_o_hu8396f6acf4047a9131941946b7dc76d3_283055_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\u003c/p\u003e\n\u003cp\u003e\nOnce again on the train bound for Picton, to catch the Interislander\nferry to Wellington. I think this will be my last post for this trip,\nso I may try to sum up a few things. First and foremost I want to\nthank those of you who read along with me; knowing that there were at\nleast a couple of regular readers made the writing more enjoyable, and\nhelped keep me to the daily discipline of posting something, which in\nturn helped establish a sort of rhythm for the trip.\u003c/p\u003e\n\u003cp\u003e\nI have called this my last trip to the South Pole and have tried to\ntreat it that way. Helping to hunt for neutrinos in Antarctica has\nperhaps been my life’s biggest adventure, and it certainly is\nbittersweet to say goodbye to it these past few days, thinking of each\nstep of my northbound journey as the last repetition of a pattern\nestablished over years. Of course it is a fact that as long as life\ncontinues one doesn’t know where one will wind up — just as one never\nknows if the time one spends with a friend will be the last time or\nnot (and, in fact, every time is unique, never to be repeated, whether\nyou notice or not), I can’t say for certain whether or not I will ever\ngo back to the Pole. There will be other projects on the Ice and I\ncould see myself involved with those. Also, IceCube will hopefully run\nanother 15-20 years and they will be sending people every year, and\nwhile I’m not sure I’ll be needed on the Ice I certainly wouldn’t rule\nout helping if asked. But with the completion of IceCube’s\nconstruction and the diminished likelihood of further trips, it seems\nappropriate to let the place go in my mind. I feel that this is a time\nin my life to start to let go of certain things, to let things fall\naway and see what takes their place.\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003eI remembered a sentence from Rudolf Steiner, … that when something\nends, we must think that something begins. His advice is salutary, but\nthe execution difficult, for we only know what we have lost, not what\nwe will gain. We have a very precise image — an image at times\nshameless — of what we have lost, but we are ignorant of what may\nfollow or replace it. — Jorge Luis Borges, \u003cem\u003eSeven Nights\u003c/em\u003e\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003e\nI wrote previously of success or Fruition, and tried to give a sense\nof the excitement of putting a capstone on a body of work, related not\njust to this two-week trip but to a decade or even half a lifetime of\nwork. Now I want to think for a moment about more mundane challenges\nof the trip.\u003c/p\u003e\n\u003cp\u003e\nTowards the end of last year I got onto a sort of minimalism kick,\nreading books and blogs on living simply and thinking about what sorts\nof things I could give away or live without. The idea of paring down,\neliminating distractions and noise, multitasking less, and focusing\nmore on what matters, appeals lately. Of course traveling always helps\nto encourage a certain minimalism. Going to the actual Ends of the\nEarth, living out of two bags in a room no wider than my wingspan and\nnot a lot longer, living with four minutes of shower time a week, not\nhaving to (or being able to) cook for myself, having no Internet for\nmost of the day … this level of enforced minimalism is something I\nhave enjoyed in the past, but it seemed this time to throw into relief\nthe three choices available at any given time. These were: to distract\nmyself with work (for there was always more work to do, always someone\nto help or a question to answer or a test to run, even before\nconsidering the ever-present backlog of pending software fixes and\nupgrades); to distract myself with play (movies, books, socializing,\nblogging, photography, games, …) or, often less appealing, to just\nstop and be where I was: at the Pole; short of sleep; too hot or too\ncold; irritated by all the noise; worried about this or that; chapped\nor bleeding in various places because of the dryness; bad hair;\nmissing fresh fruit and veggies; and generally being out of sorts at\nthe Bottom of the World.\u003c/p\u003e\n\u003cp\u003e\n“This year I would like to set one goal, which is to be as fully awake\nand alert to the entire experience as I can.” Though there vivid and\njoyful moments, many of which involved stopping and just looking out\nat the lovely white waste, or moments of fellowship with colleagues, a\nshared laugh or the ordinary pleasure of lining up for food in the\nGalley, being awake often meant taking stock of just how uncomfortable\nI was and how I was searching for the next distraction. Having “awake”\nas a goal meant bumping against that over and over again, and\nconfronting my resistance to whatever was going on. Perhaps by\noccasionally noticing, I wore a small nub off of that great ball of\nresistance.\u003c/p\u003e\n\u003cp\u003e\nMy Antarctica has been:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThe first acid bite of wind on my face after getting out of the\nplane after the flight to the South Pole\u003c/li\u003e\n\u003cli\u003eThe smell of SimpleGreen™ used to mop the floors and clean the\nwaterless urinals\u003c/li\u003e\n\u003cli\u003eWorkouts in various gyms in the old and new stations\u003c/li\u003e\n\u003cli\u003eThe hisses and rumbles of a hundred invisible machines inside and\noutside — heaters, generators, snow tractors, skidoos, Hercs\u003c/li\u003e\n\u003cli\u003eThe metallic crunch of half-ton doors closing, and steps on metal\nstairs\u003c/li\u003e\n\u003cli\u003eStash tea: licorice spice\u003c/li\u003e\n\u003cli\u003eThe sound of the flags flapping from the platform above Destination\nAlpha\u003c/li\u003e\n\u003cli\u003eHaving noisy neighbors, and (probably) being one\u003c/li\u003e\n\u003cli\u003eCarrying a radio instead of a cell phone\u003c/li\u003e\n\u003cli\u003eMusic: David Bowie, “Outside” (1998); Soundtrack to “Pi” (2000);\nKris’s 7-CD mix (2009); the fellow playing guitar down by the gym\n(2011).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e“Everybody has his own Antarctica.” —Thomas Pynchon, \u003cem\u003eV\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\nI say goodbye to mine.\u003c/p\u003e\n\u003cp\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/5407966865_cdca1db8c6_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/5407966865_cdca1db8c6_o_hua0165a735ee83dc6ed3029f48e923de9_279543_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\u003c/p\u003e\n\u003cp\u003e\nThanks again for reading. I plan to keep \u003ca href=\"http://flickr.com/eigenhombre\"\u003eposting pictures\u003c/a\u003e for awhile\nsince I haven’t gone through all 2500 of them and because I’m still\ntaking a lot here in New Zealand.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/in-defense-of-hobbies/\"\u003eIn Defense of Hobbies\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/takeoff/\"\u003eTakeoff\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003c/main\u003e",
  "Date": "2011-01-25T05:22:00Z",
  "Author": "John Jacobsen"
}