{
  "Source": "johnj.com",
  "Title": "Plein Air",
  "Link": "http://johnj.com/posts/plein-air/",
  "Content": "\u003cmain class=\"content\"\u003e\n\n\n\u003ch1\u003ePlein Air\u003c/h1\u003e\n\n\n\u003cp\u003e\n\n\u003ca class=\"tag\" href=\"/tags/art\"\u003e\u003cspan class=\"art-tag\"\u003eart\u003c/span\u003e\u003c/a\u003e\n\n  ..... \u003cem\u003e\u003ctime class=\"postdate\" datetime=\"2011-08-27T00:00:00Z\"\u003e\n      August 27, 2011\n    \u003c/time\u003e\u003c/em\u003e\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/the-wheel/\"\u003eThe Wheel\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/iso50/\"\u003eISO50\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_6596_2.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_6596_2_hu7524170da94cf89695026846642744f4_109477_700x0_resize_q75_box.jpg\" style=\"width:400px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nToday’s painting — Town Line Road at OO, oil on panel, 8“x10”\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nI’ve had a week off and have been painting outside, at my mom’s house\nout in the country near Chippewa Falls, Wisconsin. The investment\nwhich has made this possible is called a \u003ca href=\"http://linesandcolors.com/2008/08/17/pochade-boxes/\"\u003epochade box\u003c/a\u003e which is\nessentially a small portable easel which fits on a tripod. The one I\ngot is called the Prochade by \u003ca href=\"http://www.artworkessentials.com/Index.htm\"\u003eArtwork Essentials\u003c/a\u003e. So far I’m pretty\nhappy with it, and slightly amazed and bemused at how fun it is to\nuse.\u003c/p\u003e\n\u003cp\u003e\nI’ve had a lot of resistance to painting outside over the years. The\nfew times I’ve done it have been enjoyable, but something about the\nbugs, the cold, the heat, the sun, the rain, the lightning, the\ntornadoes, the spectators, earthquakes, muggers, cosmic rays, etc. has\nkept me from doing much of it. And my passion has always been\nsurrealism, fantasy \u0026amp; sci fi, nudes, painting from imagination, the\ndarker architecture of private spaces. Many of my favorite artists\nalso work this way, and I don’t think I met anyone in art school who\npainted from life outdoors (or who admitted to doing so) … painting\noutside seemed almost corny, a Sunday painter’s habit.\u003c/p\u003e\n\u003cp\u003e\nLately, however, I’ve been interested in getting out there and working\nfrom nature. Possibly some of that interest is thanks to blogs like\n\u003ca href=\"http://gurneyjourney.blogspot.com/\"\u003eJames Gurney’s\u003c/a\u003e. Gurney interests me because he is an artist of the\nfantastic (see his Sci Fi book covers or the Dinotopia series), but is\nalso an avid plein-air painter, which very much informs his fantastic\nwork. (He even goes so far as to build sculptures or \u0026#39;maquettes’ of\nhis characters so as to be able to see and paint the real, natural\nlight on them.)\u003c/p\u003e\n\u003cp\u003e\nI’m also interested in making some slower, visual contact with the\nreal world, and perhaps ever so slightly less interested in aesthetic\nnavel-gazing (though I’m still very interested in painting imaginary\nworlds).\u003c/p\u003e\n\u003cp\u003e\nUsually I paint sitting down at my easel in the studio, with a\ncomputer, music, food, etc. all close at hand. I never liked painting\nstanding up in the studio; but standing up alone outside for a few\nhours is surprisingly easy and pleasant. Also it is really nice to be\naway from computers for awhile (an iPod can be nice while painting\noutside, though being in the actual space with the crickets and the\nwind is part of the experience too).\u003c/p\u003e\n\u003cp\u003e\nThe French term for painting outdoors is “en plein air” — which could\nbe re-translated as “in the full air”. There is something pleasant and\n“airy” about just choosing a subject and painting it \u003cem\u003ealla prima\u003c/em\u003e — no\npreliminary sketches, no layers of glazes, photo transfers, reference\nmaterials, SketchUp studies or traumatic mid-stream adjustments of\ncontent — just walk up to the easel and make a painting! I finished\nthree paintings this week… my rate in the studio is sometimes less\nthan three per year. Plus the paintings themselves are more\nlightweight — things I could just destroy or give away as gifts rather\nthan agonize for months about whether they’re done, where to show\nthem, how much to charge for them, etc.\u003c/p\u003e\n\u003cp\u003e\nI love photography and take lots of photographs in addition to the\nstudio paintings. Painting with the pochade box combines some of the\nthings I love about both art forms — you scout your terrain and frame\nyour image (à la photography) and then bring all your gestural and\ncolor sensibilities to the material. You just do it, like clicking the\nshutter, except it takes a couple of hours rather than a couple of\nmilliseconds. In the end your \u0026#39;shot’ is juicy, oily, full of bugs,\nand, maybe, ready to hang on a friend’s wall for awhile. Nice and\neasy!\u003c/p\u003e\n\u003cp\u003e\nNext, maybe we’ll see how it goes painting around Chicago.\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/IMG_6584b.jpg\"\u003e\u003cimg class=\"resize\" src=\"/IMG_6584b_hu7177679839a51b584deb95a1b2978219_283681_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nPochade box in action\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/the-wheel/\"\u003eThe Wheel\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/iso50/\"\u003eISO50\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003c/main\u003e",
  "Date": "2011-08-27T00:00:00Z",
  "Author": "John Jacobsen"
}