{
  "Source": "johnj.com",
  "Title": "That's the Way",
  "Link": "http://johnj.com/posts/thats-the-way/",
  "Content": "\u003cmain class=\"content\"\u003e\n\n\n\u003ch1\u003eThat\u0026#39;s the Way\u003c/h1\u003e\n\n\n\u003cp\u003e\n\n\u003ca class=\"tag\" href=\"/tags/southpole\"\u003e\u003cspan class=\"southpole-tag\"\u003esouthpole\u003c/span\u003e\u003c/a\u003e\n\n  ..... \u003cem\u003e\u003ctime class=\"postdate\" datetime=\"2011-01-04T00:00:00Z\"\u003e\n      January 4, 2011\n    \u003c/time\u003e\u003c/em\u003e\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/red-eye-to-mcmurdo/\"\u003eRed Eye to McMurdo\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/faults-in-ice-and-rock/\"\u003eFaults in Ice and Rock\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003cp\u003e\nThursday, Jan. 13 2011 11:37 p.m. UTC\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/5353255138_42dd2961a0_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/5353255138_42dd2961a0_o_hubc065861949a90ca23d276e4051cabd7_679156_700x0_resize_q75_box.jpg\" style=\"width:400px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nARO, antenna, geographic pole marker, and pedestrian\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nSatellite is up in a few minutes so I’d better prepare today’s\npost. Been jonesing for a bath the last couple of days. Those 1-2\nminute showers every couple of days are getting old.\u003c/p\u003e\n\u003cp\u003e\nWe have a massive exodus of IceCube drillers leaving in a few minutes\n(all but one, 21 in all) on today’s passenger flight. Hopefully they\nwon’t get stuck in McMurdo — the C-17 from Christchurch has apparently\nboomeranged two days in a row due to weather in Mac Town. Or rather\ntwo nights in a row, since they are still doing night flights to\nMcMurdo. I feel bad for those people who have had to get up in the\nmiddle of the night several days in a row. Unfortunately I too will\nprobably have a night (or early morning) flight to Christchurch in a\nweek, unless the weather gets a lot colder.\u003c/p\u003e\n\u003cp\u003e\nI had planned originally to spend some posts explaining what IceCube\nwas and what exactly we’re doing. I guess I haven’t really done that\nyet. I apologize to any readers who haven’t already heard me babble at\nlength about neutrinos in person; this may seem to you like an even\nmore random and strange endeavor than it already is. A detailed\ndescription of our tasks here right now would probably be too\ntechnical anyways. But a simple explanation that might suffice for now\nis that we are testing the new equipment installed this year, both\ndeep in the ice (the final seven “strings” of light sensors, deployed\nabout a mile and a half below the surface), and the new computers in\nthe IceCube Lab on the surface, and, most crucially, getting\neverything to talk to each other and perform the initial checks that\neverything is working OK. After we leave, two winter-over scientists\nwill remain behind to run the experiment throughout the Austral\nWinter, supported by a scrum of experts in the North who will reach\ndown over the satellite, perform periodic calibrations and software\nupgrades, and generally help if/when things break from time to time.\u003c/p\u003e\n\u003cp\u003e\nI had expected to use some of my time here to beat down my backlog of\nfeatures to add and bugs to fix in my primary project (“IceCube Live,”\na server used to control the experiment and a Web site used to monitor\nit). I have done some of that, but in reality most of my time has been\nspent helping other people here… which, I suppose, is really how it\nshould be.\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/5352644941_b505277971_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/5352644941_b505277971_o_hu591ecf600c34759388d47fa86caaf1b3_689343_700x0_resize_q75_box.jpg\" style=\"width:500px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nEvening game of nine-ball\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/5352646105_794538b757_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/5352646105_794538b757_o_hu230262613a1b237e1ed5ea23bf39953d_941521_700x0_resize_q75_box.jpg\" style=\"width:500px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nEverybody\u0026#39;s at lunch\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nFavorite tunes/bands heard in the galley here:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eKruder and Dorfmeister’s K\u0026amp;D Sessions\u003c/li\u003e\n\u003cli\u003eTom Waits, intro song from “Down by Law”\u003c/li\u003e\n\u003cli\u003eLed Zeppelin, “That’s the Way”\u003c/li\u003e\n\u003cli\u003eSufjian Stephens, “Come On Feel the Illinois(e)” (I miss Chicago!\nNot to mention hot baths…….)\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/red-eye-to-mcmurdo/\"\u003eRed Eye to McMurdo\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/faults-in-ice-and-rock/\"\u003eFaults in Ice and Rock\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003c/main\u003e",
  "Date": "2011-01-04T00:00:00Z",
  "Author": "John Jacobsen"
}