{
  "Source": "johnj.com",
  "Title": "Giacometti",
  "Link": "http://johnj.com/posts/giacometti/",
  "Content": "\u003cmain class=\"content\"\u003e\n\n\n\u003ch1\u003eGiacometti\u003c/h1\u003e\n\n\n\u003cp\u003e\n\n\u003ca class=\"tag\" href=\"/tags/southpole\"\u003e\u003cspan class=\"southpole-tag\"\u003esouthpole\u003c/span\u003e\u003c/a\u003e\n\n  ..... \u003cem\u003e\u003ctime class=\"postdate\" datetime=\"2007-01-22T00:00:00Z\"\u003e\n      January 22, 2007\n    \u003c/time\u003e\u003c/em\u003e\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/descent/\"\u003eDescent\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/t-equals-zero/\"\u003et=0\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003cp\u003e\nJust got back from a tasty lunch at the Dux De Lux followed by a visit\nto the Christchurch Art Gallery, an attractive little museum a block\nfrom the Devon.\u003c/p\u003e\n\u003cp\u003e\nThey had a lovely show of Giacometti prints, drawings and\nsculptures. Giacometti and I share a birthday (Oct. 10) and he died\nthe year I was born (1966). His sculptures are haunting and\ndeceptively simple-looking - tall and thin figures standing rigidly\nerect, features all but obliterated in a field of surface\nvibration. But I found his drawings and prints even more\nattractive. Very simple subject matter again: a head, a chair, a small\ngroup of figures. But rendered loosely as spare lattices of visceral\nresponse to…. something, seen in the few models he employed over and\nover again (his mother, his brother, his wife, his mistress). Made me\nwant to make etchings again, and lithographs.\u003c/p\u003e\n\u003cp\u003e\nAlso a wonderful set of small rooms filled with drawings and paintings\nby the spookily gifted 19th c. New Zealand/Dutch artist Petrus Van Der\nVelden - in particular, a series of sketchbooks and studies for a\npainting called the Dutch Funeral. Gorgeous drawings à la Rembrandt or\ncertain 19th c. Russian artists like Ilya Repin, but moodier, darker,\nquieter, seemingly obsessed with beauty in death and suffering. Some\nof the sketches were tiny, no more than a couple of inches on a side,\nbrown pages taken from battered sketchbooks… haunting, inspiring,\nand very humbling.\u003c/p\u003e\n\u003cp\u003e\nTomorrow we have the day off; Wednesday we get our cold weather gear,\nand Thursday we fly to McMurdo.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/descent/\"\u003eDescent\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/t-equals-zero/\"\u003et=0\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003c/main\u003e",
  "Date": "2007-01-22T00:00:00Z",
  "Author": "John Jacobsen"
}