{
  "Source": "johnj.com",
  "Title": "Fresh Air and Bananas",
  "Link": "http://johnj.com/posts/fresh-air-and-bananas/",
  "Content": "\u003cmain class=\"content\"\u003e\n\n\n\u003ch1\u003eFresh Air and Bananas\u003c/h1\u003e\n\n\n\u003cp\u003e\n\n\u003ca class=\"tag\" href=\"/tags/southpole\"\u003e\u003cspan class=\"southpole-tag\"\u003esouthpole\u003c/span\u003e\u003c/a\u003e\n\n  ..... \u003cem\u003e\u003ctime class=\"postdate\" datetime=\"2011-11-20T00:00:00Z\"\u003e\n      November 20, 2011\n    \u003c/time\u003e\u003c/em\u003e\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/shower-instructions/\"\u003eShower Instructions\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/traveller-and-the-human-chain/\"\u003eTraveller and the Human Chain\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003cp\u003e\nNov. 20, 2011 12:49 NZDT B2 Science, Amundsen-Scott South Pole Station\u003c/p\u003e\n\u003cfigure\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/6365794001_05c4abce37_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/6365794001_05c4abce37_o_hue9f694653eca6cf436229611590c6abf_1017443_700x0_resize_q75_box.jpg\" style=\"width:700px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\n\u003cfigcaption\u003e\nPeek-a-boo with the Ceremonial Pole\n\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003e\nSunday here, so a light work day. Station has been pretty quiet all\nday. Slept a solid 8 hours, had a banana and oatmeal for breakfast,\nthen suited up and went out for a walk. It’s funny, yesterday morning\nI had a dream about bananas, and then the first bananas showed up\non-station. I’m eating one now (hi Dad!).\u003c/p\u003e\n\u003cp\u003e\nIf you don’t go outside you forget how amazing it is out there. You\nget to feeling like you are living on a cross between a cruise ship\n(comfy and isolated) and an aircraft carrier (not so comfy but still\nisolated). We are indeed floating on an ocean… a solid one. But the\nsolidity of the water doesn’t always make it easier to get out and\nabout, if you’re sleeping on station and your duties don’t take you\noutside.\u003c/p\u003e\n\u003cp\u003e\nGet out, though, and it’s another story. The air is cold, yes (100\ndegrees colder than inside the station) but it is fresher than any\nmost other air you could conceivably breathe — the cleanest air in the\nworld, they say. When you walk, the snow squeaks like styrofoam. It\nactually sounds hollow and had me wondering if it was at all possible\nto encounter crevasses at this part of the Polar Plateau. After\nseveral days of crystal-clear skies, there are a few clouds, doing\ntheir usual it’s-so-cold-and-flat-here-let’s-also-do-the-flat-thing\nthing. Nearby, the power plant belches a steam cloud the size and\nspeed of about one Graf Zeppelin flying away every ten seconds.\u003c/p\u003e\n\u003cp\u003e\nWent out to the Geographic and Ceremonial Poles just to say hi and\nlook around. I have been noticing that the horizon here is not\nstrictly flat — there is a slight rise between the end of the skiway\nand the Clean Air building, which is easy to see if you look for it\nfrom the Galley, and still noticeable from the Pole markers. What\npasses for terrain is a barely visible inflection of an otherwise\nperfect horizon.\u003c/p\u003e\n\u003cp\u003e\nWent to the gym and did some stretching, sat, and just got back from\nbrunch. In short, between some fresh fruit, a couple of good night’s\nsleep, and a stroll, I’m in better spirits today. I know that getting\noutside is part of it and so I moved all my ECW gear to the coat room\nnear Destination Zulu so I don’t have to drag it out of my room every\ntime I feel like a stroll. I don’t think I want to do a lot of running\noutside (my co-worker Carlos regularly does 10k or more out on the\nskiway—he just passed in front of the window in front of my desk mere\nseconds ago, covered in frost), but will make more time for walks, and\ncontinue my runs on the treadmill.\u003c/p\u003e\n\u003cp\u003e\n\n\n\n\n\n\u003ca href=\"http://johnj.com/6365788621_7a24685660_o.jpg\"\u003e\u003cimg class=\"resize\" src=\"/6365788621_7a24685660_o_hu417a84e9fe229793d4312d39ae4a1d63_676385_700x0_resize_q75_box.jpg\" style=\"width:500px; border:0px solid black;\"/\u003e\u003c/a\u003e\n\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/shower-instructions/\"\u003eShower Instructions\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/traveller-and-the-human-chain/\"\u003eTraveller and the Human Chain\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003c/main\u003e",
  "Date": "2011-11-20T00:00:00Z",
  "Author": "John Jacobsen"
}