{
  "Source": "johnj.com",
  "Title": "Photoshop on a Dime",
  "Link": "http://johnj.com/posts/photoshop-on-a-dime/",
  "Content": "\u003cmain class=\"content\"\u003e\n\n\n\u003ch1\u003ePhotoshop on a Dime\u003c/h1\u003e\n\n\n\u003cp\u003e\n\n\u003ca class=\"tag\" href=\"/tags/art\"\u003e\u003cspan class=\"art-tag\"\u003eart\u003c/span\u003e\u003c/a\u003e\n\n  ..... \u003cem\u003e\u003ctime class=\"postdate\" datetime=\"2009-10-12T00:00:00Z\"\u003e\n      October 12, 2009\n    \u003c/time\u003e\u003c/em\u003e\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/the-cruel-stranger/\"\u003eThe Cruel Stranger\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/man-on-wire/\"\u003eMan on Wire\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003cp\u003e\nAs a side benefit of transitioning back from European time since\nreturning home last week, I have been waking up early most mornings\nand getting in a bit of painting. Some days there is nothing like\ngradually improving old paintings, scumbling, glazing and blending\nwith some quiet music going and the sun slowly rising outside.\u003c/p\u003e\n\u003cp\u003e\nAs satisfying as that can be, I don’t want to only rehash the same\nunfinished paintings endlessly (some may be beyond help). I keep\ncoming back to the problem of composing new pictures — what to put in\na piece, and where to put it. When I draw (or just close my eyes),\nmany images or ideas arise… not to mention the thousands of photos I\ntake or the images I “clip” from books and the Web. But it can be hard\nto knit this slurry of ideas and source material into something which\nworks, which has, in other words, a unique and compelling aesthetic\nlogic. Painting is such a slow process (at least the way I do it) that\nit can be painful to make the required compositional choices once a\npiece is “launched.”\u003c/p\u003e\n\u003cp\u003e\nI have posted before about making studies and preliminary drawings,\nbut I keep tweaking my methods, looking for processes which will help\ngenerate the most compelling images (at least to me) and will add more\nmomentum and fun to art making.\u003c/p\u003e\n\u003cp\u003e\nOne thing which I’ve tried before and which I returned to this morning\nis the use of transparent overlays to make preliminary studies. I\nfirst encountered this method of drawing in slides of Eric Fischl’s\nwork. A few years back I tried a variant of the process for composing\npictures, using transparent sheets known as Kimodesk. While trying to\nadd some content to a sketchbook drawing this morning, I tried it\nagain, and it seemed powerful and slightly magical, as if I had a\nphysical version of Photoshop at my fingertips:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eOne \u0026#39;composes’ multiple figures, buildings, etc. quickly, simply by\nmoving sheets around on top of each other;\u003c/li\u003e\n\u003cli\u003eYou can draw on both sides of the sheet for a greater expressive\nrange;\u003c/li\u003e\n\u003cli\u003eThe surface takes graphite like soft, black butter; gouache works\ntoo if it’s very \u0026#39;dry’ (no washes… probably oil would be fine);\u003c/li\u003e\n\u003cli\u003eUnlike a drawing in a sketchbook, where you have to erase whenever\nyou move or change something, there is very little penalty for\nmaking adjustments;\u003c/li\u003e\n\u003cli\u003eIt is easy to duplicate a picture element or series of marks;\u003c/li\u003e\n\u003cli\u003eYou can trace existing drawings from sketchbooks and incorporate\nfound photos, etc., or just run the Kimodesk directly through a\nlaser printer, making a nice, rich black;\u003c/li\u003e\n\u003cli\u003eYou can flip your drawing and see the image in reverse at any time\n(a good compositional check, essentially the same looking at your\npainting in the mirror\u003csup class=\"footnote-reference\"\u003e\u003ca id=\"footnote-reference-1\" href=\"#footnote-1\"\u003e1\u003c/a\u003e\u003c/sup\u003e).\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eKimodesk looks really good and can be used directly in finished works\n(as \u003ca href=\"http://website.education.wisc.edu/jdamer/index.html\"\u003eJack Damer\u003c/a\u003e, who introduced me to the material, has done), but\nprobably glassine or other transparent paper would work nearly as well\nfor the preliminary drawings I’m interested in at the\nmoment. Unfortunately I don’t believe anybody is making or selling the\nstuff at the moment. If anybody knows otherwise, please let me know.\u003c/p\u003e\n\u003cp\u003e\n(Why not just use Photoshop? I like Photoshop, but the lack of\nphysicality is offputting at times, and you have to get the images\ninto the computer and back out again. Plus, I already spend 99.9% of my\ntime in front of a computer.)\u003c/p\u003e\n\u003cdiv class=\"footnotes\"\u003e\n\u003chr class=\"footnotes-separatator\"/\u003e\n\u003cdiv class=\"footnote-definitions\"\u003e\n\u003cdiv class=\"footnote-definition\"\u003e\n\u003csup id=\"footnote-1\"\u003e\u003ca href=\"#footnote-reference-1\"\u003e1\u003c/a\u003e\u003c/sup\u003e\n\u003cdiv class=\"footnote-body\"\u003e\n\u003cp\u003eThe eye gets used to flaws in a work-in-progress. To counter that problem, in addition to the mirror trick, some people turn their work upside down, or use a convex lens to make it look farther away. Salvador Dalí used to have his wife Gala place his paintings at surprise locations around the house where he could bump into them unexpectedly and be struck by things he hadn’t noticed about them… lacking Gala, most of the rest of us use other tricks.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\n\n\n\u003cp\u003e\n\n\nLater: \u003ca href=\"http://johnj.com/posts/the-cruel-stranger/\"\u003eThe Cruel Stranger\u003c/a\u003e\n\n\n\u003cbr/\u003e\n\n\nEarlier: \u003ca href=\"http://johnj.com/posts/man-on-wire/\"\u003eMan on Wire\u003c/a\u003e\n\n\n\u003c/p\u003e\u003cp\u003e\n\n\n\n\u003c/p\u003e\u003c/main\u003e",
  "Date": "2009-10-12T00:00:00Z",
  "Author": "John Jacobsen"
}