{
  "Source": "raphlinus.github.io",
  "Title": "Covid-19 resources",
  "Link": "https://raphlinus.github.io/covid/2020/03/14/covid.html",
  "Content": "\u003cdiv class=\"post-content e-content\" itemprop=\"articleBody\"\u003e\n    \u003cp\u003eI’ve been following the Covid-19 pandemic closely the last week or so, to the point of not really being able to concentrate on other things. In the hope the resources I’ve found might be useful, I’m sharing them with my blog readership. This will be updated frequently, most recently 3/16.\u003c/p\u003e\n\n\u003ch2 id=\"avoid-misinformation\"\u003eAvoid misinformation\u003c/h2\u003e\n\n\u003cp\u003eThere is, unfortunately, a huge amount of misinformation, and even active disinformation out there. Since this pandemic is likely to be efficient in converting misinformation into deaths, now is a good time to improve one’s information sources. To quote \u003ca href=\"https://www.linkedin.com/pulse/dispatch-3-dr-shlain-reporting-from-front-lines-shlain-m-d-/\"\u003eDr. Shlain 3/12 dispatch\u003c/a\u003e, “There is a ton of bullshit being disseminated. Please do not disseminate anything you can’t verify. Science must prevail.”\u003c/p\u003e\n\n\u003cp\u003eI’ve found Twitter to be an excellent source of information, provided of course one follows actual experts. My personal favorite is \u003ca href=\"https://twitter.com/JeremyKonyndyk\"\u003e@JeremyKonyndyk\u003c/a\u003e, who among other things led Ebola response under Obama, but I also want to raise up \u003ca href=\"https://twitter.com/ScottGottliebMD\"\u003e@ScottGottliebMD\u003c/a\u003e, who has been doing a particularly excellent job calling attention to the need for better testing, and has excellent conservative credentials (works at the \u003ca href=\"https://www.aei.org/about\"\u003eAEI\u003c/a\u003e). The virus doesn’t care about our political affiliation, and now more than ever is a time we need to be reaching across political divisions to work together. I could make a list of all the people I follow on Twitter, but what I recommend is following the various experts Jeremy retweets, as there is a great range.\u003c/p\u003e\n\n\u003cp\u003eUnfortunately, a lot of the misinformation is being spread by people in authority, including \u003ca href=\"https://thebulletin.org/2020/03/why-do-politicians-keep-breathing-life-into-the-false-conspiracy-theory-that-the-coronavirus-is-a-bioweapon/\"\u003eelected officials\u003c/a\u003e, the more irresponsible media outlets, and, sadly, the President. People on epidemiology Twitter are consistently citing misinformation as one of the challenges they face - they do not have the bandwidth to debunk each bit individually. Do your part. Tune out information sources that are prone to misinformation, and please don’t help this stuff propagate.\u003c/p\u003e\n\n\u003cp\u003eThere is one very easy way to identify misinformation. Anyone proposing “cures” that go beyond common sense health advice or consensus public health advice is absolutely spreading dangerous misinformation. Unfortunately, this stuff is fairly common. [As a bit more subtlety, doctors are actively considering existing antiviral agents. Some look promising, and hopefully we will see the result of this research soon. But doctors shouldn’t be paying attention to me for information, there are much better sources such as \u003ca href=\"https://www.youtube.com/user/MEDCRAMvideos/videos\"\u003eDr. Seheult’s MedCram channel\u003c/a\u003e. Anyone who is suggesting people seek out such things without a doctor’s prescription is a dangerous quack].\u003c/p\u003e\n\n\u003cp\u003e[I’m going to expand on this topic of the pipeline from research to actionable advice soon, as it’s quite tricky territory. For example, in non-expert circles I see a lot of attention given to the advice to avoid ibuprofen. There is \u003ca href=\"https://www.sciencemediacentre.org/expert-reaction-to-reports-that-the-french-health-minister-recommended-use-of-paracetamol-for-fever-from-covid-19-rather-than-ibuprofen-or-cortisone/\"\u003eweak support\u003c/a\u003e for this, and it might be a good idea to use acetaminophen instead out of caution, but there is not yet expert consensus on this. Update 3/17: the WHO now recommends using acetaminophen rather than ibuprofen as self-medication.]\u003c/p\u003e\n\n\u003cp\u003eMore tips on misinformation in this \u003ca href=\"https://twitter.com/imran_malek/status/1238948869565800456\"\u003eTwitter thread from Imran Malek\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp\u003eA few organizations deserve credit for very good work. The Atlantic is consistently good, with a series of excellent articles by James Hamblin in particular. He is one of the best health communicators working today. On TV, Chris Hayes deserves praise.\u003c/p\u003e\n\n\u003cp\u003eAnd I should give credit where credit is due to Fox News for suspending Trish Regan’s show. I just wish they’d go farther and make a collective decision not to air misinformation altogether. If you have Fox News watching people in your family, now might be a good time to remind them that it’s an exceedingly poor source of information. It’s very hard to get through to such people, but it might be helpful to point out that \u003ca href=\"https://www.theguardian.com/media/2020/mar/13/fox-news-accused-of-downplaying-coronavirus-as-it-moves-to-protect-staff\"\u003ethey are saying one thing to their audience and doing another regarding the health of their own employees\u003c/a\u003e.\u003c/p\u003e\n\n\u003ch2 id=\"overviews-and-updates\"\u003eOverviews and updates\u003c/h2\u003e\n\n\u003cp\u003eDr. Jordan Shlain is running regular updates. \u003ca href=\"https://tincture.io/dispatch-4-from-the-front-lines-79c74fa67ae0\"\u003eDr. Shlain Dispatch #4\u003c/a\u003e is filled with good stats and tips.\u003c/p\u003e\n\n\u003cp\u003eA fantastic summary of the science is the \u003ca href=\"https://drive.google.com/file/d/1DqfSnlaW6N3GBc5YKyBOCGPfdqOsqk1G/view\"\u003eHow to fight the coronavirus SARS-CoV-2 and its disease, CoVID-19\u003c/a\u003e slide deck from the Michael Lin lab at Stanford. A complementary talk, with a greater emphasis on analysis of Wuhan (and with both slides and video available) is from \u003ca href=\"https://twitter.com/XihongLin/status/1238970212780826633\"\u003e@XihongLin\u003c/a\u003e at Harvard.\u003c/p\u003e\n\n\u003cp\u003eThe Imperial College \u003ca href=\"https://www.imperial.ac.uk/mrc-global-infectious-disease-analysis/news--wuhan-coronavirus/\"\u003eImpact of non-pharmaceutical interventions (NPIs) to reduce COVID-19 mortality and healthcare demand\u003c/a\u003e report is sobering, and is one of the few responsible sources to cite actual numbers. In their simulation of what happens if we don’t take actual steps, they predict 2.2 million deaths in the US. That should give the people who complain that the “flattenthecurve” graphs are too simplistic and qualitiative some food for thought.\u003c/p\u003e\n\n\u003ch2 id=\"raw-data-resources\"\u003eRaw data resources\u003c/h2\u003e\n\n\u003cp\u003e\u003ca href=\"https://www.worldometers.info/coronavirus/\"\u003eWorldometer\u003c/a\u003e has up-to-date information by country. The \u003ca href=\"https://www.arcgis.com/apps/opsdashboard/index.html\"\u003eJohns Hopkins COVID-19 map\u003c/a\u003e has long been the go-to resource, but a limitation is that it aggregates all cases by state in the US but no finer. Especially for large states such as California, the \u003ca href=\"https://www.nytimes.com/interactive/2020/us/coronavirus-us-cases.html\"\u003eNew York Times\u003c/a\u003e dashboard may be more useful.\u003c/p\u003e\n\n\u003cp\u003eThe \u003ca href=\"https://ourworldindata.org/coronavirus\"\u003eOur World in Data\u003c/a\u003e website is one of the most comprehensive, and I particularly commend their \u003ca href=\"https://ourworldindata.org/coronavirus#trajectories-since-the-100th-confirmed-case\"\u003etrajectories\u003c/a\u003e chart. It is remarkable how similar the trajectories are for most countries (with Japan and smaller city-states being the exceptions). Note that interpretation is tricky; the US has been way behind on testing capacity but will be bringing that online over the next few days, so we are likely to see a massive uptick in case numbers that represent testing coverage rather than a spike in cases. That will make it hard to evaluate the effectiveness of “social distancing” measures.\u003c/p\u003e\n\n\u003cp\u003e\u003ca href=\"https://ourworldindata.org/coronavirus#trajectories-since-the-100th-confirmed-case\"\u003e\u003cimg src=\"/assets/ourworld-trajectory.png\" alt=\"trajectories from Our World in Data, 3/14, CC BY\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\n\u003cp\u003eLikely most readers of this blog understand exponential growth pretty well, but the 3 Blue 1 Brown video on \u003ca href=\"https://www.youtube.com/watch?v=Kas0tIxDvrg\"\u003eExponential growth and epidemics\u003c/a\u003e does a really good job of putting it in context of epidemics, and in particular explains that a logistic curve is likely a better model, and that only matches a pure exponential up to the inflection point.\u003c/p\u003e\n\n\u003cp\u003eFor fans of modeling, \u003ca href=\"https://twitter.com/trvrb\"\u003eTrevor Bedford @trvrb\u003c/a\u003e is a good person to follow. The Nextstrain work has been tracking the genetic variation from the various strains of SARS-CoV-2 virus, and you can follow \u003ca href=\"https://twitter.com/firefoxx66\"\u003eDr Emma Hodcroft @firefoxx66\u003c/a\u003e for updates on that.\u003c/p\u003e\n\n\u003cp\u003eI now have a \u003ca href=\"https://twitter.com/i/lists/1239639611694911489\"\u003ecovid-19 Twitter list\u003c/a\u003e which is carefully curated to provide a wide range of expertise, and high signal to noise ratio.\u003c/p\u003e\n\n\u003ch2 id=\"practical-tips\"\u003ePractical tips\u003c/h2\u003e\n\n\u003cp\u003eI recommend \u003ca href=\"https://flattenthecurve.com\"\u003eflattenthecurve.com\u003c/a\u003e, not just for explaining the need for “social distancing” and encouraging it, but also because it puts the advice in context of people actually living their lives.\u003c/p\u003e\n\n\u003cp\u003eIf you do start developing symptoms, the best guide is \u003ca href=\"https://www.who.int/publications-detail/home-care-for-patients-with-suspected-novel-coronavirus-(ncov)-infection-presenting-with-mild-symptoms-and-management-of-contacts\"\u003eHome care for patients with suspected novel coronavirus (nCoV) infection presenting with mild symptoms and management of contacts\u003c/a\u003e, from the World Health Organization (also see country-specific versions such as the \u003ca href=\"https://www.gov.uk/government/publications/covid-19-stay-at-home-guidance/stay-at-home-guidance-for-people-with-confirmed-or-possible-coronavirus-covid-19-infection\"\u003eUK version\u003c/a\u003e. For more discussion of the policy choices around this, see \u003ca href=\"https://www.theatlantic.com/health/archive/2020/03/where-do-you-go-if-you-get-coronavirus/607759/\"\u003eWhat Will You Do If You Start Coughing?\u003c/a\u003e by James Hamblin.\u003c/p\u003e\n\n\u003cp\u003eYour local public health department is a great resource. Become familiar with it and be prepared to follow their advice, as this stuff works better when it’s coordinated, and they’ll also point you to authoritative resources. Here’s the \u003ca href=\"https://www.cityofberkeley.info/coronavirus/\"\u003eBerkeley Coronavirus\u003c/a\u003e page, for example.\u003c/p\u003e\n\n\u003cp\u003eHere’s a Twitter thread with much great advice: \u003ca href=\"https://twitter.com/ASlavitt/status/1238832893771894788\"\u003eCOVID-19 Prep Update- March 14\u003c/a\u003e by Andy Slavett. I am not going to post my own projections because it wouldn’t be responsible, but they are very much on track with his.\u003c/p\u003e\n\n\u003cp\u003eBut beyond basic health advice, it’s super important to take care of yourself. Many sources recommend not binging on Covid-19 news (I have been terrible at following that advice). Do other things to stay healthy, and do things to take care of your emotional, spiritual, and mental health. I’ve personally been dealing with waves of intense anger, especially when I check my feeds and see the latest monumental fuckup - as I write, I just saw the images of huge crowds at airports on 3/14. Be aware that this is a tough and stressful time, and have plans in place to manage it.\u003c/p\u003e\n\n\u003cp\u003eOur Quaker meeting has suspended in-person meetings (along with probably most other religious organizations in the country by now), and is doing online meetings for worship. In addition, we’re setting up an emergency preparedness network, groups of about 10 each by local neighborhood, where we’ll be checking in with each other and can serve as a point of contact in case of emergency. I feel good getting involved in this, and maybe you can consider setting up something similar, whether it’s through your religious group, school, or other social group.\u003c/p\u003e\n\n\u003cp\u003eAlso make sure to take care of your health in other ways: eat right, sleep well, continue to get exercise. Because we don’t have a cure for Covid-19 yet, general health is one of the absolute best predictors of outcome.\u003c/p\u003e\n\n\u003cp\u003eTake care of yourself, take care of each other.\u003c/p\u003e\n\n\u003cp\u003eNote: this blog is open source! Feel free to adapt this post as you like (under CC BY 4.0 license), and also send pull requests to the \u003ca href=\"https://github.com/raphlinus/raphlinus.github.io\"\u003erepo\u003c/a\u003e to update it.\u003c/p\u003e\n\n\n  \u003c/div\u003e",
  "Date": "2020-03-14T17:48:42Z",
  "Author": "raphlinus"
}