{
  "Source": "raphlinus.github.io",
  "Title": "The Soundness Pledge",
  "Link": "https://raphlinus.github.io/rust/2020/01/18/soundness-pledge.html",
  "Content": "\u003cdiv class=\"post-content e-content\" itemprop=\"articleBody\"\u003e\n    \u003cp\u003eLately there has been considerable drama around Actix-web, for which I’ll point to Steve Klabnik’s \u003ca href=\"https://words.steveklabnik.com/a-sad-day-for-rust\"\u003eA sad day for Rust\u003c/a\u003e to explain. This post is an opportunity to share some thoughts I’ve had about soundness, Rust, and open source community.\u003c/p\u003e\n\n\u003cp\u003eI believe one of the most important contributions of Rust is the \u003cem\u003ecultural\u003c/em\u003e ideal of perfect soundness: that code using a sound library, no matter how devious, is unable to trigger undefined behavior (which is often thought of in terms of crashes but can be \u003ca href=\"https://raphlinus.github.io/programming/rust/2018/08/17/undefined-behavior.html\"\u003efar more insidious\u003c/a\u003e). Any deviation from this is a bug. The Rust language itself clearly subscribes to this ideal, even as it sometimes falls short of attaining it (at this writing, there are 44 \u003ca href=\"https://github.com/rust-lang/rust/labels/I-unsound%20%F0%9F%92%A5\"\u003eI-unsound\u003c/a\u003e bugs, the oldest of which is more than 6 years old).\u003c/p\u003e\n\n\u003cp\u003eMany in the Rust community subscribe to this, but some don’t. I’m \u003cem\u003enot\u003c/em\u003e arguing that one is right and the other is wrong. Rather, the main argument in this post will be that there is a need for better communication, to make clear one’s thinking on this point. I believe many of the problems in the Actix drama were caused by miscommunication and a mismatch in expectations.\u003c/p\u003e\n\n\u003ch2 id=\"unsoundness-is-bad-unsafe-is-a-sharp-tool\"\u003eUnsoundness is bad, unsafe is a sharp tool\u003c/h2\u003e\n\n\u003cp\u003eI think David Tolnay’s blog post on \u003ca href=\"https://docs.rs/dtolnay/0.0.7/dtolnay/macro._03__soundness_bugs.html\"\u003esoundness bugs\u003c/a\u003e draws a very important distinction between “unsafe” as it is used in Rust, and “unsound”. Essentially, “sound” means that all possible uses of a library avoid undefined behavior. This is quite a high standard, and in many cases goes beyond what’s necessary to deliver working code. Even so, it is the standard that the Rust language (including standard library) and many libraries aspire to.\u003c/p\u003e\n\n\u003cp\u003eThe \u003ccode class=\"language-plaintext highlighter-rouge\"\u003eunsafe\u003c/code\u003e keyword has a specific meaning: it is a sign that more reasoning is needed to prove that use of the code is safe. Outside unsafe blocks, the compiler essentially uses information encoded in the type system to prove that use of the code is safe. Inside unsafe blocks, certain things are permitted that are ordinarily prohibited, for example reading and writing of raw pointers. For readers who don’t know Rust well, I recommend reading the \u003ca href=\"https://doc.rust-lang.org/book/ch19-01-unsafe-rust.html\"\u003eUnsafe Rust\u003c/a\u003e chapter of the Rust book; otherwise a lot of this discussion is likely to be confusing.\u003c/p\u003e\n\n\u003cp\u003eThere’s a tendency in some parts of the Rust community to consider \u003ccode class=\"language-plaintext highlighter-rouge\"\u003eunsafe\u003c/code\u003e itself as bad, but I think that’s missing some subtlety. Certainly in code that could just as easily be written in safe Rust, using \u003ccode class=\"language-plaintext highlighter-rouge\"\u003eunsafe\u003c/code\u003e for some perceived performance gain, or, worse, as a way of silencing complaints from the borrow checker, is a bad sign. But for many uses, especially integration with libraries or runtimes designed for other languages, it is essential, and it’s important to use it well. Other valid use cases include SIMD and the implementation of foundational data structures; the Rust standard library has a good collection, but is not intended to be comprehensive of all possible use cases.\u003c/p\u003e\n\n\u003cp\u003eSometimes it’s fairly easy to avoid soundness bugs: just don’t use “unsafe” anywhere in the code, and don’t depend on any other library with a soundness bug. For certain classes of problems, this is practical. Often it’s framed as a tradeoff between performance and safety, but I haven’t seen a lot of evidence that this is really the tradeoff. In most cases I’ve seen, Rust gives you the tools to achieve both, but it sometimes \u003cem\u003edoes\u003c/em\u003e require extra work. Many of the safety guarantees in Rust come at no runtime cost. A few others (notably array bounds checks) have some cost, but ordinary performance tuning techniques are often effective even within the safe fragment. One data point of evidence for this is \u003ca href=\"https://github.com/raphlinus/pulldown-cmark\"\u003epulldown-cmark\u003c/a\u003e, which now has best-in-class performance, but no use of unsafe (there is an optional SIMD optimization, but performance is hardly different than the default configuration, thanks to extensive tuning by Marcus Klaas de Vries).\u003c/p\u003e\n\n\u003cp\u003eThe right way to think of \u003ccode class=\"language-plaintext highlighter-rouge\"\u003eunsafe\u003c/code\u003e is as a sharp tool: to be treated with respect, wielded by those who have some knowledge about how to do it well, and not to be overused. We’re \u003cem\u003enot\u003c/em\u003e aiming for a world in which scissors have been replaced by those plastic things that can’t actually cut paper.\u003c/p\u003e\n\n\u003ch2 id=\"binding-with-complex-runtimes\"\u003eBinding with complex runtimes\u003c/h2\u003e\n\n\u003cp\u003eSome applications of Rust are binaries where all of the code is Rust, or perhaps there are a couple of C or C++ libraries for specific functions. For these, reasoning about soundness is reasonably straightforward.\u003c/p\u003e\n\n\u003cp\u003eAnother interest class is binding Rust to existing complex runtimes, in which I include (scripting) languages, UI toolkits, and other related things; I believe the soundness issues are similar.\u003c/p\u003e\n\n\u003cp\u003eFor binding with a scripting language, a reasonable definition of soundness is that no code written in that language should be able to trigger UB in Rust code. This is quite difficult to acheive in practice, because languages are rarely designed with soundness in mind. A good example is \u003ca href=\"https://github.com/kyren/rlua\"\u003erlua\u003c/a\u003e, the README of which contains a good discussion of the safety goals and some indications how hard they are to achieve. Another good snapshot of an inherently difficult soundness issue is \u003ca href=\"https://github.com/PyO3/pyo3/issues/687\"\u003ePyO3#687\u003c/a\u003e. These links show significant effort and thoughtfulness of how to achieve soundness in a difficult environment.\u003c/p\u003e\n\n\u003cp\u003eThe story of rlua raises a very interesting point: the Lua language was fundamentally not designed with safety in mind, and allows a number of operations that are \u003ca href=\"https://github.com/kyren/rlua/issues/116\"\u003einherently quite dangerous\u003c/a\u003e. There’s really only so far a wrapper can go in trying to ensure soundness. The author’s \u003ca href=\"https://www.reddit.com/r/rust/comments/eq11t3/a_sad_day_for_rust/fep8ojm/\"\u003emore recent thinking\u003c/a\u003e is to expose the \u003ccode class=\"language-plaintext highlighter-rouge\"\u003eLua::new\u003c/code\u003e constructor as \u003ccode class=\"language-plaintext highlighter-rouge\"\u003eunsafe\u003c/code\u003e and make it clear to the client that they are ultimately responsible for not loading Lua code that can provoke safety problems. This seems a reasonable approach, and I think speaks to a general principle: when it is not possible to \u003cem\u003eguarantee\u003c/em\u003e soundness, it is often best to expose the functionality through an unsafe interface.\u003c/p\u003e\n\n\u003cp\u003eThe same principle underlies the philosophical differences between the \u003ca href=\"https://github.com/MaikKlein/ash\"\u003eAsh\u003c/a\u003e and \u003ca href=\"https://github.com/vulkano-rs/vulkano\"\u003evulkano\u003c/a\u003e crates for providing Vulkan wrappers. The Vulkan API is fundamentally unsafe, and while vulkano goes to great lengths to try to wrap that and provide a safe interface, that creates a number of compromises, which is problematic because the point of Vulkan is performance. For more context, see this description of \u003ca href=\"https://github.com/tomaka/vulkano/blob/6f2ee218887f6eb08a61b67387ad9a048cd59088/DESIGN.md\"\u003edesign decisions for vulkano\u003c/a\u003e and this Reddit discussion \u003ca href=\"https://www.reddit.com/r/rust/comments/5kc01i/update_report_ash_a_lightweight_vulkan_wrapper/\"\u003epresenting Ash motivations\u003c/a\u003e. While both approaches are reasonable, of the two Vulkano has found it considerably more difficult to deliver on its promises, with persistent \u003ca href=\"https://github.com/vulkano-rs/vulkano/labels/type%3A%20safety\"\u003esafety issues\u003c/a\u003e in spite of its stated goals, and other compromises that most Rust graphics programmers I’ve talked to find unappealing.\u003c/p\u003e\n\n\u003cp\u003eA closely related issue relevant to my own work is providing safe bindings for platform UI capabilities. For macOS, this is roughly the same as Objective-C language bindings. For Windows, it involves a great deal of wrapping of COM objects. Microsoft has a good blog post detailing some of their own work and the challenges: \u003ca href=\"https://msrc-blog.microsoft.com/2019/10/08/designing-a-com-library-for-rust/\"\u003eDesigning a COM library for Rust\u003c/a\u003e. Another detailed argument is a github issue entitled \u003ca href=\"https://github.com/microsoft/com-rs/issues/97\"\u003eCOM trait methods should probably always be unsafe\u003c/a\u003e. That is perhaps overly pessimistic, but speaks to the difficulty of the problem.\u003c/p\u003e\n\n\u003cp\u003eI’ll give a simple illustrative example of how safely wrapping a COM interface can be tricky: \u003ca href=\"https://docs.microsoft.com/en-us/previous-versions/windows/desktop/legacy/ff728743(v%3Dvs.85)\"\u003eID3DBlob\u003c/a\u003e, which is  used to hold the results of shader compilation, among other things. The underlying COM interface has two methods, which expose a length and a pointer to the blob contents. An obvious interface would be something like this:\u003c/p\u003e\n\n\u003cdiv class=\"language-rust highlighter-rouge\"\u003e\u003cdiv class=\"highlight\"\u003e\u003cpre class=\"highlight\"\u003e\u003ccode\u003e\u003cspan class=\"nd\"\u003e#[derive(Clone)]\u003c/span\u003e\n\u003cspan class=\"k\"\u003estruct\u003c/span\u003e \u003cspan class=\"nf\"\u003eD3DBlob\u003c/span\u003e\u003cspan class=\"p\"\u003e(\u003c/span\u003e\u003cspan class=\"n\"\u003eComPtr\u003c/span\u003e\u003cspan class=\"o\"\u003e\u0026lt;\u003c/span\u003e\u003cspan class=\"n\"\u003eID3DBlob\u003c/span\u003e\u003cspan class=\"o\"\u003e\u0026gt;\u003c/span\u003e\u003cspan class=\"p\"\u003e);\u003c/span\u003e\n\n\u003cspan class=\"k\"\u003eimpl\u003c/span\u003e \u003cspan class=\"n\"\u003eD3DBlob\u003c/span\u003e \u003cspan class=\"p\"\u003e{\u003c/span\u003e\n    \u003cspan class=\"k\"\u003efn\u003c/span\u003e \u003cspan class=\"nf\"\u003eget_mut\u003c/span\u003e\u003cspan class=\"p\"\u003e(\u003c/span\u003e\u003cspan class=\"o\"\u003e\u0026amp;\u003c/span\u003e\u003cspan class=\"k\"\u003emut\u003c/span\u003e \u003cspan class=\"k\"\u003eself\u003c/span\u003e\u003cspan class=\"p\"\u003e)\u003c/span\u003e \u003cspan class=\"k\"\u003e-\u0026gt;\u003c/span\u003e \u003cspan class=\"o\"\u003e\u0026amp;\u003c/span\u003e\u003cspan class=\"k\"\u003emut\u003c/span\u003e \u003cspan class=\"p\"\u003e[\u003c/span\u003e\u003cspan class=\"nb\"\u003eu8\u003c/span\u003e\u003cspan class=\"p\"\u003e]\u003c/span\u003e \u003cspan class=\"p\"\u003e{\u003c/span\u003e\n        \u003cspan class=\"k\"\u003eunsafe\u003c/span\u003e \u003cspan class=\"p\"\u003e{\u003c/span\u003e\n            \u003cspan class=\"nn\"\u003eslice\u003c/span\u003e\u003cspan class=\"p\"\u003e::\u003c/span\u003e\u003cspan class=\"nf\"\u003efrom_raw_parts_mut\u003c/span\u003e\u003cspan class=\"p\"\u003e(\u003c/span\u003e\u003cspan class=\"k\"\u003eself\u003c/span\u003e\u003cspan class=\"na\"\u003e.0\u003c/span\u003e\u003cspan class=\"nf\"\u003e.GetBufferPointer\u003c/span\u003e\u003cspan class=\"p\"\u003e(),\u003c/span\u003e \u003cspan class=\"k\"\u003eself\u003c/span\u003e\u003cspan class=\"na\"\u003e.0\u003c/span\u003e\u003cspan class=\"nf\"\u003e.GetBufferSize\u003c/span\u003e\u003cspan class=\"p\"\u003e())\u003c/span\u003e\n        \u003cspan class=\"p\"\u003e}\u003c/span\u003e\n    \u003cspan class=\"p\"\u003e}\u003c/span\u003e\n\u003cspan class=\"p\"\u003e}\u003c/span\u003e\n\u003c/code\u003e\u003c/pre\u003e\u003c/div\u003e\u003c/div\u003e\n\n\u003cp\u003eCan you spot the soundness issue? It’s the fact that it’s possible both to clone and to get mutable access, therefore you can get two mutable references to the same contents. Leaving out one or the other would restore soundness, but both of these operations make sense - you want a mutable reference when filling a buffer from some source, and you might want to clone to distribute the buffer to multiple threads.\u003c/p\u003e\n\n\u003cp\u003eA sophisticated approach to wrapping might use a form of session type, like this:\u003c/p\u003e\n\n\u003cdiv class=\"language-rust highlighter-rouge\"\u003e\u003cdiv class=\"highlight\"\u003e\u003cpre class=\"highlight\"\u003e\u003ccode\u003e\u003cspan class=\"k\"\u003estruct\u003c/span\u003e \u003cspan class=\"nf\"\u003eD3DBlobMutable\u003c/span\u003e\u003cspan class=\"p\"\u003e(\u003c/span\u003e\u003cspan class=\"n\"\u003eComPtr\u003c/span\u003e\u003cspan class=\"o\"\u003e\u0026lt;\u003c/span\u003e\u003cspan class=\"n\"\u003eID3DBlob\u003c/span\u003e\u003cspan class=\"o\"\u003e\u0026gt;\u003c/span\u003e\u003cspan class=\"p\"\u003e);\u003c/span\u003e\n\n\u003cspan class=\"nd\"\u003e#[derive(Clone)]\u003c/span\u003e\n\u003cspan class=\"k\"\u003estruct\u003c/span\u003e \u003cspan class=\"nf\"\u003eD3DBlob\u003c/span\u003e\u003cspan class=\"p\"\u003e(\u003c/span\u003e\u003cspan class=\"n\"\u003eComPtr\u003c/span\u003e\u003cspan class=\"o\"\u003e\u0026lt;\u003c/span\u003e\u003cspan class=\"n\"\u003eID3DBlob\u003c/span\u003e\u003cspan class=\"o\"\u003e\u0026gt;\u003c/span\u003e\u003cspan class=\"p\"\u003e);\u003c/span\u003e\n\n\u003cspan class=\"k\"\u003eimpl\u003c/span\u003e \u003cspan class=\"n\"\u003eD3DBlobMutable\u003c/span\u003e \u003cspan class=\"p\"\u003e{\u003c/span\u003e\n    \u003cspan class=\"k\"\u003efn\u003c/span\u003e \u003cspan class=\"nf\"\u003efreeze\u003c/span\u003e\u003cspan class=\"p\"\u003e(\u003c/span\u003e\u003cspan class=\"k\"\u003eself\u003c/span\u003e\u003cspan class=\"p\"\u003e)\u003c/span\u003e \u003cspan class=\"k\"\u003e-\u0026gt;\u003c/span\u003e \u003cspan class=\"n\"\u003eD3DBlob\u003c/span\u003e \u003cspan class=\"p\"\u003e{\u003c/span\u003e\n        \u003cspan class=\"nf\"\u003eD3DBlob\u003c/span\u003e\u003cspan class=\"p\"\u003e(\u003c/span\u003e\u003cspan class=\"k\"\u003eself\u003c/span\u003e\u003cspan class=\"na\"\u003e.0\u003c/span\u003e\u003cspan class=\"p\"\u003e)\u003c/span\u003e\n    \u003cspan class=\"p\"\u003e}\u003c/span\u003e\n\n    \u003cspan class=\"k\"\u003efn\u003c/span\u003e \u003cspan class=\"nf\"\u003eget_mut\u003c/span\u003e\u003cspan class=\"p\"\u003e(\u003c/span\u003e\u003cspan class=\"o\"\u003e\u0026amp;\u003c/span\u003e\u003cspan class=\"k\"\u003emut\u003c/span\u003e \u003cspan class=\"k\"\u003eself\u003c/span\u003e\u003cspan class=\"p\"\u003e)\u003c/span\u003e \u003cspan class=\"k\"\u003e-\u0026gt;\u003c/span\u003e \u003cspan class=\"o\"\u003e\u0026amp;\u003c/span\u003e\u003cspan class=\"k\"\u003emut\u003c/span\u003e \u003cspan class=\"p\"\u003e[\u003c/span\u003e\u003cspan class=\"nb\"\u003eu8\u003c/span\u003e\u003cspan class=\"p\"\u003e]\u003c/span\u003e \u003cspan class=\"p\"\u003e{\u003c/span\u003e \u003cspan class=\"o\"\u003e...\u003c/span\u003e \u003cspan class=\"p\"\u003e}\u003c/span\u003e\n\u003cspan class=\"p\"\u003e}\u003c/span\u003e\n\n\u003cspan class=\"k\"\u003eimpl\u003c/span\u003e \u003cspan class=\"n\"\u003eD3DBlob\u003c/span\u003e \u003cspan class=\"p\"\u003e{\u003c/span\u003e\n    \u003cspan class=\"k\"\u003efn\u003c/span\u003e \u003cspan class=\"nf\"\u003eget\u003c/span\u003e\u003cspan class=\"p\"\u003e(\u003c/span\u003e\u003cspan class=\"o\"\u003e\u0026amp;\u003c/span\u003e\u003cspan class=\"k\"\u003eself\u003c/span\u003e\u003cspan class=\"p\"\u003e)\u003c/span\u003e \u003cspan class=\"k\"\u003e-\u0026gt;\u003c/span\u003e \u003cspan class=\"o\"\u003e\u0026amp;\u003c/span\u003e\u003cspan class=\"p\"\u003e[\u003c/span\u003e\u003cspan class=\"nb\"\u003eu8\u003c/span\u003e\u003cspan class=\"p\"\u003e]\u003c/span\u003e \u003cspan class=\"p\"\u003e{\u003c/span\u003e \u003cspan class=\"o\"\u003e...\u003c/span\u003e \u003cspan class=\"p\"\u003e}\u003c/span\u003e\n\u003cspan class=\"p\"\u003e}\u003c/span\u003e\n\u003c/code\u003e\u003c/pre\u003e\u003c/div\u003e\u003c/div\u003e\n\n\u003cp\u003eThis is a simple example. I’ve come across a lot more interesting stuff, involving \u003ca href=\"https://docs.microsoft.com/en-us/windows/win32/api/d2d1/nn-d2d1-id2d1pathgeometry\"\u003etemporary objects that have an implicit lifetime dependency\u003c/a\u003e, \u003ca href=\"https://docs.microsoft.com/en-us/windows/win32/api/dwrite/nf-dwrite-idwritetextanalysissource-getlocalename\"\u003ecallbacks with interesting pointer lifetime requirements\u003c/a\u003e, and more. Many of these have resulted in unsoundness in published “safe” wrapper crates.\u003c/p\u003e\n\n\u003cp\u003eBecause of the difficulties I’ve outlined above, my own preferred style is increasingly to wrap platform functions using an \u003cem\u003eunsafe\u003c/em\u003e API, then verify that uses of these functions are conservative. In druid in particular, the druid-shell layer (which abstracts platform capabilities but is not a simple wrapper) has significant amounts of unsafe code, while the druid layer above it (UI logic) has absolutely none. I don’t know of a better way to manage this.\u003c/p\u003e\n\n\u003ch2 id=\"mitigating-unsoundness\"\u003eMitigating unsoundness\u003c/h2\u003e\n\n\u003cp\u003eThere are a combination of practices that can be used to mitigate unsoundness. Many of these are borrowed from the C++ world, where effectively every line of code is unsafe.\u003c/p\u003e\n\n\u003cp\u003eThe first line of defense is code review. Here, the \u003ccode class=\"language-plaintext highlighter-rouge\"\u003eunsafe\u003c/code\u003e keyword helps because it narrows the focus onto sections of code that are potentially unsound. A codebase with a few small, isolated \u003ccode class=\"language-plaintext highlighter-rouge\"\u003eunsafe\u003c/code\u003e sections is much easier to audit than one which uses it pervasively. There are tireless volunteers in the Rust community, most notably \u003ca href=\"https://github.com/Shnatsel\"\u003eShnatsel\u003c/a\u003e, who analyze code for unsoundness and propose fixes.\u003c/p\u003e\n\n\u003cp\u003eThere are also a number of tools available, including \u003ca href=\"https://github.com/google/sanitizers\"\u003esanitizers\u003c/a\u003e and \u003ca href=\"https://github.com/rust-lang/miri\"\u003eMIRI\u003c/a\u003e. The latter is especially good at reporting “technical” violations, as it has a deeper understanding of Rust semantics than the LLVM-based tools. However, these tools can only report violations on code paths that trigger them, and many of the soundness violations occur on exceptional paths. For these, fuzzing can help.\u003c/p\u003e\n\n\u003cp\u003eEven so, the ideal of soundness covers \u003cem\u003eall\u003c/em\u003e uses, no matter how devious. It is possible, even likely, that dynamically testing running code will fail to uncover potential soundness issues that could arise from using the code in ways likely not anticipated by the library author. In fact, for these use cases there is likely some controversy about whether fixing the soundness issues is even worthwhile.\u003c/p\u003e\n\n\u003cp\u003eAn exciting research area for the future is formal techniques for proving Rust programs correct, such as \u003ca href=\"https://www.ralfj.de/blog/\"\u003eRalf Jung\u003c/a\u003e’s work. This is most likely to yield positive results for lower level data structures; it should finally be possible to implement a \u003ca href=\"https://rust-unofficial.github.io/too-many-lists/\"\u003edoubly-linked list\u003c/a\u003e efficiently and without anxiety.\u003c/p\u003e\n\n\u003ch2 id=\"dependencies\"\u003eDependencies\u003c/h2\u003e\n\n\u003cp\u003eUnfortunately, the soundness of a crate is really the worst of the crate itself and all transitive dependencies. Further, the number of transitive dependencies can become quite large; a typical application will have several hundred. There are a number of efforts to try to audit dependencies for various issues, including the use of unsafe but also license compatibility, etc. The \u003ca href=\"https://github.com/crev-dev/cargo-crev\"\u003ecrev\u003c/a\u003e project is particularly interesting, as it focuses on human review, but cryptographically strong verification that the review is what it claims to be.\u003c/p\u003e\n\n\u003ch2 id=\"the-pledge\"\u003eThe pledge\u003c/h2\u003e\n\n\u003cp\u003eI propose the following as the basic form of the soundness pledge:\u003c/p\u003e\n\n\u003cp\u003e“The intent of this crate is to be free of soundness bugs. The developers will do their best to avoid them, and welcome help in analyzing and fixing them.”\u003c/p\u003e\n\n\u003cp\u003eI think many, if not most, Rust libraries would subscribe to such a pledge, but also that there is a sizable minority who would not. And that’s fine. It’s definitely a tradeoff, and there is \u003cem\u003eeffort\u003c/em\u003e involved in achieving these goals. Or, perhaps the library author doesn’t agree with my assertion that it’s possible to attain top-tier performance using only safe Rust. Most Rust libraries are provided with as a volunteer effort.\u003c/p\u003e\n\n\u003cp\u003eAny library taking this pledge would basically need to ensure that all its dependencies have done so, or establish an equivalent level of trust through other means.\u003c/p\u003e\n\n\u003cp\u003eAs mentioned above, I think it’s fine for a library \u003cem\u003enot\u003c/em\u003e to subscribe to this pledge. Then, third-party auditors will know not to waste their time seeking soundness problems, and potential users will know what to expect. Both those who value performance over safety, and safety over performance, will see a clear statement of priorities that can inform their decision whether to take on the dependency.\u003c/p\u003e\n\n\u003ch2 id=\"skin-in-the-game\"\u003eSkin in the game\u003c/h2\u003e\n\n\u003cp\u003eHigher levels of the soundness pledge might involve some form of commitment of effort to attain the goal: independent review, extensive use of fuzzers and sanitizers, and, hopefully at some point, formal proofs of soundness.\u003c/p\u003e\n\n\u003cp\u003eThis is a whole ’nother discussion, but I think these higher commitments of effort should come with some kind of material incentive. Though there are exceptions, most open source Rust development is done as a volunteer effort, a labor of love. It is not fun responding to reports of vulnerabilities in one’s code, or having a feeling of responsibility for security issues in users of the code. I think there are opportunities here to make the incentives match up more closely with the value provided.\u003c/p\u003e\n\n\u003ch2 id=\"implications-outside-rust\"\u003eImplications outside Rust\u003c/h2\u003e\n\n\u003cp\u003eI’ve been talking extensively about Rust here for obvious reasons, but I believe reasoning about soundness and safety is valuable in other languages as well. Some other language cultures are way ahead of the game, particularly Java and JVM languages (provided you don’t do JNI, ugh!), as the language itself provides very strong soundness guarantees, even in the face of race conditions and the like.\u003c/p\u003e\n\n\u003cp\u003eIt \u003cem\u003eis\u003c/em\u003e possible to write safe C and C++ code. It just takes a \u003cem\u003elot\u003c/em\u003e of effort, using the tools I’ve outlined above such as sanitizers. Certain codebases might already be considered honorary pledges, I’m thinking \u003ca href=\"https://www.sqlite.org/index.html\"\u003eSQLite\u003c/a\u003e, as their \u003ca href=\"https://www.sqlite.org/testing.html\"\u003etesting methodology\u003c/a\u003e in particular is likely to catch most of the soundness bugs that motivate the use of safe Rust.\u003c/p\u003e\n\n\u003cp\u003eBut ultimately I think some of the most productive interactions around soundness may result from the attempt to write safe Rust wrappers for other runtimes. I have to wonder how different Vulkan might be if it had been informed by an effort to build safe Rust wrappers without significant runtime costs, and how much that might have made it easier to base WebGPU on it.\u003c/p\u003e\n\n\u003cp\u003eSimilarly for COM. Many soundness issues are discussed in informal documentation, such as whether a method is “thread-safe” or not. The Rust concepts of \u003ca href=\"https://doc.rust-lang.org/nomicon/send-and-sync.html\"\u003eSend and Sync\u003c/a\u003e are much more precise ways of talking about behavior in multithreaded concepts, and together with questions of whether \u003ccode class=\"language-plaintext highlighter-rouge\"\u003eClone\u003c/code\u003e is allowed and which methods are \u003ccode class=\"language-plaintext highlighter-rouge\"\u003e\u0026amp;self\u003c/code\u003e vs \u003ccode class=\"language-plaintext highlighter-rouge\"\u003e\u0026amp;mut self\u003c/code\u003e, plus the cases where it’s impossible to avoid the need for \u003ccode class=\"language-plaintext highlighter-rouge\"\u003eunsafe\u003c/code\u003e, the type signature for a Rust wrapper tells you a \u003cem\u003elot\u003c/em\u003e about how to safely use a COM interface. Just doing an audit of various COM libraries to document the corresponding safe Rust types would be a major effort, but one that I think could pay off.\u003c/p\u003e\n\n\u003ch2 id=\"conclusion\"\u003eConclusion\u003c/h2\u003e\n\n\u003cp\u003eWhile almost everyone would agree that soundness is better than unsoundness, different people will have different priorities for how important it is, especially as a tradeoff for coding effort and performance. Most of the Rust community highly values soundness, but even within the community there is significant variation. I’ve proposed a “pledge,” a statement of intent really, which I hope could be used to clearly communicate the level of priority for Rust projects.\u003c/p\u003e\n\n\u003cp\u003eRight now, I’m inviting discussion rather than proposing it as a formal badge. Perhaps it’s not really a good idea, or has downsides I don’t foresee, or perhaps the idea needs tweaking. But I think it’s worth talking about.\u003c/p\u003e\n\n\u003cp\u003eDiscussion on \u003ca href=\"https://www.reddit.com/r/rust/comments/eqcefv/the_soundness_pledge/\"\u003e/r/rust\u003c/a\u003e and \u003ca href=\"https://lobste.rs/s/ksjy7n/soundness_pledge\"\u003eLobsters\u003c/a\u003e.\u003c/p\u003e\n\n\n  \u003c/div\u003e",
  "Date": "2020-01-18T03:46:42Z",
  "Author": "raphlinus"
}