{
  "Source": "raphlinus.github.io",
  "Title": "Small updates",
  "Link": "https://raphlinus.github.io/personal/2018/11/04/small-updates.html",
  "Content": "\u003cdiv class=\"post-content e-content\" itemprop=\"articleBody\"\u003e\n    \u003cp\u003eThere’s been a lot going on, and I’ve wanted to focus on coding recently, so the technically deep posts that I’ve been meaning to write remain in the pipeline. In the meantime, here are some updates on various things.\u003c/p\u003e\n\n\u003ch2 id=\"zulip\"\u003eZulip\u003c/h2\u003e\n\n\u003cp\u003eI’ve been looking for a better tool for open source community interactions. We’ve mostly been using IRC for xi-editor, but it’s not friendly to newcomers, and a pretty poor experience if you don’t use a bouncer (I use \u003ca href=\"https://irccloud.com\"\u003eirccloud.com\u003c/a\u003e and pay for it out of my pocket). I’m also very critical of most social media style tools, which optimize for engagement rather than quality of interaction. Evan Czaplicki talks about those problems extremely eloquently in his talk, \u003ca href=\"https://www.thestrangeloop.com/2018/the-hard-parts-of-open-source.html\"\u003eThe hard parts of open source\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp\u003eI thought a bit about the question, “what tool today is the best fit for fostering an open source community?” After some consideration, I settled on Zulip. It works really well for \u003ca href=\"https://recurse.com\"\u003eRecurse Center\u003c/a\u003e, has linkifiers and bot integrations that make it pleasant, and I like the way it’s easy to catch up on things quickly if you’re not always-on.\u003c/p\u003e\n\n\u003cp\u003eOf course, what really makes a community is the people and the choices made about how to interact, rather than the tool. If you’re working on xi-editor or projects (even somewhat loosely) related, I hope you’ll find \u003ca href=\"https://xi.zulipchat.com\"\u003exi.zulipchat.com\u003c/a\u003e a welcoming and productive space. So far it seems to be working great.\u003c/p\u003e\n\n\u003ch2 id=\"druid\"\u003eDruid\u003c/h2\u003e\n\n\u003cp\u003eThe UI toolkit brewing inside \u003ca href=\"https://github.com/xi-editor/xi-win\"\u003exi-win\u003c/a\u003e is turning out nicely, and I think it has promise. I decided to split it out and give it a new identity, so behold \u003ca href=\"https://github.com/xi-editor/druid\"\u003edruid\u003c/a\u003e. This is not a formal release yet, it’s still early days. Among other things, it needs a logo and nicely polished screenshots.\u003c/p\u003e\n\n\u003cp\u003eA few months ago, I made a patch to xi-win proper to use the toolkit, but didn’t commit it because it had some regressions (file save and mouse scrolling). I actually managed to lose the patch in the repo move, which was certainly frustrating. \u003ca href=\"https://github.com/LiHRaM\"\u003eHilmar Gústafsson\u003c/a\u003e kindly offered to reconstruct it, and working with him, we’ve done that and gone beyond.\u003c/p\u003e\n\n\u003cp\u003eThe biggest single problem with druid is that it’s Windows-only. I have hopes we’ll fix that before long.\u003c/p\u003e\n\n\u003ch2 id=\"synthesizer\"\u003eSynthesizer\u003c/h2\u003e\n\n\u003cp\u003eI haven’t had \u003cem\u003equite\u003c/em\u003e as much time to focus on the synthesizer as I would have liked. I’ve been working more on visuals and UI than the sound engine.\u003c/p\u003e\n\n\u003cp\u003eThis is a very rough draft of what the the patcher interface looks like:\u003c/p\u003e\n\n\u003cp\u003e\u003cimg src=\"/assets/patcher.png\" alt=\"Screenshot of patcher\"/\u003e\u003c/p\u003e\n\n\u003cp\u003eThere’s a bunch I want to change (the little control squares need to become knobs, icons on the chips), but this feels like it’s maybe halfway toward the vision I have for it.\u003c/p\u003e\n\n\u003cp\u003eI also implemented an analog oscilloscope emulation:\u003c/p\u003e\n\n\u003ciframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/atbIvpSUUt0\" frameborder=\"0\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\n\u003cp\u003eI’m really happy with the way this looks (the youtube upload is degraded a bit from the way I made the screenshot, and the actual version will be sharper, but it contributes in a way to the retro feel).\u003c/p\u003e\n\n\u003cp\u003eI’ll be talking about all this at the \u003ca href=\"https://www.meetup.com/Rust-Bay-Area/events/255058428/\"\u003eSF Rust Meetup\u003c/a\u003e on the 13th. I want to get all these pieces together for the demo, and of course I need to start seriously working on the slides.\u003c/p\u003e\n\n\u003ch2 id=\"patreon\"\u003ePatreon\u003c/h2\u003e\n\n\u003cp\u003eHow can open source work be sustainable? I’m struggling with this question. Obviously, being at a big Internet company is one solution, but I wanted more autonomy to choose what to work on. One \u003cem\u003epossible\u003c/em\u003e solution is asking for donations. I set up a \u003ca href=\"https://www.patreon.com/raphlinus\"\u003ePatreon page\u003c/a\u003e, more to see how I feel about it than to actually expect to bring in a lot of revenue.\u003c/p\u003e\n\n\u003cp\u003eAnd I’m still not sure how I feel about it. The process of setting it up was interesting; shortly after, I realized that it is parallel in many ways to performance reviews at companies like Google. You’re marketing yourself, making the case that your work is worthwhile and that people should fund it. Of course, there are differences, such as granularity of dollar amounts, and the ability to set your own tiers as opposed to working from a given ladder and rubrics, but I was struck by the similarities.\u003c/p\u003e\n\n\u003cp\u003eAlso, I’m not sure the description I wrote is most accurate in capturing the value I expect to create. Yes, I hope the software artifacts are useful, but I also feel that a lot of my time and energy is going into mentoring a subcommunity, which is basically a form of teaching (with, I think, particular advantages over traditional academic teaching roles, something I hope to blog about more). This blog also takes effort, and from the responses I’ve been getting, is something people appreciate.\u003c/p\u003e\n\n\u003cp\u003eI expect to use the Patreon more as signal, what kinds of things I work on that are valued enough by the community that people are willing to chip in a little money. In any case, if you want to support my work and encourage me to continue focus more on open source (as opposed to the game, which will be proprietary), my Patreon page is the way to do that.\u003c/p\u003e\n\n\u003ch2 id=\"vote\"\u003eVote\u003c/h2\u003e\n\n\u003cp\u003eI’m volunteering as a pollworker on Election Day. If you are eligible to vote, please do.\u003c/p\u003e\n\n\n  \u003c/div\u003e",
  "Date": "2018-11-04T14:42:42Z",
  "Author": "raphlinus"
}