{
  "Source": "www.evilsocket.net",
  "Title": "Why Reinventing the Wheel Isn't Always Wrong",
  "Link": "https://www.evilsocket.net/2014/04/21/Why-reinventing-the-wheel-isn-t-always-wrong/",
  "Content": "\u003cdiv class=\"content\" itemprop=\"articleBody\"\u003e\n\u003cp\u003eRecently I was talking with one of my colleagues about computer science and the skills of those who have just taken their degree in Italy. We both agreed that the kind of knowledge you get attending the college is indeed more theoretical than practical ( and trust me, “informatic engineering” courses in Italy colleges are way much more theoretical than CS in the United States ) and most of the times this results in a lot of people with their mouths full of “big words” they don’t really understand.\u003c/p\u003e\n\u003cspan id=\"more\"\u003e\u003c/span\u003e\n\u003cp\u003eI do not think this is just something related to our country, for instance I often read on web sites such as Stack Overflow answers like \u003cem\u003e“\u003ca target=\"_blank\" rel=\"noopener\" href=\"http://stackoverflow.com/questions/724096/disk-based-dynamic-memory-allocation\"\u003ehey dude, why implementing it yourself? Just use a database!\u003c/a\u003e“\u003c/em\u003e or \u003cem\u003e“there’s the whole STL library that can do this for you, why you should implement a RB-tree by yourself?”\u003c/em\u003e and so on, I’m sure you know what I’m talking about.\u003c/p\u003e\n\u003cp\u003eOf course studying the theory behind such things, data structures, algorithms and their complexities, etc is fundamental for a good engineer, but what about practice? What about reinventing the wheel, not because \u003cem\u003e“you can do better than STL guys”\u003c/em\u003e but just because \u003cem\u003e“I want to \u003cstrong\u003ereally\u003c/strong\u003e understand why they did what they did and \u003cstrong\u003ethe way\u003c/strong\u003e they did it.”\u003c/em\u003e ? And \u003cstrong\u003edo not\u003c/strong\u003e tell me that during your CS courses you’ve implemented everything, tried everything and came accross every problem you could find while developing because this is bullshit.\u003c/p\u003e\n\u003cp\u003eHow can you really understand why a hash table needs to be rehashed if you never implemented one and \u003cstrong\u003etried to optimize it\u003c/strong\u003e because you need it in a real world application?\u003c/p\u003e\n\u003cp\u003eHow can you really understand SQL indexes (and use them properly!) if you don’t know what data cardinality is and how it affects binary trees ?\u003c/p\u003e\n\u003cp\u003eHow can you really understand OS scheduling if you never tried to implement a minimal kernel yourself and saw the problematics behind it?\u003c/p\u003e\n\u003cp\u003eHow can you really understand the difference between reserved and committed memory if you never implemented even the simplest memory allocator just for the fuck of it?\u003c/p\u003e\n\u003cp\u003eI firmly think there are two kinds of knowledge, the one you \u003cstrong\u003ehave\u003c/strong\u003e because someone explained to you something and you understood it, and the one you \u003cstrong\u003eget\u003c/strong\u003e because you bang yourself against the same problems someone had decades ago and you find out the best solution for the problem, which of course it’s the same they found at their time … and trust me, this one is invaluable.\u003c/p\u003e\n\u003cp\u003eSo nextime someone will ask you why you keep reinventing the wheel, you can give him two good reasons for it:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBecause I \u003cstrong\u003ereally\u003c/strong\u003e want to understand how it works.\u003c/li\u003e\n\u003cli\u003eBecause no one will do better until someone will try to.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003ePS: And for fuck sake, people from Stack Overflow, \u003cstrong\u003estop\u003c/strong\u003e answering \u003cstrong\u003ered\u003c/strong\u003e if I’m asking for \u003cstrong\u003eblue\u003c/strong\u003e, just say you do not know (or don’t say anything at all, this would be better), no one is gonna cry for that!\u003c/p\u003e\n\u003c/div\u003e",
  "Date": "2014-04-21T20:11:25Z",
  "Author": "Simone Margaritelli"
}