{
  "Source": "www.evilsocket.net",
  "Title": "Thoughts on WhatsApp E2E Encryption AKA Security Is Real Only if It's the Default.",
  "Link": "https://www.evilsocket.net/2017/01/14/Thoughts-on-WhatsApp-E2E-Encryption-AKA-Security-is-real-only-if-it-s-the-default/",
  "Content": "\u003cdiv class=\"content\" itemprop=\"articleBody\"\u003e\n\u003cp\u003eYesterday \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://twitter.com/tobiasboelter\"\u003eTobias Boelter\u003c/a\u003e posted on his blog \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://tobi.rocks/2017/01/whatsapp-vulnerability-bug-or-backdoor/\"\u003ethis article\u003c/a\u003e which essentially highlights a message rentransmission vulnerability on WhatsApp which makes it leak sensitive information if the recipient’s key changed, only alerting the user \u003cstrong\u003eafter\u003c/strong\u003e the message has been sent.\u003cbr/\u003eThe Guardian has then picked up the info and posted the article “\u003ca target=\"_blank\" rel=\"noopener\" href=\"https://www.theguardian.com/technology/2017/jan/13/whatsapp-backdoor-allows-snooping-on-encrypted-messages\"\u003eWhatsApp vulnerability allows snooping on encrypted messages\u003c/a\u003e“. \u003c/p\u003e\n\u003cp\u003eIn a matter of hours, a shit load of experts (and unfortunately also lot of ppl who are \u003cstrong\u003enot\u003c/strong\u003e experts at all) pointed their fingers at The Guardian, arguing that it’s not a backdoor and all other kind of sterile polemics. At some point, Moxie from Open Whisper Systems, the noprofit organization who made \u003cstrong\u003eSignal\u003c/strong\u003e, the only really secure messaging app we’re aware of \u003cstrong\u003eand\u003c/strong\u003e the library that WhatsApp recently integrated in order to give E2E encrypted messaging to all of their users, published on the blog this: “\u003ca target=\"_blank\" rel=\"noopener\" href=\"https://whispersystems.org/blog/there-is-no-whatsapp-backdoor/\"\u003eThere is no WhatsApp ‘backdoor’\u003c/a\u003e“, which \u003cstrong\u003eseemed\u003c/strong\u003e to have put the word END to this conversation.\u003c/p\u003e\n\u003cp\u003eI do not agree and, since a lot of \u003cstrong\u003eego\u003c/strong\u003e is going on here, I’d like to share my thoughts as well.\u003c/p\u003e\n\u003cspan id=\"more\"\u003e\u003c/span\u003e\n\u003ccenter\u003e\n\u003cblockquote class=\"twitter-tweet\" data-lang=\"it\"\u003e\u003cp lang=\"en\" dir=\"ltr\"\u003e.\u003ca target=\"_blank\" rel=\"noopener\" href=\"https://twitter.com/guardian\"\u003e@guardian\u003c/a\u003e Pathetically, everyone who jumped to trumpet my tweets of a Telegram weakness will ignore this because WhatsApp staff stroked the right egos\u003c/p\u003e— Nadim Kobeissi (@kaepora) \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://twitter.com/kaepora/status/819893937934434304\"\u003e13 gennaio 2017\u003c/a\u003e\u003c/blockquote\u003e\n\u003cscript data-cfasync=\"false\" src=\"/cdn-cgi/scripts/5c5dd728/cloudflare-static/email-decode.min.js\"\u003e\u003c/script\u003e\u003cscript async=\"\" src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"\u003e\u003c/script\u003e\n\u003c/center\u003e\n\u003cp\u003eFirst thing first, following the \u003cstrong\u003ePoC||GTFO\u003c/strong\u003e sacrosanct principle, let’s take a look at the video that Tobias recently uploaded.\u003c/p\u003e\n\u003ccenter\u003e\n\u003ciframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/we-pJE5JjAs\" frameborder=\"0\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/center\u003e\n\u003cp\u003eIn the video Tobias just swapped the SIM card to the other phone to prove his point, but it’s quite clear that from a state sponsored attacker perspective, physical access to the sim card or the victim’s phone is not needed at all, there are plenty of easier ways for them to do that ( pretty much like \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://lists.cpunks.org/pipermail/cypherpunks/2016-April/012958.html\"\u003eRussia did with SS7 \u0026amp; Telegram users\u003c/a\u003e ).\u003c/p\u003e\n\u003cp\u003eLong story short, if WhatsApp technicians manage to replace your recipient E2E encryption key on the server side and impersonate him (or manage to clone his sim on the TELCO side), \u003cstrong\u003eyour sensitive message will be sent anyway\u003c/strong\u003e, the client will show you just a warning about the key change, but nevertheless, let’s say it again, \u003cstrong\u003eyour sensitive message will be sent anyway\u003c/strong\u003e … and they’ll be able to read it, \u003cstrong\u003eperiod\u003c/strong\u003e.\u003c/p\u003e\n\u003ccenter\u003e\n\u003cimg width=\"250\" src=\"https://whispersystems.org/blog/images/whatsapp-keychange.png\"/\u003e\n\u003c/center\u003e\n\u003cp\u003eOn the other hand, \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://play.google.com/store/apps/details?id=org.thoughtcrime.securesms\"\u003eSignal\u003c/a\u003e prevents this from happening, once it’ll detect the key being changed, it will \u003cstrong\u003eblock\u003c/strong\u003e the conversation and warn the user about it, it’ll be the user then to decide if trusting the new key or not, regardless, \u003cstrong\u003ethe sensitive contents won’t be rentransmitted without the user allowing it\u003c/strong\u003e, this is a subtle but very important detail.\u003c/p\u003e\n\u003ch3 id=\"But-it’s-just-a-matter-of-settings\"\u003e\u003ca href=\"#But-it’s-just-a-matter-of-settings\" class=\"headerlink\" title=\"But it’s just a matter of settings!\"\u003e\u003c/a\u003eBut it’s just a matter of settings!\u003c/h3\u003e\u003ccenter\u003e\n\u003cblockquote class=\"twitter-tweet\" data-lang=\"it\"\u003e\u003cp lang=\"en\" dir=\"ltr\"\u003equoting mr \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://twitter.com/csoghoian\"\u003e@csoghoian\u003c/a\u003e, this sentence quite fits in this whole WhatsApp / Guardian / \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://twitter.com/whispersystems\"\u003e@whispersystems\u003c/a\u003e discussion \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://t.co/DHEnmYqRrw\"\u003epic.twitter.com/DHEnmYqRrw\u003c/a\u003e\u003c/p\u003e— Simone Margaritelli (@evilsocket) \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://twitter.com/evilsocket/status/820100621898547201\"\u003e14 gennaio 2017\u003c/a\u003e\u003c/blockquote\u003e\n\u003cscript async=\"\" src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"\u003e\u003c/script\u003e\n\u003c/center\u003e\n\u003cp\u003eYes, they \u003cstrong\u003edo\u003c/strong\u003e implement the same protocol and \u003cstrong\u003eno\u003c/strong\u003e, we don’t have any real evidence that Facebook messed with it, \u003cstrong\u003estill\u003c/strong\u003e they created (either intentionally or not) a very serious security vulnerability for their users.\u003c/p\u003e\n\u003cp\u003eAnd it’s exactly about \u003cstrong\u003eintentionality\u003c/strong\u003e we’re talking about, if it was intentionally implelemented to spy on users \u003cstrong\u003eit’s a backdoor\u003c/strong\u003e, otherwise \u003cstrong\u003eit’s not a backdoor\u003c/strong\u003e … but \u003cstrong\u003ewe don’t know\u003c/strong\u003e, we never will and honestly it’s just a stupid and pointless waste of time discussing about it further.\u003c/p\u003e\n\u003ch3 id=\"Usability-Really\"\u003e\u003ca href=\"#Usability-Really\" class=\"headerlink\" title=\"Usability? Really?\"\u003e\u003c/a\u003eUsability? Really?\u003c/h3\u003e\u003cp\u003eBut the point is, \u003cstrong\u003ewhy implementing e2e encryption in the first place if when keys do not match what expected, the client transmits the message anyway?\u003c/strong\u003e Usability? \u003cstrong\u003eThe usability of what\u003c/strong\u003e? Because E2E encryption is \u003cstrong\u003enot\u003c/strong\u003e usable that way, the client itself might be, but definitely not the underlying protocol which should guarantee the users privacy \u003cstrong\u003eon top of everything else\u003c/strong\u003e.\u003c/p\u003e\n\u003cp\u003eMoreover, do you really expect the average whatsapp user to understand what that yellow baloon means if you don’t clearly block the conversation and warn him about what happened? Is this usability? COME ON!\u003c/p\u003e\n\u003cp\u003eI think Moxie just missed the point, which is \u003cstrong\u003enot\u003c/strong\u003e they key being changed, but the client retransmitting the message regardless!\u003cbr/\u003eI used to respect him for his life-long battle for privacy, but reading his post it’s quite clear how his opinion is biased towards Facebook.\u003c/p\u003e\n\u003ccenter\u003e\n\u003cblockquote class=\"twitter-tweet\" data-conversation=\"none\" data-lang=\"it\"\u003e\u003cp lang=\"en\" dir=\"ltr\"\u003e.\u003ca target=\"_blank\" rel=\"noopener\" href=\"https://twitter.com/guardian\"\u003e@guardian\u003c/a\u003e Whisper Systems comes to Facebook/WhatsApp\u0026#39;s defense on its own blog honestly not understanding the problem. Wow. \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://t.co/6EZ0K9Xcle\"\u003ehttps://t.co/6EZ0K9Xcle\u003c/a\u003e\u003c/p\u003e— Nadim Kobeissi (@kaepora) \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://twitter.com/kaepora/status/820028708803088385\"\u003e13 gennaio 2017\u003c/a\u003e\u003c/blockquote\u003e\n\u003cscript async=\"\" src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"\u003e\u003c/script\u003e\n\u003c/center\u003e\n\u003ch3 id=\"Conclusion\"\u003e\u003ca href=\"#Conclusion\" class=\"headerlink\" title=\"Conclusion\"\u003e\u003c/a\u003eConclusion\u003c/h3\u003e\u003cp\u003eI’m not a cryptographer of a crypto expert of any kind, but I’ve spent quite a few years working on MITM attacks and tools, I’m well aware how easy it is for \u003cstrong\u003eanyone\u003c/strong\u003e to exploit the information you leak on a network, and I’m well aware that state sponsored attackers have trillions of other ways to do that more easily and transparently (for the user of course) … we should just stop the drama about it being a backdoor or not and focus on what really matters:\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eIt is definitely a serious security issue for the users privacy and Facebook refused to fix it\u003c/strong\u003e.\u003c/p\u003e\n\u003cp\u003eThere’s really nothing more than that to say.\u003c/p\u003e\n\u003c/div\u003e",
  "Date": "2017-01-14T19:10:02Z",
  "Author": "Simone Margaritelli"
}