{
  "Source": "www.evilsocket.net",
  "Title": "Hacking Yourself Out of the Banking System and Live Only on BitCoin [EPISODE 2]",
  "Link": "https://www.evilsocket.net/2016/05/30/Hacking-Yourself-out-of-the-Banking-System-and-Live-only-on-BitCoins-EPISODE-2/",
  "Content": "\u003cdiv class=\"content\" itemprop=\"articleBody\"\u003e\n\u003cp\u003e\u003cimg src=\"/images/2016/05/btc.png\" alt=\"btc\"/\u003e\u003c/p\u003e\n\u003cp\u003eSince my \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://evilsocket.net/2016/05/08/Hacking-Yourself-out-of-the-Banking-System-and-Live-only-on-BitCoins/\"\u003elatest post about BitCoin\u003c/a\u003e went viral it also got published on \u003ca target=\"_blank\" rel=\"noopener\" href=\"http://qz.com/689365/im-giving-up-traditional-banks-and-living-on-bitcoin-and-you-can-too/\"\u003eQuartz\u003c/a\u003e, \u003ca target=\"_blank\" rel=\"noopener\" href=\"http://www.thememo.com/2016/05/24/ditching-bank-for-bitcoin-blockchain-banks-banking-simone-margaritelli/\"\u003eThe Memo\u003c/a\u003e and other various magazines.\u003cbr/\u003eSome people also asked me to keep writing about this and give them updates about my decision to ditch banks for BitCoin, so here I am :)\u003c/p\u003e\n\u003cp\u003eUnfortunately I’m still unable to fully avoid banks as I’m moving to another apartment and I need some money in my account, so at least for this month I had to get my wage sent to my main bank account, but within the next 1-2 months I’ll be able to move \u003cstrong\u003eall\u003c/strong\u003e of my assets to BTC.\u003c/p\u003e\n\u003cp\u003eIn the meantime, here’re some clarifications about my previous post and some more insights/updates.\u003c/p\u003e\n\u003cspan id=\"more\"\u003e\u003c/span\u003e\n\u003ch3 id=\"My-Current-Setup\"\u003e\u003ca href=\"#My-Current-Setup\" class=\"headerlink\" title=\"My Current Setup\"\u003e\u003c/a\u003eMy Current Setup\u003c/h3\u003e\u003cp\u003eAfter I tried different services I’ve finally decided my final setup, while this is not necessarly the best setup to use, chances are it’s definitely the most secure right now.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"/images/2016/05/btc_setup.png\" alt=\"My BitCoin Setup\"/\u003e\u003c/p\u003e\n\u003cp\u003eAs you can see, I configured my \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://www.bitwage.com/referral/PSBJCGWMAR4O\"\u003eBitWage\u003c/a\u003e account to receive the monthly paychecks from my employer ( I gave my employer the bank coordinates that BitWage provided me, he didn’t have to start using bitwage or any other platform rather than his usual banking system ) which are automatically converted to BTC and eventually sent directly to my Trezor hardware wallet.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"/images/2016/05/bitwage.png\" alt=\"Wage being sent to my BTC address\"/\u003e\u003c/p\u003e\n\u003cp\u003eOnce I have the BTC safely stored on my wallet, I move the quantity I need to spend (on a daily basis) on my \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://cryptopay.me/join/b5728364\"\u003eCryptoPay\u003c/a\u003e account and use the VISA debit card they sent me. During this month I was able to use the VISA to get some cash from a nearby ATM ( 99% of the world ATMs are enabled to use debit cards ), pay some restaurants, coffee, my Netflix subscription and so forth.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"/images/2016/05/visa.png\" alt=\"My BTC VISA debit card linked to CryptoPay\"/\u003e\u003c/p\u003e\n\u003cp\u003eI also had the chance to buy Amazon gift cards directly in BTC using \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://giftoff.com/affiliate/55af0d\"\u003eGiftOff.com\u003c/a\u003e, it was fast, easy and secure :)\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"/images/2016/05/giftoff.png\" alt=\"GiftOff\"/\u003e\u003c/p\u003e\n\u003cp\u003eFrom time to time I might need to do bank transfers myself in order to pay bills and my rent, for such purpose I’m using \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://bitwa.la/r/N3yjt9qeccjs4qCXc\"\u003eBitwala\u003c/a\u003e which has a very nice UI and it’s definitely easy to use, they will “transform” your BTC into either USD or EUR and perform a bank transfer for you.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"/images/2016/05/bitwala.png\" alt=\"Bitwa.la Account\"/\u003e\u003c/p\u003e\n\u003ch3 id=\"Security\"\u003e\u003ca href=\"#Security\" class=\"headerlink\" title=\"Security\"\u003e\u003c/a\u003eSecurity\u003c/h3\u003e\u003cp\u003eI know I already talked about these points, but \u003cstrong\u003esecurity is vital\u003c/strong\u003e, if you want to have all (or most) of your assets stored as BTC, you \u003cstrong\u003ehave\u003c/strong\u003e to use the most secure tools and policies you can, otherwise you might lose everything (hackers, malwares, no backups, you name it).\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eNever store all of your BTC online or on any wallet which is not a Trezor, only move the minimum amount you need every time.\u003c/li\u003e\n\u003cli\u003eUse a hardware wallet such as the Trezor.\u003c/li\u003e\n\u003cli\u003eEnable 2FA ( 2 Factory Authentication ) whenever you can.\u003c/li\u003e\n\u003cli\u003eBackup the recovery words of your hardware wallet in a safe, offline and possibly physical (online is not an option :D) place.\u003c/li\u003e\n\u003c/ol\u003e\n\u003ch3 id=\"Managing-Price-Volatility\"\u003e\u003ca href=\"#Managing-Price-Volatility\" class=\"headerlink\" title=\"Managing Price Volatility\"\u003e\u003c/a\u003eManaging Price Volatility\u003c/h3\u003e\u003cp\u003eOne thing I’ve been asked to clarify is how to manage price volatility, but what we exactly mean with “price volatility” anyway?\u003cbr/\u003eLong story short, when you \u003cstrong\u003ebuy\u003c/strong\u003e bit coins ( either converting your salary or actively buying them on some exchange ), there’s a specific price which is determined by the market, let’s say you just bought X bit coins which are worth 1000$ (the price you paid for them).\u003c/p\u003e\n\u003cp\u003eThat price might and \u003cstrong\u003ewill\u003c/strong\u003e change in time, so let’s say that after a week the price decreased and your X bit coins are now worth 900$ … you just lost 100$.\u003cbr/\u003eThe opposite might also happen of course, which would make you “earn” something if the price increases instead.\u003c/p\u003e\n\u003cp\u003eIf you have bills to pay, you can’t afford this volatility … what if you have 1000$ of bills to pay but the value of the BTC you have just dropped down to 900$ ?\u003c/p\u003e\n\u003cp\u003eKeep in mind that having all your money in BTC is mostly a long term investment, but there’re a few ways to ensure that small amounts of your belongings do not change their value so fast.\u003c/p\u003e\n\u003cp\u003eFor instance, if you know you have to pay 1000$ worth of bills, you might want to move all of them to your EUR/USD account on \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://cryptopay.me/join/b5728364\"\u003eCryptoPay\u003c/a\u003e ( or CoinBase or some exchange ) and keep them there until you spend them.\u003cbr/\u003eThis way they are “frozen” as a fiat currency and they won’t lose any value.\u003cbr/\u003eThere’re also services such as \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://uphold.com/\"\u003eUpHold\u003c/a\u003e that allow you to do that.\u003c/p\u003e\n\u003ch3 id=\"Tools\"\u003e\u003ca href=\"#Tools\" class=\"headerlink\" title=\"Tools\"\u003e\u003c/a\u003eTools\u003c/h3\u003e\u003cp\u003eIn addition to the services that I mentioned, there’re a few other tools I use almost daily.\u003c/p\u003e\n\u003ch5 id=\"Mycelium-Android-App\"\u003e\u003ca href=\"#Mycelium-Android-App\" class=\"headerlink\" title=\"Mycelium ( Android App )\"\u003e\u003c/a\u003eMycelium ( Android App )\u003c/h5\u003e\u003cp\u003eIf I need to pay for something while I’m not at home, I use the \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://play.google.com/store/apps/details?id=com.mycelium.wallet\"\u003eMycelium\u003c/a\u003e wallet since it’s the only one which correctly interacts with my Trezor using an OTG cable, I do \u003cstrong\u003enot\u003c/strong\u003e store my BTC on my smartphone, I just use Mycelium as an interface to the Trezor.\u003c/p\u003e\n\u003cdiv class=\"video-container\"\u003e\u003ciframe src=\"https://www.youtube.com/embed/g5lwtqsMoAI\" frameborder=\"0\" loading=\"lazy\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\u003c/div\u003e\n\u003ch5 id=\"Bitcoinity-Price-Graphs\"\u003e\u003ca href=\"#Bitcoinity-Price-Graphs\" class=\"headerlink\" title=\"Bitcoinity ( Price Graphs )\"\u003e\u003c/a\u003eBitcoinity ( Price Graphs )\u003c/h5\u003e\u003cp\u003eI constantly keep an eye on the BTC/EUR and BTC/USD prices, so I use \u003ca target=\"_blank\" rel=\"noopener\" href=\"http://bitcoinity.org/markets/coinbase/EUR\"\u003eBitCoinity\u003c/a\u003e in order to track different markets/exchanges.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"/images/2016/05/bitcoinity.png\" alt=\"Bitcoinity\"/\u003e\u003c/p\u003e\n\u003ch5 id=\"r-bitcoin-Reddit-for-News-and-Info-about-BitCoin\"\u003e\u003ca href=\"#r-bitcoin-Reddit-for-News-and-Info-about-BitCoin\" class=\"headerlink\" title=\"/r/bitcoin ( Reddit for News and Info about BitCoin )\"\u003e\u003c/a\u003e/r/bitcoin ( Reddit for News and Info about BitCoin )\u003c/h5\u003e\u003cp\u003e\u003ca target=\"_blank\" rel=\"noopener\" href=\"https://www.reddit.com/r/bitcoin\"\u003e/r/bitcoin\u003c/a\u003e is definitely my preferred way of getting news and various information about what’s happening in the BitCoin world … if I see a significant price increase in some BTC market, Reddit is the first place I go searching for news, comments and suggestions.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"/images/2016/05/reddit.png\" alt=\"BitCoin Reddit\"/\u003e\u003c/p\u003e\n\u003ch3 id=\"Questions\"\u003e\u003ca href=\"#Questions\" class=\"headerlink\" title=\"Questions?\"\u003e\u003c/a\u003eQuestions?\u003c/h3\u003e\u003cp\u003eThis is all I’ve got for now, if you have questions or suggestions please feel free to leave a comment and I’ll try to give you an answer ( or integrate your suggestion ) in the next episode :)\u003c/p\u003e\n\u003cp\u003eIf you have some spare BTC and wanna offer me a beer, this is my bitcoin account \u003ccode\u003e3Gef69VY8HdhsPghdbipMrepMCKHWukXd3\u003c/code\u003e :)\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"/images/2016/05/account.png\" alt=\"account\"/\u003e\u003c/p\u003e\n\u003c/div\u003e",
  "Date": "2016-05-30T15:43:43Z",
  "Author": "Simone Margaritelli"
}