{
  "Source": "www.evilsocket.net",
  "Title": "Autopwn Every Android \u003c 4.2 Device on Your Network Using BetterCap and the addJavascriptInterface Vulnerability.",
  "Link": "https://www.evilsocket.net/2016/01/18/Autopwn-every-Android-4-2-device-on-your-network-using-BetterCap-and-the-addJavascriptInterface-vulnerability/",
  "Content": "\u003cdiv class=\"content\" itemprop=\"articleBody\"\u003e\n\u003cp\u003eRecently I’ve been playing with Android’s WebView based vulnerabilities, focusing on how to exploit them using a MITM attack.\u003cbr/\u003eOne of the most interesting ones is the \u003cstrong\u003eaddJavascriptInterface\u003c/strong\u003e vulnerability ( \u003ca target=\"_blank\" rel=\"noopener\" href=\"http://www.cvedetails.com/cve/2012-6636\"\u003eCVE-2012-6636\u003c/a\u003e ) which affects every device running a version older than Android 4.2.\u003c/p\u003e\n\u003cspan id=\"more\"\u003e\u003c/span\u003e\n\u003cp\u003e\u003cstrong\u003eNOTE\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe original title of this post was \u003cstrong\u003eAutopwn every Android device on your network using BetterCap and the “addJavascriptInterface” vulnerability\u003c/strong\u003e and some people pointed out it’s a misleading title since “\u003cstrong\u003eevery Android != every Android \u0026lt; 4.2\u003c/strong\u003e“. I totally agree with them, it wasn’t intentional, the point of this post itself was not to show some uber 0day technique, but just to show how easy it is to use bettercap in order to exploit such type of vulnerabilities.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"/images/2016/01/hacked.jpg\" alt=\"hacked\"/\u003e\u003c/p\u003e\n\u003cp\u003eThere’s an \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://labs.mwrinfosecurity.com/blog/2013/09/24/webview-addjavascriptinterface-remote-code-execution/\"\u003eexcellent post\u003c/a\u003e about this vulnerability, long story short, if there’s an app which is using a \u003cstrong\u003eWebView\u003c/strong\u003e UI control and it’s declaring a custom javascript interface for it like so:\u003c/p\u003e\n\u003cscript data-cfasync=\"false\" src=\"/cdn-cgi/scripts/5c5dd728/cloudflare-static/email-decode.min.js\"\u003e\u003c/script\u003e\u003cscript src=\"https://gist.github.com/evilsocket/4f4deb1dbd1d66519dba.js\"\u003e\u003c/script\u003e\n\u003cp\u003eyou can inject some special javascript into that page and make that device execute any shell command you want.\u003c/p\u003e\n\u003cp\u003eIn this post, I’d like to show how easy it is to automatically exploit every vulnerable device on your network using \u003ca target=\"_blank\" rel=\"noopener\" href=\"http://www.bettercap.org/\"\u003ebettercap\u003c/a\u003e and for this purpose I’ve wrote the \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://github.com/evilsocket/bettercap-proxy-modules/blob/master/androidpwn.rb\"\u003eAndroidPwn\u003c/a\u003e transparent proxy module.\u003c/p\u003e\n\u003cscript src=\"https://gist.github.com/evilsocket/2e91719839d3fd6b06d6.js\"\u003e\u003c/script\u003e\n\u003cp\u003eAs you can see, you just need to activate it and specify a \u003ccode\u003e--command COMMAND\u003c/code\u003e command line argument and you’re ready to go.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"/images/2016/01/androidpwn-1.png\" alt=\"androidpwn\"/\u003e\u003c/p\u003e\n\u003cp\u003eLeave it running and it will automatically perform a Man-In-The-Middle attack on your network and execute the command(s) you’ve chosen on every single Android device it will find on the network.\u003c/p\u003e\n\u003c/div\u003e",
  "Date": "2016-01-18T19:27:40Z",
  "Author": "Simone Margaritelli"
}