{
  "Source": "www.evilsocket.net",
  "Title": "About (Re)distributing Open Source Apps ( dSploit )",
  "Link": "https://www.evilsocket.net/2014/03/25/About-re-distributing-open-source-apps-dSploit/",
  "Content": "\u003cdiv class=\"content\" itemprop=\"articleBody\"\u003e\n\u003cp\u003eIt’s a while I see compiled dSploit versions pop up on Google Play Store, most of the times the actual changes are \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://play.google.com/store/apps/details?id=com.number5.netcut\"\u003ejust a matter of icons\u003c/a\u003e, other times are merely \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://play.google.com/store/apps/details?id=com.anstudios.dsploit\"\u003ecompiled versions\u003c/a\u003e of one of the nightly releases.\u003c/p\u003e\n\u003cp\u003eAltough I can not ( and really don’t want to ) avoid this, I’d like to write a few lines about this kind of conduct and the ethics behind open source software.\u003c/p\u003e\n\u003cp\u003eAs most of my personal projects, dSploit was released from the beginning under the \u003ca target=\"_blank\" rel=\"noopener\" href=\"http://www.gnu.org/licenses/quick-guide-gplv3.html\"\u003eGPL 3\u003c/a\u003e license, this means that you can modify it at your own will, distribute it for free or even as a paid software and share it with your friends.\u003cbr/\u003eYou are \u003cstrong\u003eonly\u003c/strong\u003e asked to make your changes available under the same license and make references to the original authors of the software itself. That’s it, this is \u003cstrong\u003eso\u003c/strong\u003e simple.\u003c/p\u003e\n\u003cp\u003eBeyond the fact I find deeply unfair not putting even the smallest link to the original repository or some credits on the description of those compiled distributions, there are a few things anyone who wants to make such thing should be aware of before blindly cloning the repository and compiling the source code.\u003c/p\u003e\n\u003cspan id=\"more\"\u003e\u003c/span\u003e\n\u003ch4 id=\"BugSense-Identifier\"\u003e\u003ca href=\"#BugSense-Identifier\" class=\"headerlink\" title=\"BugSense Identifier\"\u003e\u003c/a\u003eBugSense Identifier\u003c/h4\u003e\u003cp\u003eStarting from one of its first versions, dSploit uses \u003ca target=\"_blank\" rel=\"noopener\" href=\"http://bugsense.com/\"\u003eBugSense\u003c/a\u003e free service to track unexpected application exceptions (crashes). There’s a \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://github.com/evilsocket/dsploit/blob/8ae6b0f04152b86717eae6d89ea04f3f1befc865/dSploit/src/it/evilsocket/dsploit/DSploitApplication.java#L53\"\u003especific string\u003c/a\u003e used by BS to identify the application itself and its many versions, if you just clone and compile the repo I will receive aggregated notifications both from my version and from yours, making it difficult for me to track down bugs causes … so please, \u003cstrong\u003efork it\u003c/strong\u003e and \u003cstrong\u003emodify this\u003c/strong\u003e identifier, or remove it if you don’t want to use bugsense.\u003c/p\u003e\n\u003ch4 id=\"Signed-APK-Conflicts\"\u003e\u003ca href=\"#Signed-APK-Conflicts\" class=\"headerlink\" title=\"Signed APK Conflicts\"\u003e\u003c/a\u003eSigned APK Conflicts\u003c/h4\u003e\u003cp\u003eAs you probably already know, dSploit has its own update mechanism based on a \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://github.com/evilsocket/update.dsploit.net\"\u003efreely available\u003c/a\u003e web application, so when a new release is available I compile the source code, \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://developer.android.com/tools/publishing/app-signing.html\"\u003esign the package\u003c/a\u003e with my own signature key and finally I upload the signed app to the update server which distributes it to everyone.\u003cbr/\u003eYou are probably (surely unless you have access to my pc, in that case please let me know :P) using \u003cstrong\u003eyour own\u003c/strong\u003e signature key to create the final apk you uploaded to the store … you know what ? If someone installs your version and then I upload a new release, they will start the update process ( since the update server url you are using it’s the official one ) at the end of the which the user will see an error due to signature conflicts … guess who’s gonna receive dozens of emails from github notifying him of new issues being opened for that ? \u003cstrong\u003eMe\u003c/strong\u003e.\u003cbr/\u003eSo please, at least modify the \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://github.com/evilsocket/dsploit/blob/1404fc1ad04dcab6789a5b4bbae3b27d281731c1/dSploit/src/it/evilsocket/dsploit/core/UpdateService.java#L56\"\u003eupdate urls\u003c/a\u003e using your own.\u003c/p\u003e\n\u003ch4 id=\"Bandwidth\"\u003e\u003ca href=\"#Bandwidth\" class=\"headerlink\" title=\"Bandwidth\"\u003e\u003c/a\u003eBandwidth\u003c/h4\u003e\u003cp\u003eBesides updates, dSploit needs to download other (big) files such as a precompiled metasploit distribution, dictionary files for the wifi cracking module and so on … \u003cstrong\u003eI pay\u003c/strong\u003e for the bandwidth since dsploit.net is hosted on a dedicated server, please \u003cstrong\u003edo not abuse it\u003c/strong\u003e, modify the update urls.\u003c/p\u003e\n\u003ch4 id=\"Reliability\"\u003e\u003ca href=\"#Reliability\" class=\"headerlink\" title=\"Reliability\"\u003e\u003c/a\u003eReliability\u003c/h4\u003e\u003cp\u003eThis being said, \u003cstrong\u003eI strongly\u003c/strong\u003e discourage pleople from downloading other distributions unless a specific reference to the modifications is provided, remember you are allowing the application to run with \u003cstrong\u003eroot\u003c/strong\u003e privileges, this is not something you really want if you are not 100% sure of what it \u003cstrong\u003ereally\u003c/strong\u003e does under the hood, or unless you have basic Android reverse reverse engineering skills and you can verify it by your own.\u003c/p\u003e\n\u003cp\u003ePeace.\u003c/p\u003e\n\u003c/div\u003e",
  "Date": "2014-03-24T23:07:53Z",
  "Author": "Simone Margaritelli"
}