{
  "Source": "www.evilsocket.net",
  "Title": "How TELCOs Are Bullying Researchers, an Italian Story.",
  "Link": "https://www.evilsocket.net/2014/07/15/How-TELCOs-are-bullying-researchers-an-italian-story/",
  "Content": "\u003cdiv class=\"content\" itemprop=\"articleBody\"\u003e\n\u003cp\u003eThose of you following my blog from the beginning, know that I was actively involved in the router hacking scene, mostly during the period in which I wrote the very first implementations of both \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://snipt.net/evilsocket/script-per-il-calcolo-della-chiave-wpa-dei-router-alice-gate-voip-2-plus-wi-fi/\"\u003eTelecom Alice\u003c/a\u003e ( and \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://snipt.net/evilsocket/alice-router-unlocker/\"\u003ethis\u003c/a\u003e ) and \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://snipt.net/evilsocket/script-per-il-calcolo-della-chiave-wpa-dei-router-fastweb-pirelli/\"\u003eFastweb\u003c/a\u003e routers WPA key calculators and unlockers after the \u003cstrong\u003egreat\u003c/strong\u003e reversing job performed by another \u003ca target=\"_blank\" rel=\"noopener\" href=\"http://wifiresearchers.wordpress.com/\"\u003eitalian group\u003c/a\u003e.\u003cbr/\u003eThose scripts allowed anyone to unlock hidden services in their routers ( as for the Alice scripts ) and to compute default WPA keys having just basic informations such as mac addresses, etc, demonstrating how broken the end-user security policies were.\u003c/p\u003e\n\u003cp\u003eDespite the fact I received in the past more than one intimidatory email from representatives of those two companies, I’ve never wrote or talked about that … I was smarter enough to understand that this kind of legal bullshit is better to be ignored, unless you have done something \u003cstrong\u003etruly\u003c/strong\u003e illegal.\u003c/p\u003e\n\u003cspan id=\"more\"\u003e\u003c/span\u003e\n\u003cp\u003eToday I’ve received a private message from a friend of mine ( I’m not going to write his name ), he asked me to spread the word about something very familiar to me.\u003cbr/\u003eThe italian message can be \u003ca target=\"_blank\" rel=\"noopener\" href=\"http://pastebin.com/42jn1dHm\"\u003efound here\u003c/a\u003e, here’s (my) English translation, as usual I apologize for crappy English:\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003eJust out of the blue.\n\nThere\u0026#39;s no other definition for what happened today to our community of http://ilpuntotecnicoeadsl.com/.\nIt\u0026#39;s been years since we develop and port alternative firmwares on home routers from ADB,\nDial-Face Industries, Sercomm, Dlink and others.\nAll of these routers are **sold** from TELCOs with **strong restrictions** about the freedom of\nconfiguration, restrictions that we seek to circumvent installing alternative firmwares that\nwe design in a **totally legal** way.\n\nThis morning the administrators of our community received an email from a Vodafone Omnitel legal\nrepresentative telling them that our forum board contains topics about their new Vodafone Station 2\nthat are violating their software license and thus are illegal.\n\nThey\u0026#39;re accusing us of having illegally reverse engineered their software, which is not true at all,\nand they\u0026#39;re asking us to remove those posts.\nJust for the record, those posts are just a bunch of Wireshark dumps of a PPPoE connection between\nthe Vodafone Station and the optical fiber media converter.\n\nThose \u0026#34;gentlemen\u0026#34; forgot about one thing, THEIR software clearly violates the GPL license, being\nbased upon the Linux kernel and GNU applications, since they\u0026#39;re not releasing sources of their own\ncustomizations, as the license itself requires.\n\nI ask you to share this message, trying to catch the \u0026#34;medias interest\u0026#34;, in the name of digital\nfreedom, against the excessive power those huge companies have.\n\nThank you,   \nA Forum user.\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eI have nothing to add, this is quite self explanatory … if you’re against this kind of “corporate cyberbullying”, please spread the word as I did.\u003c/p\u003e\n\u003c/div\u003e",
  "Date": "2014-07-15T21:22:40Z",
  "Author": "Simone Margaritelli"
}