{
  "Source": "www.evilsocket.net",
  "Title": "Un Po Di Consigli per Aspiranti Professionisti Del Settore Della Sicurezza Informatica",
  "Link": "https://www.evilsocket.net/2016/10/02/Un-po-di-consigli-per-aspiranti-professionisti-del-settore-della-sicurezza-informatica/",
  "Content": "\u003cdiv class=\"content\" itemprop=\"articleBody\"\u003e\n\u003cp\u003eRecentemente è stata pubblicata \u003ca target=\"_blank\" rel=\"noopener\" href=\"http://motherboard.vice.com/it/read/intervista-hacker-italiano-evilsocket\"\u003euna mia intervista\u003c/a\u003e su Motherboard di VICE e appena qualche ora dopo ho iniziato a ricevere un quantitativo stupefacente di email da persone che chiedevano fondamentalmente tutte la stessa cosa, un po di consigli per aspiranti professionisti nel settore della sicurezza informatica.\u003c/p\u003e\n\u003cp\u003eConsiderando che rispondere individualmente ad ogni email sarebbe poco fattibile ho allora deciso di scrivere un post nel quale raccogliere alcuni di questi consigli.\u003cbr/\u003eSe per alcuni di voi lettori dovessero sembrare delle banalità, mi scuso fin da subito, ma l’età di chi mi ha mandato quelle email è molto varia, così come il loro background professionale, quindi volerò abbastanza basso ed elencherò solo alcune delle basi.\u003c/p\u003e\n\u003cp\u003eChiedo anche scusa fin da subito per gli errori di sintassi, grammatica e via dicendo. Non sono abituato a scrivere in Italiano, non sono abituato a scrivere cose non tecniche e soprattutto non sono uno scrittore :D\u003c/p\u003e\n\u003cspan id=\"more\"\u003e\u003c/span\u003e\n\u003ch3 id=\"Non-e-come-nei-film\"\u003e\u003ca href=\"#Non-e-come-nei-film\" class=\"headerlink\" title=\"Non è come nei film\"\u003e\u003c/a\u003eNon è come nei film\u003c/h3\u003e\u003cp\u003ePrima di tutto, mettetevi bene in testa questa cosa, lavorare nel mondo della sicurezza \u003cstrong\u003enon è come nei film\u003c/strong\u003e. Se vi siete interessati a questo percorso perchè “Matrix è figo” o perchè volete diventare come Elliot di Mr. Robot ( iniziate con la morfina se proprio dovete, poi ne riparliamo ), fidatevi che la cosa non fa per voi :D\u003c/p\u003e\n\u003cp\u003eConsiderate questo scenario:\u003c/p\u003e\n\u003cp\u003eLavorate sul vostro target ( che può essere il reversing di un applicazione, il pentest su la rete di un cliente, la scrittura di un exploit … qualsiasi cosa ) da giorni, e da altrettanti giorni praticamente non vi lavate. Siete incollati al computer da innumerevoli ore e vi staccate solo per andare al bagno e, quando proprio ne avete bisogno, dormire qualche ora. Avete consumato i vostri pasti davanti al computer usando una mano sola, anche il vostro animale domestico vi schifa per quanto puzzate e si sta facendo sempre più difficile trattenere quella pipì che sono almeno quattro ore che vi scappa … eppure continuate, quello schermo è tutto quello che vedete e sarà così finchè non avrete raggiunto il vostro obiettivo.\u003c/p\u003e\n\u003cp\u003eSe l’idea ( che ammetto essere un po esagerata, ma nemmeno tanto :D ) vi spaventa, o se pensate che non arrivereste mai a quel punto per quella che in fondo è “una scatola con uno schermo”, mi dispiace. Non volevo distruggere i vostri sogni, ma come vi avevo detto \u003cstrong\u003enon è come nei film\u003c/strong\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"/images/2016/10/social_life.jpg\" alt=\"social life\"/\u003e\u003c/p\u003e\n\u003cp\u003eSe invece fate parte di quella “minoranza minorata” che vede questa situazione come accettabile e anzi, si fomenta solo al pensiero, trovatevi un bravo dottore! Ehm, volevo dire, benvenuti nel club :D\u003c/p\u003e\n\u003ch3 id=\"Coltivate-la-vostra-Curiosita\"\u003e\u003ca href=\"#Coltivate-la-vostra-Curiosita\" class=\"headerlink\" title=\"Coltivate la vostra Curiosità\"\u003e\u003c/a\u003eColtivate la vostra Curiosità\u003c/h3\u003e\u003cp\u003eAccettate fin da subito il fatto che \u003cstrong\u003estudierete per la maggior parte della vostra vita\u003c/strong\u003e.\u003cbr/\u003eMai sentito dire “non si finisce mai di imparare” ? Beh, non avete la minima idea di quanto sia sacrosanto questo modo di dire nel mondo dell’informatica. Anche i più grandi professionisti di questo settore, anzi soprattutto loro, studiano costantemente nuove cose, imparano, assorbono e rielaborano.\u003cbr/\u003eQuindi va da se che se non siete \u003cstrong\u003ecuriosi\u003c/strong\u003e per natura, se non vi chiedete il perchè di ogni cosa e non vi ostinate a studiare finchè non lo sapete, per voi sarà una vita veramente difficile e frustrante, perchè \u003cstrong\u003eleggerete per memorizzare, non per capire\u003c/strong\u003e. Quello che fate vi deve piacere e proprio tanto, solo a quel punto lo studio diventerà ricerca, le ore passate al computer saranno un investimento su voi stessi e i risultati inizieranno ad arrivare.\u003c/p\u003e\n\u003cp\u003eColtivate la vostra curiosità, ponetevi delle domande, cercate (quasi morbosamente) le risposte e divertitevi mentre lo fate.\u003c/p\u003e\n\u003ch3 id=\"Imparate-la-lingua-Inglese\"\u003e\u003ca href=\"#Imparate-la-lingua-Inglese\" class=\"headerlink\" title=\"Imparate la lingua Inglese\"\u003e\u003c/a\u003eImparate la lingua Inglese\u003c/h3\u003e\u003cp\u003ePer quanto mi pare assurdo dover dare questo consiglio nel 2016, dalle email che ho ricevuto e per alcuni casi di persone che ho incontrato, ho capito che bisogna (ancora) farlo.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"/images/2016/10/renzi.jpg\" alt=\"shish\"/\u003e\u003c/p\u003e\n\u003cp\u003eLa stragrande maggioranza della documentazione tecnica è in inglese, i più importanti progetti open source sono commentati in inglese, alcuni dei libri migliori si trovano solo in inglese, cazzo perfino \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://it.wikipedia.org/wiki/Alan_Turing\"\u003eAlan Turing\u003c/a\u003e era inglese (se non capite il perchè di questa ultima frase, capitelo! ) … \u003cstrong\u003edovete imparare la lingua inglese\u003c/strong\u003e, \u003cem\u003eface it\u003c/em\u003e!\u003c/p\u003e\n\u003cp\u003eNon serve che componiate sonetti in inglese o che, fin da subito, sappiate intrattenere una conversazione con Bob che abita dall’altra parte del mondo, ma è fondamentale che sappiate \u003cstrong\u003ecercare\u003c/strong\u003e tra informazioni in inglese e, soprattutto, capirle quando le leggete.\u003c/p\u003e\n\u003cp\u003eCome si dice dalle mie parti, “mettetece ‘na pezza!” :D\u003c/p\u003e\n\u003ch3 id=\"Imparate-ad-usare-Google\"\u003e\u003ca href=\"#Imparate-ad-usare-Google\" class=\"headerlink\" title=\"Imparate ad usare Google\"\u003e\u003c/a\u003eImparate ad usare Google\u003c/h3\u003e\u003cp\u003eOra che siete diventati \u003cstrong\u003ecuriosi\u003c/strong\u003e e che avete \u003cstrong\u003eimparato l’inglese\u003c/strong\u003e, avete acquisito un buon 80% della capacità di districarvi tra il mare di informazioni della rete. Il restante 20% che vi manca consiste nell’imparare ad usare Google (o qualsiasi altro motore di ricerca degno di questo nome) che, per quanto possa sembrarvi banale, vi aprirà le porte di tutto ciò che mai vi potrà servire durante il vostro percorso tecnico/professionale.\u003cbr/\u003eSi dice che “non esistono domande stupide”, per quanto mi riguarda le domande stupide sono quelle che prima non hai fatto a Google.\u003c/p\u003e\n\u003cp\u003eSe non trovate la risposta alla vostra domanda, il più delle volte avete cercato male, \u003cem\u003ekeep searching\u003c/em\u003e ;)\u003c/p\u003e\n\u003ch3 id=\"Studiate-le-basi-e-studiatele-ORA\"\u003e\u003ca href=\"#Studiate-le-basi-e-studiatele-ORA\" class=\"headerlink\" title=\"Studiate le basi e studiatele ORA\"\u003e\u003c/a\u003eStudiate le basi e studiatele ORA\u003c/h3\u003e\u003cp\u003eIl computer è uno strumento, i programmi che girano al suo interno sono strumenti, internet stessa è uno strumento e, come per ogni altro strumento, dovete imparare a capire come funzionano, a cosa servono i suoi vari pezzi, quando usarne uno piuttosto che un’altro e via dicendo.\u003cbr/\u003eCome la racchetta diventa l’estensione del braccio del tennista, dovete far diventare questi vostri strumenti un’estensione del vostro cervello e l’unico modo è capire come funzionano.\u003c/p\u003e\n\u003cp\u003ePer quanto non sono un fan dei libri tecnici e metto (quasi) sempre la pratica prima della teoria, ce ne sono molti che vi faranno risparmiare mesi, a volte anni, di ricerche nella rete tra informazioni sparpagliate.\u003c/p\u003e\n\u003cp\u003e\u003ca target=\"_blank\" rel=\"noopener\" href=\"https://www.amazon.it/s/ref=sr_nr_p_lbr_books_authors__0?fst=as:off\u0026amp;rh=n:411663031,k:tanenbaum,p_lbr_books_authors_browse-bin:Andrew+S.+Tanenbaum\u0026amp;keywords=tanenbaum\u0026amp;ie=UTF8\u0026amp;qid=1475422166\u0026amp;rnid=2150412031\"\u003eBuona lettura\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eE’ importante che cominciate fin da subito, le stesse identiche cose saranno più difficili da assorbire in futuro quando nella vostra testa ce ne saranno già un mare e con loro, a volte, delle nozioni sbagliate di come queste funzionino veramente.\u003cbr/\u003eIo ve lo dico, più andate avanti senza le basi, più probabilmente dovrete \u003cstrong\u003edisimparare\u003c/strong\u003e mentre le studiate.\u003c/p\u003e\n\u003ch3 id=\"Imparate-almeno-due-linguaggi-di-programmazione\"\u003e\u003ca href=\"#Imparate-almeno-due-linguaggi-di-programmazione\" class=\"headerlink\" title=\"Imparate almeno due linguaggi di programmazione.\"\u003e\u003c/a\u003eImparate almeno due linguaggi di programmazione.\u003c/h3\u003e\u003cp\u003eCi sono due scuole di pensiero in merito: c’è chi dice che la programmazione è fondamentale per entrare nel mondo della sicurezza e c’è invece chi dice che non serve necessariamente … io faccio parte della prima categoria.\u003c/p\u003e\n\u003cp\u003eImparare a programmare un computer significa mettere finalmente in pratica quello che si ha imparato di come funziona, è “l’esercizio finale” che che unisce teoria e pratica … inoltre la programmazione si dimostrerà essere la migliore alleata, fidatevi! ;)\u003c/p\u003e\n\u003cp\u003eIniziate con il \u003cstrong\u003eC\u003c/strong\u003e (o l’Assembly x86 se siete proprio masochisti), non tanto perchè dovete diventare degli assi con questo linguaggio, ma perchè è quello che, secondo la mia opinione, concilia meglio “il basso livello” (cioè come ragiona la macchina) con ”l’alto livello” (cioè come ragionate voi). Ha una sintassi che si può leggere senza avere attacchi epilettici ogni due righe eppure espone elegantemente i concetti di puntatore, stack, heap, allineamento della memoria e tutte queste cose carine che diventeranno il vostro pane se e quando inizierete a scrivere exploit, reversare un’applicazione, ecc :)\u003c/p\u003e\n\u003cp\u003eOltre a farvi i pipponi mentali su come funziona un calcolatore, direi che è anche arrivata l’ora di piegarlo al vostro volere e fargli fare quello che volete voi, non trovate?\u003cbr/\u003eCi sono operazioni che fate manualmente ogni giorno e che possono essere automatizzate, informazioni che possono essere trovate meglio e più velocemente, insomma, vi serve anche un \u003cstrong\u003elinguaggio di scripting\u003c/strong\u003e.\u003c/p\u003e\n\u003cp\u003eQui potete scegliere tra \u003cstrong\u003ePython\u003c/strong\u003e, \u003cstrong\u003eRuby\u003c/strong\u003e e compagnia bella, non fa molta differenza onestamente, c’è anche chi usa \u003cstrong\u003ePHP\u003c/strong\u003e come linguaggio di scripting da terminale. Per quanto questo possa sembrare bizzarro dato che il PHP storicamente è utilizzato quasi solo per applicazioni web, impararlo ed usarlo come \u003cstrong\u003eprimo\u003c/strong\u003e (mi raccomando, il \u003cstrong\u003eprimo\u003c/strong\u003e, non fermatevi al PHP se volete studiarlo) vostro “coltellino svizzero” sarebbe prendere due piccioni con una fava: starete imparando il vostro primo linguaggio di scripting \u003cstrong\u003ee\u003c/strong\u003e starete imparando come funziona un buon 90% delle applicazioni web che forse, un giorno, vi troverete a dover “penetrare”.\u003c/p\u003e\n\u003ciframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/GmMXL6w-Y5A\" frameborder=\"0\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003ch3 id=\"Scrivete-e-o-studiate-delle-utilities-di-rete\"\u003e\u003ca href=\"#Scrivete-e-o-studiate-delle-utilities-di-rete\" class=\"headerlink\" title=\"Scrivete e/o studiate delle utilities di rete.\"\u003e\u003c/a\u003eScrivete e/o studiate delle utilities di rete.\u003c/h3\u003e\u003cp\u003eCome avrete già capito, il mio è un approccio atipico perchè è molto orientato alla pratica. Sono un forte sostenitore del concetto secondo il quale imparare qualcosa con la pratica sarà sempre più efficace che un approccio prettamente accademico/teorico, non è necessariamente il punto di vista giusto, ma quantomeno è quello che con me funziona meglio :)\u003c/p\u003e\n\u003cp\u003eOra che avete capito come funziona un pc e che sapete programmarlo come vi pare, è arrivato il momento di capire come i vari pc comunicano tra loro usando la rete, quindi perchè non iniziare a scrivere la vostra prima utility di rete?\u003c/p\u003e\n\u003cp\u003eSe proprio non avete idee/fantasia, potete studiare il codice sorgente di cose come \u003cstrong\u003etelnet\u003c/strong\u003e, \u003cstrong\u003enetcat\u003c/strong\u003e, \u003cstrong\u003edig\u003c/strong\u003e, \u003cstrong\u003ewget\u003c/strong\u003e, \u003cstrong\u003ecurl\u003c/strong\u003e e chi più ne ha più ne metta. Le idee vi verranno, avrete voglia di migliorarli o modificarli per il vostro utilizzo specifico, inizierete a scrivere codice.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"/images/2016/10/oss.jpg\" alt=\"open source\"/\u003e\u003c/p\u003e\n\u003ch3 id=\"Non-Arrendetevi\"\u003e\u003ca href=\"#Non-Arrendetevi\" class=\"headerlink\" title=\"Non Arrendetevi\"\u003e\u003c/a\u003eNon Arrendetevi\u003c/h3\u003e\u003cp\u003eIntendiamoci, all’inizio ci saranno imprecazioni, un’alternanza di sensazioni tipo “o mio dio cosa sta succedendo a questo computer?!” e “io sono DIO!!!!”, tanti di quei bug da pagare una piccola nazione di programmatori per fixarli ma soprattutto \u003cstrong\u003emomenti nei quali avrete voglia di mollare\u003c/strong\u003e.\u003cbr/\u003eNon siete perfetti, il vostro codice non è perfetto e non lo sarà mai, il vostro cervello ha bisogno di tempo e metodo per assorbire tutte queste cose, accettatelo ma continuate comunque a perseguire quella perfezione, è questo il segreto ;)\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"/images/2016/10/cat.jpg\" alt=\"cat\"/\u003e\u003c/p\u003e\n\u003cp\u003eSarete stupiti da quanto ancora possiate imparare indipendentemente dalla vostra età, condizione sociale o titolo di studio … dipende solo dalla vostra \u003cstrong\u003ecuriosità\u003c/strong\u003e e \u003cstrong\u003etenacia\u003c/strong\u003e.\u003c/p\u003e\n\u003ch3 id=\"Fatto\"\u003e\u003ca href=\"#Fatto\" class=\"headerlink\" title=\"Fatto!\"\u003e\u003c/a\u003eFatto!\u003c/h3\u003e\u003cp\u003eEbbene si, abbiamo finito :)\u003c/p\u003e\n\u003cp\u003eVi state chiedendo dove è la lista di “tool super segreti per hackerare ogni cosa”? O forse dove sono tutte quelle informazioni più specifiche sulla sicurezza?\u003c/p\u003e\n\u003cp\u003eAl di là del fatto che se avete più di dodici anni dovreste lavorare un po sulla vostra ingenuità ( :D ), la risposta a queste domande è anche la sintesi del mio ultimo consiglio: accettate il fatto che \u003cstrong\u003enon ci sono scorciatoie\u003c/strong\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"/images/2016/10/pill.jpg\" alt=\"pill\"/\u003e\u003c/p\u003e\n\u003cp\u003eNon ci sono tutorial magici che vi faranno diventare “hacker in tre settimane”, neanche libri così completi da insegnarvi tutto quello che c’è da sapere. Dovrete imparare cercare, organizzare, gestire le informazioni e il vostro modo di assorbirle, questo richiede inevitabilmente tempo, dedizione e, come ho già abbondantemente detto, \u003cstrong\u003ecuriosità\u003c/strong\u003e.\u003c/p\u003e\n\u003c/div\u003e",
  "Date": "2016-10-02T16:39:08Z",
  "Author": "Simone Margaritelli"
}