{
  "Source": "www.evilsocket.net",
  "Title": "Hackers Phishing Leakers: A New BitCoin Phishing Social Technique.",
  "Link": "https://www.evilsocket.net/2015/02/11/Hackers-Phishing-Leakers-A-new-BitCoin-phishing-social-technique/",
  "Content": "\u003cdiv class=\"content\" itemprop=\"articleBody\"\u003e\n\u003cp\u003eRecently I’m playing with a simple \u003cstrong\u003epastebin\u003c/strong\u003e bot, basicaly it’s a crawler for the pastebin.com website that applies a few regular expressions to new pastes and saves interesting ones. Services like this are all around the internet, one example is the \u003ca target=\"_blank\" rel=\"noopener\" href=\"http://www.leakedin.com/\"\u003eleakedin\u003c/a\u003e website where you can find potential data leaks almost in real time and it’s not new that hackers are already crawling for this kind of contents waiting for dumps, leaks or any sort of interesting data to use for malicious purposes.\u003c/p\u003e\n\u003cp\u003eWhile collecting data with my bot, I found something which is very interesting and potentially a \u003cstrong\u003ewhole new phishing/social technique\u003c/strong\u003e that I never saw before.\u003c/p\u003e\n\u003cspan id=\"more\"\u003e\u003c/span\u003e\n\u003cp\u003e\u003cstrong\u003eSomeone is periodically posting contents like the following\u003c/strong\u003e on pastebin.com ( sample taken from \u003ca target=\"_blank\" rel=\"noopener\" href=\"http://pastebin.com/vBtmseA8\"\u003ehere\u003c/a\u003e ):\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003eJIHAD ACHMED presents to you\nWith a dump of beta accounts from\nthebitcoinshop.pixub.com\n\nClaimed to be \u0026#34;Secure Cold Storage\u0026#34; Lets see how\n\u0026#34;Secure\u0026#34; they are now when all 50 of their Beta\nAccounts get leaked!\n\n\npassword / email\n\n... REDACTED USER / PASSWORD LIST ...\n\nAbout Bitcoin-Value Storage\n\nFirstly, we want to appologize for the website being cookie cutter. But we belive that Service comes\nBEFORE Looks!\nBitcoin-Value Storage started when we realized that people could trace how much came to the addresses\nwe were using. When we wanted to have long term cold storage we realized that anyone who was tracking\nour addresses would realize exactly how much we were putting into cold storage.\nTo resolve this we decided to create Bitcoin-Value Storage. Enabling secure semi cold storage through\nconstant washing of bitcoins through multiple wallets, and servers.\nWhen coins are in our storage they are never sent to the same address twice. They are shuffled through\nmultiple servers.\nOur servers come online a few times a week to keep their blockchain up to date and process any\ntransactions that are required. Only wallets that have pending withdrawls come online durring this time\nto be updated. Otherwise the washing occurs randomly from your wallet on one server, to your wallet\non another server.\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eThe redacted part is a space separated usernames and passwords list of \u003cstrong\u003ealleged\u003c/strong\u003e beta accounts to the “thebitcoinshop” website which is \u003cstrong\u003eapparently\u003c/strong\u003e a \u003cstrong\u003eBitCoin trading\u003c/strong\u003e platform.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"/images/2015/02/Schermata-2015-02-11-alle-20-46-29.png\" alt=\"login page\"/\u003e\u003c/p\u003e\n\u003cp\u003eYou might think “wow cool, let’s log in into those accounts and get all the BTC they have!!!” ….. \u003cstrong\u003eyeah, sure\u003c/strong\u003e ….\u003c/p\u003e\n\u003cp\u003eOnce you’ve logged in with one of these accounts ( btw they all seem to be filled with 10 to 30 BTC each ), you will be able to send BTC to a given address.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"/images/2015/02/Schermata-2015-02-11-alle-20-49-14.png\" alt=\"send page\"/\u003e\u003c/p\u003e\n\u003cp\u003eGuess what? Whatever you type inside the \u003cstrong\u003eaddress\u003c/strong\u003e field it will be accepted by the system :)\u003cbr/\u003eThen, you will be redirected to the following page …\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"/images/2015/02/Schermata-2015-02-11-alle-20-51-35.png\" alt=\"fishy phishing\"/\u003e\u003c/p\u003e\n\u003cp\u003eDon’t you see something fishy? This is a fake login, this page will steal your credentials of the legit \u003cstrong\u003eblockchain.info\u003c/strong\u003e website and then it will redirect you there.\u003c/p\u003e\n\u003ch2 id=\"Summarizing\"\u003e\u003ca href=\"#Summarizing\" class=\"headerlink\" title=\"Summarizing\"\u003e\u003c/a\u003eSummarizing\u003c/h2\u003e\u003cp\u003eSomeone is periodically posting contents to pastebin.com trying to trigger pastebots with specific keywords, these contents will lure the bot owner to enter his blockchain.info credentials into a phishing page.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHackers phishing leakers\u003c/strong\u003e … isn’t it funny? :D\u003c/p\u003e\n\u003c/div\u003e",
  "Date": "2015-02-11T19:48:52Z",
  "Author": "Simone Margaritelli"
}