{
  "Source": "www.evilsocket.net",
  "Title": "How the United Arab Emirates Intelligence Tried to Hire Me to Spy on Its People",
  "Link": "https://www.evilsocket.net/2016/07/27/How-The-United-Arab-Emirates-Intelligence-Tried-to-Hire-me-to-Spy-on-its-People/",
  "Content": "\u003cdiv class=\"content\" itemprop=\"articleBody\"\u003e\n\u003cp\u003eRecently, we’ve been overwhelmed with news of horrors, attacks, monsters who murder the innocent in the name of a faith they don’t truly know. I’m publishing this article today to talk about other monsters, and I can guarantee these can be much worse than the ones we are now familiar with. They are the ones you don’t see coming, those you cannot conceive to be real.\u003c/p\u003e\n\u003cp\u003eBenjamin Franklin said:\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003eEither write something worth reading or do something worth writing.\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eWell, I’ll do my best.\u003c/p\u003e\n\u003cspan id=\"more\"\u003e\u003c/span\u003e\n\u003ch3 id=\"Free-as-in-Freedom\"\u003e\u003ca href=\"#Free-as-in-Freedom\" class=\"headerlink\" title=\"Free as in Freedom\"\u003e\u003c/a\u003eFree as in Freedom\u003c/h3\u003e\u003cp\u003eIn the United Arab Emirates there is no such thing as freedom of speech; a fact that has been repeatedly confirmed by organisations such as Amnesty International and Human Rights Watch, the latter stating clearly that:\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003eThe United Arab Emirates (UAE) often uses its affluence to mask the government’s serious human rights problems.\nThe government arbitrarily detains, and in some cases forcibly disappears, individuals who criticized the authorities,\nand its security forces face allegations of torturing detaineeds. A new anti-discrimination law further jeopardizes\nfree speech and is discriminatory, as it excludes references to gender and sexuality. Authorities denied access to the\ncountry to activists who criticized the UAE’s mistreatment of migrant workers.  Labor abuses persist, as migrant\nconstruction workers facing serious exploitation. Female domestic workers are excluded from regulations that apply\nto workers in other sectors.\u003c/code\u003e\u003c/pre\u003e\n\u003ccenter\u003e\u003csmall\u003eSource: \u003ca href=\"https://www.hrw.org/middle-east/n-africa/united-arab-emirates\" target=\"_blank\"\u003eHuman Rights Watch\u003c/a\u003e\u003c/small\u003e\u003c/center\u003e\n\u003cp\u003eInstances of people being incarcerated for merely criticising their employers have been documented.\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003eIn 2015, a man was detained for commenting on his employer\u0026#39;s Facebook page after a disagreement with his employer,\neven though the posts were made while the man was in the United States. Police in Abu Dhabi contacted him after he\ncame back to the UAE and asked him to meet officers at a police station, where he was later detained.\u003c/code\u003e\u003c/pre\u003e\n\u003ccenter\u003e\u003csmall\u003eSource: \u003ca href=\"http://www.bbc.com/news/technology-31692914\" target=\"_blank\"\u003eBBC\u003c/a\u003e\u003c/small\u003e\u003c/center\u003e\n\u003cp\u003eNeedless to say that the Web is also subject to intensive scrutiny by the authorities, who block specific sites and services, and go as far as tracking private citizens.\u003cbr/\u003eIn light of these facts, I feel obliged to divulge my own experience, what I was asked to do, and what is happening in the UAE of which many are oblivious.\u003c/p\u003e\n\u003cp\u003eI find it of utmost importance to speak up with the intent of informing the unknowing victims of their own government, as well as proving to these “gentlemen” that all the money in the world cannot buy a persons integrity.\u003c/p\u003e\n\u003cp\u003eClearly I have no real evidence, if not a few, rather vague emails and a number of references I will link to in this article.\u003cbr/\u003eThese people are as capable of invading the privacy of others as they are of protecting their own. It is up to my readers to form an opinion and decide whether my story holds any validity.\u003c/p\u003e\n\u003cp\u003eThough hardly news to anyone, nor particularly shocking, it is worth keeping in mind that it is usually the private companies that sell surveillance products to governments, whereas in this case we are looking at something developed internally by the government itself.\u003c/p\u003e\n\u003cp\u003eMoreover, in these lands the line between a “person of interest” and mere political dissident is truly very fine.\u003c/p\u003e\n\u003ch3 id=\"Sounds-like-North-Korea\"\u003e\u003ca href=\"#Sounds-like-North-Korea\" class=\"headerlink\" title=\"Sounds like North Korea\"\u003e\u003c/a\u003eSounds like North Korea\u003c/h3\u003e\u003cp\u003eMy story begins on the 3rd of July 2016 when I was contacted for a job by an Italian citizen living in the UAE, known to be linked to \u003ca target=\"_blank\" rel=\"noopener\" href=\"http://www.verint.com/about/\"\u003eVerint Systems\u003c/a\u003e: a large offensive security company of Israeli origins. Moreover, as absurd as it might sound, I was able to prove the involvement of a \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://www.privatewave.com/\"\u003ePrivateWave\u003c/a\u003e ex executive; a company that \u003cstrong\u003eclaims to be an ambassador of everyone’s security and privacy\u003c/strong\u003e.\u003c/p\u003e\n\u003cp\u003eThe initial exchange of emails were intentionally vague leaving much to the imagination, though the involvement of the Emirate Intelligence was evident. The following is an extract from one of the emails I received:\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003eRecently I was appointed a job, by an institutional client from an extra European country, to build a research and\ndevelopment unit that will constitute their most advanced branch  of cybersecurity, to the exclusive benefit of the\nnational security.\n\nAs I previously mentioned, the aims are very ambitious in that we will have to develop a series of highly specific\nand complex systems, among which are host-based softwares and network infrastructures (for which your work on\nbettercap seems like an excellent background) as well as hardware when necessary for specific requirements (custom\nnetwork interfaces, systems that operate on radio-frequencies, as well as robots and drones for certain practical\napplications)\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eOnce phone numbers were exchanged, we spoke for the first time (on \u003cstrong\u003eSignal\u003c/strong\u003e, ironically) and I was given a few more details. I was finally able to gather that the Arab Emirates government is creating an elite task force to research and develop new large scale surveillance solutions. How large this scale was to be, I discovered only later.\u003c/p\u003e\n\u003cp\u003ePersonally, I’m not entirely opposed to government interception if used selectively and for good reason. I am, however, against the exploitation of terms such as “internal security” and “terrorism”. Additionally, taking into account the nation in question, and what little I knew of its policies regarding dissidents, the entire affair began to seem extremely shady.\u003c/p\u003e\n\u003cp\u003eNevertheless, the trip was already paid for, I needed a vacation, and was curious to get to the bottom of the matter. So I agreed to an initial meeting. On the 20th of July I boarded a plane for Dubai.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"/images/2016/07/marinaplaza.jpg\" alt=\"marina plaza\"/\u003e\u003c/p\u003e\n\u003cp\u003eAfter the first day, spent talking on the twenty-ninth floor of the Marina Plaza, a building in the Dubai Marina area, things became much clearer… and more sinister.\u003c/p\u003e\n\u003cp\u003eFirst of all, the mastermind behind this “tiger team” is mr \u003cstrong\u003eFaisal Al Bannai\u003c/strong\u003e, former \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://en.wikipedia.org/wiki/Axiom_Telecom\"\u003emobile telephony tycoon\u003c/a\u003e and current CEO of \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://darkmatter.ae/en/about_us/#leadership_team\"\u003eDarkMatter\u003c/a\u003e: a security company deeply rooted within the Emirates Intelligence. My Italian contact often referred to Al Bannai as the “Big Boss”. Though I never got to meet him, his involvement was made abundantly clear from the get-go.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"/images/2016/07/albannai.png\" alt=\"al bannai\"/\u003e\u003c/p\u003e\n\u003cp\u003eWhat these delightful gentlemen are set out to achieve (as I previously mentioned, they aren’t \u003cstrong\u003eselling\u003c/strong\u003e the government a platform, \u003cstrong\u003ethey\u003c/strong\u003e are the government) is a series of man in the middle and man on the side operations and technologies on a massive scale, with hardware probes capable of intercepting, modifying, and diverting (as well as occasionally obscuring) traffic on IP, 2G, 3G, and 4G networks.\u003c/p\u003e\n\u003cp\u003eLocal Telco companies have already agreed and are ready to deploy these probes in public places, such as airports and malls.\u003cbr/\u003eWhen I asked my contact just how vast the range and distribution of the probes would be, e candidly replied:\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003eTo operate as we want them to, these probes are going to be put everywhere.\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eOnce the interception function will be finalised, a second team will be created to develop the more offensive component that will infect, trace, and ultimately take control of the devices within range: a range that will include all of Dubai and Abu Dhabi, given the use of drones, GSM cells, rogue APs, dedicated devices placed in the various nodes of local Telcos, and so on.\u003cbr/\u003eWith the same smiling face, the person I spoke to went on to describe their end goal:\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003eImagine that there\u0026#39;s a person of interest at the Dubai Mall, we\u0026#39;ve already set up all our probes all over the city, we press a button and BOOM! All the devices in the Mall are infected and traceable.\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003e\u003cstrong\u003eIn a country where criticising your employer, or worse, your government on Facebook is enough to land you behind bars, what exactly constitutes being a “person of interest”?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAnd what kind of protection, if any, is afforded to those who visit the country for business purposes?\u003c/p\u003e\n\u003cp\u003eClearly, I declined the job offer as was my initial intention, and to be honest, the last days I spent in Dubai where anxiety-riddled. On the one hand, I wanted to get this information out in the open as quickly as possible, on the other, I knew I had to wait to leave the country to do it safely.\u003c/p\u003e\n\u003cp\u003eThese people try to draw in young IT security talents by promising large sums of money (keeping in mind that there is no income tax in the UAE) various bonuses, apartments, and most of all, by presenting a professionally and intellectually stimulating environment. If by chance someone should raise an objection regarding potential targets and the somewhat questionable scope of the operation, they’d receive no more than a patronising lecture on how things have been blown out of proportion (yes, please do go and tell that to those poor bastards still sitting in prison) on how everything is relative and debatable, and the necessary compromises when it comes to national security; ironically, a rather US-like attitude from an Arab nation…\u003c/p\u003e\n\u003cp\u003eAs far as I’m concerned, \u003cstrong\u003efreedom of speech is indisputable\u003c/strong\u003e; it isn’t a matter of “personal opinion” as someone pointed out to me when I voiced my doubts. It is a basic right that should be granted to anyone, regardless of geopolitical context, creed, or gender. Denying this right is \u003cstrong\u003efascism in its lowest form\u003c/strong\u003e.\u003c/p\u003e\n\u003cp\u003eI hope this article will serve to warn those who, like me, might find themselves dragged into shady affairs, partially or completely unaware, as well as anyone pursuing job offers that entail moving to the UAE. \u003c/p\u003e\n\u003cp\u003eKnow that you would be giving up your privacy, and more importantly, your freedom of speech for money.\u003c/p\u003e\n\u003ch3 id=\"One-Last-Thing\"\u003e\u003ca href=\"#One-Last-Thing\" class=\"headerlink\" title=\"One Last Thing\"\u003e\u003c/a\u003eOne Last Thing\u003c/h3\u003e\u003cp\u003eMaybe this is just me, someone told me I’m exagerating the things in my mind … but as a matter of fact, this was published by the \u003cstrong\u003eInternational Business Times\u003c/strong\u003e July 27, which means today, which means two days after I left Dubai:\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003eIf you get caught using a VPN in the UAE, you will face fines of up to $545,000\nUAE has introduced a federal law banning the use of VPNs to try to avoid paying for expensive VOIP services.\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003e\u003ca target=\"_blank\" rel=\"noopener\" href=\"http://www.ibtimes.co.uk/if-you-get-caught-using-vpn-uae-you-will-face-fines-545000-1572888\"\u003eThis is the article\u003c/a\u003e, but maybe … yeah maybe it’s just me …\u003c/p\u003e\n\u003c/div\u003e",
  "Date": "2016-07-27T21:02:13Z",
  "Author": "Simone Margaritelli"
}