{
  "Source": "www.evilsocket.net",
  "Title": "Hacking Yourself Out of the Banking System and Live Only on BitCoin",
  "Link": "https://www.evilsocket.net/2016/05/08/Hacking-Yourself-out-of-the-Banking-System-and-Live-only-on-BitCoins/",
  "Content": "\u003cdiv class=\"content\" itemprop=\"articleBody\"\u003e\n\u003cp\u003eI’ve been interested in BitCoin since the very beginning but, until now, I considered BTC some very nice cryptographic experiment with high potential but almost no effects on real life.\u003cbr/\u003eA few years ago, buying BTC or selling them in order to get fiat ( “real” currency such as USD, EUR, etc ) wasn’t easy at all, but now things changed and things are much easier.\u003cbr/\u003eThat’s why I decided to live only with BitCoin and this is how I’m trying to do it.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"/images/2016/05/bitcoins.jpg\" alt=\"bitcoin\"/\u003e\u003c/p\u003e\n\u003cp\u003ePlease be aware that this is still work in progress, I’m trying the methods I’m going to show you these very same days, do \u003cstrong\u003enot\u003c/strong\u003e give my word for granted, if you want to follow this path, please be sure you know what you’re doing and most importantly double check every single thing.\u003c/p\u003e\n\u003cspan id=\"more\"\u003e\u003c/span\u003e\n\u003ch3 id=\"Reasons\"\u003e\u003ca href=\"#Reasons\" class=\"headerlink\" title=\"Reasons\"\u003e\u003c/a\u003eReasons\u003c/h3\u003e\u003cp\u003eI don’t know about you, but honestly I’m sick and tired of the Banking system for a few reasons:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eI do not accept the concept of “trust”, I don’t know those guys, why should I trust them? On the other hand, with BTC trust is not even considered to be a factor.\u003c/li\u003e\n\u003cli\u003eI do not accept someone else having control over my money or credit cards, I earned those money, who the fuck are you to decide how much and when can I withdraw or deposit?\u003c/li\u003e\n\u003cli\u003eI do not accept that the government has the right to access my bank accounts, see my balance and eventually freeze them.\u003c/li\u003e\n\u003cli\u003eI do not accept 2-3 business days for a wire transfer, we all know that that is not due to technical reasons, banks just speculate on those money while they’re on hold.\u003c/li\u003e\n\u003cli\u003eI do not accept their fees, they’re way too much high for the quality of service they give to you.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThere’re plenty of other minor reasons of course, but these are the most important ones, at least for me.\u003c/p\u003e\n\u003ch3 id=\"Problems\"\u003e\u003ca href=\"#Problems\" class=\"headerlink\" title=\"Problems\"\u003e\u003c/a\u003eProblems\u003c/h3\u003e\u003cp\u003eLike any other big change, there’re a few issues we need to solve, in this section I’ll explain the major ones while in the next one I’ll show you how I’m solving them.\u003c/p\u003e\n\u003ch4 id=\"Security\"\u003e\u003ca href=\"#Security\" class=\"headerlink\" title=\"Security\"\u003e\u003c/a\u003eSecurity\u003c/h4\u003e\u003cp\u003eThe first thing you should keep in mind is to \u003cstrong\u003estay safe\u003c/strong\u003e, what I mean is that there’re plenty of services where you can create your own bitcoin wallet, but wallets stored on the web are as secure as the web infrastructure they’re relying upon.\u003cbr/\u003eNo matter how safe they clame to be, web services can be hacked (or simply go bankrupt, see MtGox for instance) and eventyally there’s a pretty good chance to lose all of your money.\u003cbr/\u003eThere’s no central entity, there’s no guarantee, an online wallet \u003cstrong\u003eis not a bank\u003c/strong\u003e, so no one will give your BTC back if they somehow get lost.\u003c/p\u003e\n\u003ch4 id=\"Getting-fiat-real-money-from-your-BTC-wallet\"\u003e\u003ca href=\"#Getting-fiat-real-money-from-your-BTC-wallet\" class=\"headerlink\" title=\"Getting fiat (real money) from your BTC wallet\"\u003e\u003c/a\u003eGetting fiat (real money) from your BTC wallet\u003c/h4\u003e\u003cp\u003eBTC are great and everything, but you can’t pay your groceries with them, can you? Or your rent, or a restaurant … you need a good and reliable way to get USD or EUR or whatever from your BTC account anytime, anywhere.\u003c/p\u003e\n\u003ch4 id=\"Putting-fiat-into-your-BTC-wallet\"\u003e\u003ca href=\"#Putting-fiat-into-your-BTC-wallet\" class=\"headerlink\" title=\"Putting fiat into your BTC wallet\"\u003e\u003c/a\u003ePutting fiat into your BTC wallet\u003c/h4\u003e\u003cp\u003eAKA How to get your paycheck directly into your BTC wallet … I work for an US company and every month I receive my paycheck in USD (which eventually are converted to EUR from my bank), I need a way to receive these money directly as BTC to my wallet without asking my employer to switch to BTC payments, ideally I would just give him a new IBAN which somehow “maps” to my BTC wallet.\u003c/p\u003e\n\u003ch3 id=\"Solutions\"\u003e\u003ca href=\"#Solutions\" class=\"headerlink\" title=\"Solutions\"\u003e\u003c/a\u003eSolutions\u003c/h3\u003e\u003cp\u003eRegarding the \u003cstrong\u003esecurity\u003c/strong\u003e issue, the only way to stay 99% safe ( 100% is a chimera, we all know that ) is to have a hardware wallet, personally I’ve bought a Trezor (which hopefully is going to arrive tomorrow) but \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://en.bitcoin.it/wiki/Hardware_wallet\"\u003ethere’re plenty of other options available\u003c/a\u003e out there.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"/images/2016/05/trezor.jpg\" alt=\"trezor\"/\u003e\u003c/p\u003e\n\u003cp\u003eUnlike a web wallet or a software wallet created with some bitcoin client such as BitCoin-core, Mycelium or whatever, a hardware wallet like the Trezor stores your cryptographic keys (the ones you use to send or receive BTC basically) inside it and never sends data to your computer, it’s your computer which sends each transaction to the device and the device itself eventually will sign that transaction.\u003cbr/\u003eThis way even if your computer is compromised, any malicious third party won’t be able to steal your BTC. Moreover, if you lose your device or you break it, you can recover your BTC from the “initialization seed” you’re supposed to save on paper when you initialize the device for the first time.\u003c/p\u003e\n\u003cp\u003eAlso, remember to use every webservice I’m going to talk about only as a “proxy”, never leave all your BTC on them, only move the minimum amount you require from your hardware wallet, and always remember to enable 2 factor authentication.\u003c/p\u003e\n\u003cp\u003eHaving a very strong and unique password for every different web service is also good practice, you can use softwares such as KeepPass, 1Password or SafeInCloud in order to generate and store them safely.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eProblem one solved!\u003c/strong\u003e :)\u003c/p\u003e\n\u003cp\u003eNow we need a good way to pay restaurants, amazon purchases and get USD/EUR/whatever from an ATM … debit cards!\u003c/p\u003e\n\u003cp\u003eThere’re a few online services which allow you to open a BTC wallet (remember, do \u003cstrong\u003enot\u003c/strong\u003e deposit all of your BTC on these wallets ) and receive a real debit card ( VISA, MasterCard, you name it ). You deposit/send some BTC on that wallet, charge the debit card and then you can use it either as a normal credit card or on every ATM in the world to withdraw cash from that wallet.\u003cbr/\u003eThe service I’m using right now is \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://cryptopay.me/join/b5728364\"\u003eCryptoPay\u003c/a\u003e which I find to be the best, once you’ve verified your identity (uploading your passport and some utility bill to prove the address you’ve provided is real), you have \u003cstrong\u003eno limits\u003c/strong\u003e whatsoever, you can charge the card as many times as you want with as many money as you want, just like the normal debit card you could get from your bank.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eProblem two solved!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe last problem we need to find a solution for, is getting your paycheck (or any other form of income you have) directly to your BTC wallet, there’re two main services that allows you to do this, I’m testing both these days ( \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://www.reddit.com/r/Bitcoin/comments/4ieu7x/trying_to_live_only_on_btc_cashila_or_bitwage/\"\u003eI also asked for some users feedbacks on reddit\u003c/a\u003e just to be 100% sure ) :\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003ca target=\"_blank\" rel=\"noopener\" href=\"https://bitwa.la/r/N3yjt9qeccjs4qCXc\"\u003eBitwa.la\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca target=\"_blank\" rel=\"noopener\" href=\"http://csh.la/1SWD8xG\"\u003eCashila.com\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca target=\"_blank\" rel=\"noopener\" href=\"https://www.bitwage.com/referral/PSBJCGWMAR4O\"\u003eBitWage.com\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThe two are almost the same, they basically give you some bank coordinates with a reference id which is unique to you, you should ask your employer to send your next paychecks to those coordinates and they will be automatically send through the blockchain to your BTC wallet.\u003c/p\u003e\n\u003cp\u003eBitwala and Cashila also allow you to \u003cstrong\u003emake\u003c/strong\u003e wire transfers, so if you want to pay your bills, rent or whatever with some normal money transfer, you can easily use your Bitwala/Cashila account, while BitWage still does not offer this feature.\u003c/p\u003e\n\u003cp\u003ePeronsally I find \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://bitwa.la/r/N3yjt9qeccjs4qCXc\"\u003eBitwala\u003c/a\u003e to be way better than Cashila, it’s cheaper, faster and more suitable for EUR zone payments … I’m definitely going to use it for paying the rent, bills, etc :)\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eProblem three solved!\u003c/strong\u003e\u003c/p\u003e\n\u003ch2 id=\"Conclusions\"\u003e\u003ca href=\"#Conclusions\" class=\"headerlink\" title=\"Conclusions\"\u003e\u003c/a\u003eConclusions\u003c/h2\u003e\u003cp\u003eUsing the aforementioned services and tools, you can now live only on BTC, you’re never gonna need a bank account again.\u003cbr/\u003eYou might be thinking “yeah, nice, but BTC are unstable, their value could change anytime” … this is half true.\u003cbr/\u003eTheir value indeed changes quickly, but not as much as it used to change, in the \u003ca target=\"_blank\" rel=\"noopener\" href=\"http://www.coindesk.com/price/\"\u003elast three months\u003c/a\u003e for instance there’ve been an oscillation just between 373$ and 479$, which might seems a lot but if you move your BTC at the right time you’re not going to lose anything, on the contrary, compared to the fees you would normally pay for Bank transactions, chances are you’re going to spend way much less anyway.\u003c/p\u003e\n\u003cp\u003eIn a few months I’ll write a new blog post with an updated situation and the outcomes of this decision … in the meantime, let’s hope for the best! :)\u003c/p\u003e\n\u003cp\u003eIf you still have doubts or questions, the \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://www.reddit.com/r/Bitcoin\"\u003eBitCoin Reddit\u003c/a\u003e is a great source of informations and user feedbacks.\u003c/p\u003e\n\u003cp\u003ePS: If you have some spare BTC and wanna offer me a beer, this is my bitcoin account \u003ccode\u003e3Gef69VY8HdhsPghdbipMrepMCKHWukXd3\u003c/code\u003e :)\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"/images/2016/05/account.png\" alt=\"account\"/\u003e\u003c/p\u003e\n\u003c/div\u003e",
  "Date": "2016-05-08T15:20:56Z",
  "Author": "Simone Margaritelli"
}