{
  "Source": "www.evilsocket.net",
  "Title": "WiFi Pentesting With a Pineapple NANO, OS X and BetterCap",
  "Link": "https://www.evilsocket.net/2016/09/15/WiFi-Pineapple-NANO-OS-X-and-BetterCap-setup/",
  "Content": "\u003cdiv class=\"content\" itemprop=\"articleBody\"\u003e\n\u003cp\u003eAfter a few weeks of testing on the field, I’ve found the perfect configuration for WiFi pentesting using a WiFi Pineapple NANO, an OSX laptop and BetterCap.\u003cbr/\u003eSince different people from different forums had issues making this work ( mostly due to the difficulties of internet connection sharing between OSX and the Pineapple ) I’ve decided to share my setup today ^_^\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"/images/2016/09/nano.jpg\" alt=\"nano\"/\u003e\u003c/p\u003e\n\u003cspan id=\"more\"\u003e\u003c/span\u003e\n\u003ch3 id=\"WiFi-Pineapple-AKA-KARMA-attack-for-the-masses\"\u003e\u003ca href=\"#WiFi-Pineapple-AKA-KARMA-attack-for-the-masses\" class=\"headerlink\" title=\"WiFi Pineapple AKA KARMA attack for the masses\"\u003e\u003c/a\u003eWiFi Pineapple AKA KARMA attack for the masses\u003c/h3\u003e\u003cp\u003eFirst of all, let’s talk a little bit about the KARMA attack in case you have no idea what I’m talking about. \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://digi.ninja/karma/\"\u003eDigiNinja\u003c/a\u003e page on karma says:\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003eKarma is a set of patches to access point software to get it to respond to probe requests not just for itself but for any ESSID requested. This allows the AP to act as a lure to draw in any clients probing for known networks. The original Karma patches were released by Dino Dai Zovi for Madwifi, I then took over and ported the patches to Madwifi-ng and have now taken them to the new hostapd.\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eLong story short, on each WiFi access point there’s a demon running called \u003cstrong\u003ehostapd\u003c/strong\u003e which receives probes from nearby clients ( your laptop, mobile, etc ) and only responds to the probes that were sent to its SSID, discarding everything else.\u003cbr/\u003eSomeone created a patched version of the hostapd binary which instead accepts \u003cstrong\u003eevery probe\u003c/strong\u003e, this results in a WiFi access point that pretends to be (for instance) your home network thus \u003cstrong\u003eforcing\u003c/strong\u003e nearby devices to automatically connect to it.\u003c/p\u003e\n\u003cp\u003eYou can create such kind of “Evil Twin” AP using a Kali distribution, the right drivers, the right hardware and so forth, or you can also \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://penturalabs.wordpress.com/2013/04/25/blue-for-the-pineapple/\"\u003ehack a cheap TPLink WR703N\u003c/a\u003e, but the easiest, quickest (and IMHO more stable) solution is buying a WiFi Pineapple from \u003ca target=\"_blank\" rel=\"noopener\" href=\"http://hakshop.myshopify.com/\"\u003eHak5 online shop\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eIn my case, I have a MKV, a Tetra and a NANO, in this post I’ll talk about the latter.\u003c/p\u003e\n\u003ch3 id=\"Internet-Connection-Sharing-with-OS-X\"\u003e\u003ca href=\"#Internet-Connection-Sharing-with-OS-X\" class=\"headerlink\" title=\"Internet Connection Sharing with OS X\"\u003e\u003c/a\u003eInternet Connection Sharing with OS X\u003c/h3\u003e\u003cp\u003eOnce you’ve done with the \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://www.wifipineapple.com/pages/setup#nano\"\u003ebasic NANO configuration\u003c/a\u003e, you’ll have your device up and running with the ip address \u003cem\u003e172.16.42.1\u003c/em\u003e, in order to share the connection from your Mac wifi adapter to the NANO ( which is plugged to the Mac’s USB port at this point ) you’ll need to change this ip address to a different one which eventually will be “accepted” by the ICS OS X mechanism, so:\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003essh \u003ca href=\"/cdn-cgi/l/email-protection\" class=\"__cf_email__\" data-cfemail=\"44362b2b30047573766a75726a70766a75\"\u003e[email protected]\u003c/a\u003e\n\nuci set network.lan.ipaddr=\u0026#39;192.168.2.10\u0026#39;\nuci set network.lan.gateway=\u0026#39;192.168.2.1\u0026#39;\nuci commit \u0026amp;\u0026amp; reboot\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eYou’ll then enable internet connection sharing from your Mac WiFi adapter to the NANO USB-Eth adapter:\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"/images/2016/09/ics.png\" alt=\"ics\"/\u003e\u003c/p\u003e\n\u003cp\u003eAnd eventually you’ll need to configure a static ip address for the interface:\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"/images/2016/09/ip.png\" alt=\"ip\"/\u003e\u003c/p\u003e\n\u003cp\u003eAlmost done, you need to apply the correct firewall rules on your Mac to make everything work between the two interfaces, this is a bash script I’ve made ( in my case the NANO ethernet interface is \u003cstrong\u003een4\u003c/strong\u003e, change it to your needs ):\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003e#!/bin/bash\n\nif [ \u0026#34;$(id -u)\u0026#34; != \u0026#34;0\u0026#34; ]; then\n   echo \u0026#34;This script must be run as root.\u0026#34; 1\u0026gt;\u0026amp;2\n   exit 1\nfi\n\nsysctl -w net.inet.ip.forwarding=1\npfctl -e\necho \u0026#34;nat on en0 from en4:network to any -\u0026gt; (en0)\u0026#34; | pfctl -f -\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eOnce you’ve launched it, you can ssh again into your NANO and verify that the connection sharing is actually working.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"/images/2016/09/ics_working.png\" alt=\"ics working\"/\u003e\u003c/p\u003e\n\u003cp\u003eLast step, just configure and start \u003cstrong\u003ePineAP\u003c/strong\u003e as you normally would:\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"/images/2016/09/pineap.png\" alt=\"pineap\"/\u003e\u003c/p\u003e\n\u003cp\u003eYou now have your KARMA attack running and nearby WiFi enabled devices should start connecting to your evil AP very soon :)\u003c/p\u003e\n\u003ch3 id=\"Port-Redirection-and-BetterCap\"\u003e\u003ca href=\"#Port-Redirection-and-BetterCap\" class=\"headerlink\" title=\"Port Redirection and BetterCap\"\u003e\u003c/a\u003ePort Redirection and BetterCap\u003c/h3\u003e\u003cp\u003eUnfortunately making bettercap run on the NANO is a \u003cstrong\u003epain in the ass\u003c/strong\u003e and, even if you manage to do it, its hardware is simply not powerful enough to properly running it while handling multiple connections, so I’ve decided to run it on the laptop and have the NANO redirect all HTTP (and optionally HTTPS) traffic to it.\u003c/p\u003e\n\u003cp\u003eHere’s a simple bash script that you need to copy to your NANO, it will enable or disable port redirection to your bettercap instance running on the laptop:\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003e#!/bin/bash\n\nif [[ $# -eq 0 ]] ; then\n    echo \u0026#34;Usage: $0 (enable|disable)\u0026#34;\n    exit 1\nfi\n\naction=\u0026#34;$1\u0026#34;\ncase $action in\n    enable)\n      echo \u0026#34;Enabling ...\u0026#34;\n      iptables -t nat -A PREROUTING -p tcp --dport 80 -j DNAT --to-destination $(uci get network.lan.gateway):8080\n      iptables -t nat -A POSTROUTING -j MASQUERADE\n    ;;\n    disable)\n      echo \u0026#34;Disabling ...\u0026#34;\n      iptables -t nat -D PREROUTING -p tcp --dport 80 -j DNAT --to-destination $(uci get network.lan.gateway):8080\n    ;;\n    *)\n      echo \u0026#34;Usage: $0 (enable|disable)\u0026#34;\n      exit 1\n    ;;\nesac\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eOnce you’ve enabled port redirection, you can simply start bettercap on your laptop with your preferred command line and start intercepting the traffic of the target clients that have been forced to connect to your evil access point :D\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"/images/2016/09/setup.jpg\" alt=\"final setup\"/\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDONE! :D\u003c/strong\u003e You won’t even need to MITM something, with this attack the targets will connect to you … enjoy! :)\u003c/p\u003e\n\u003c/div\u003e",
  "Date": "2016-09-15T12:48:23Z",
  "Author": "Simone Margaritelli"
}