{
  "Source": "www.evilsocket.net",
  "Title": "How to Root the LG Watch Urbane ( B285 )",
  "Link": "https://www.evilsocket.net/2015/06/15/How-to-root-the-LG-Watch-Urbane-B285/",
  "Content": "\u003cdiv class=\"content\" itemprop=\"articleBody\"\u003e\n\u003cp\u003eA few days ago I’ve bought a \u003cstrong\u003eLG Watch Urbane\u003c/strong\u003e from the Google Store since it seemed to me the very first “elegant” wear device.\u003cbr/\u003eI really like old fashioned wrist watches so I waited for something similar to be on the market before getting a Wear device.\u003c/p\u003e\n\u003cspan id=\"more\"\u003e\u003c/span\u003e\n\u003cp\u003eUnfortunately, being it a relatively new device, there aren’t many informations on the web on how to root it, so I started asking for infos on XDA and finally, with the help of \u003ca target=\"_blank\" rel=\"noopener\" href=\"http://forum.xda-developers.com/member.php?u=2313936\"\u003esuzook\u003c/a\u003e and \u003ca target=\"_blank\" rel=\"noopener\" href=\"http://forum.xda-developers.com/member.php?u=5570332\"\u003esuljo94\u003c/a\u003e I’ve managed to do it.\u003cbr/\u003eApparently, almost the same procedure of the \u003cstrong\u003eLG G Watch R\u003c/strong\u003e applies, but in order to make it work on the Urbane I needed different files, namely:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThe specific \u003cstrong\u003eTWRP\u003c/strong\u003e recovery image for this device. \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://dl.twrp.me/bass/twrp-2.8.6.1-bass.img.html\"\u003edownload\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003eThe Wear version of the \u003cstrong\u003eSuperSU\u003c/strong\u003e update zip. \u003ca target=\"_blank\" rel=\"noopener\" href=\"http://rootjunkysdl.com/getdownload.php?file=LG%20G%20Watch/Root/Wear-SuperSU-v2.40.zip\"\u003edownload\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThese are the simple steps to follow in order to root the LG Watch Urbane:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eConnect your device to the USB port of your computer ( I take for granted you have adb and fastboot installed ).\u003c/li\u003e\n\u003cli\u003eEnable the developer menu, going into Settings -\u0026gt; Informations and tapping on the “Build” entry for 7 times.\u003c/li\u003e\n\u003cli\u003eGo to the unlocked Developer Options settings menu and enable ADB Debugging.\u003c/li\u003e\n\u003cli\u003eUnplug the device and plug it back, it should ask you if you want to allow your computer to connect to it, of course, allow it.\u003c/li\u003e\n\u003cli\u003eNow open a terminal, and execute \u003cstrong\u003eadb reboot bootloader\u003c/strong\u003e to get into the bootloader.\u003c/li\u003e\n\u003cli\u003eTo unlock it, execute \u003cstrong\u003efastboot oem unlock\u003c/strong\u003e ( This will wipe your device data! ).\u003c/li\u003e\n\u003cli\u003eSetup the wiped device, and execute steps from 1 to 4 again.\u003c/li\u003e\n\u003cli\u003eAgain, \u003cstrong\u003eadb reboot bootloader\u003c/strong\u003e.\u003c/li\u003e\n\u003cli\u003eFlash the TWRP image by issuing \u003cstrong\u003efastboot flash recovery twrp-2.8.6.1-bass.img\u003c/strong\u003e ( make sure you have the img file in the same folder you’re working in ).\u003c/li\u003e\n\u003cli\u003eNow copy the SuperSU zip archive \u003cstrong\u003eadb push Wear-SuperSU-v2.40.zip /sdcard/\u003c/strong\u003e.\u003c/li\u003e\n\u003cli\u003eStart the TWRP recover by executing \u003cstrong\u003eadb reboot recovery\u003c/strong\u003e.\u003c/li\u003e\n\u003cli\u003eUse the \u003cstrong\u003eInstall\u003c/strong\u003e option, select the zip file of SuperSU and flash it ( do \u003cstrong\u003enot\u003c/strong\u003e enable signature verification or the whole process will fail! ).\u003c/li\u003e\n\u003cli\u003eReboot your device and you’re ready to go, enjoy the root ^_^\u003c/li\u003e\n\u003c/ol\u003e\n\u003c/div\u003e",
  "Date": "2015-06-15T18:32:27Z",
  "Author": "Simone Margaritelli"
}