{
  "Source": "www.evilsocket.net",
  "Title": "Just Taking a Break :D",
  "Link": "https://www.evilsocket.net/2020/05/26/Just-taking-a-break/",
  "Content": "\u003cdiv class=\"content\" itemprop=\"articleBody\"\u003e\n\u003cp\u003eHey ya all! Since I’ve \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://twitter.com/0xRogue/status/1263632571595919365?s=20\"\u003eread around\u003c/a\u003e a \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://twitter.com/0xRogue/status/1263625214761545729?s=20\"\u003efew people\u003c/a\u003e are \u003ca target=\"_blank\" rel=\"noopener\" href=\"https://twitter.com/CristianPes/status/1249754870426501126?s=20\"\u003ewondering\u003c/a\u003e what happened to me I thought about writing a brief “status update” on my blog, especially for those who came asking on Pwnagotchi’s Slack channels and seemed to be sincerely worried.\u003c/p\u003e\n\u003cp\u003eI’m well and sound, after a pretty sad/traumatic yet productive 2019 I decided to re-evaluate how I was spending my energies, both mental and physical, and took a step back to put things in perspective. I’ve been active in the OSS world for quite a long time, developed several more or less useful projects I shared and maintained for free, and I’m both proud of and thankful for that, as it allowed me to develop my technical abilities and ultimately my professional career. Nothing is free and this came with the price of sacrificing most of my time and not focusing on other things that made me happy, possibly happier than programming at this point, including taking care of my own mental health.\u003c/p\u003e\n\u003cp\u003eSo just right before this whole covid19 mess started I enrolled to a music school in my home town, motivated to pursue what has always been kind of a “secret” dream of mine, becoming a musician, a path that I took in my teenage years but that I kinda gave up as I started living on my own very early and soon had a rent and bills to pay. Unfortunately (or not?) I work by focusing and investing all my energy on \u003cstrong\u003eone-single-thing\u003c/strong\u003e until I get familiar with it and I start to get some positive results that make me realize I’m on the right path, this has always been the case and probably won’t change now :D Spending that amount of time on both OSS and music is simply not doable.\u003c/p\u003e\n\u003cp\u003eNeither I’m particularly interested in following what’s generally being referred to as “infosec” on socials, or in being part of it for what matters, as in my personal opinion “social infosec” is way more focused on individualism and sensationalism rather than actually getting things done. I believe what’s needed are new ideas and possibly solutions, not rockstars, con artists, ego, drama, trolls and whatnot. Although it was never my intent, I’ve been part of that problem for a while with my profile and my rants. I don’t want to be part of it anymore. My suggestion for whoever is reading and cares and might be new to this world, is to take with a grain of salt whoever is putting more effort in highlighting their own persona rather than their actual achievements and contributions, no matter how authoritative they might sound from their pedestals.\u003c/p\u003e\n\u003cp\u003eSo, in this spirit and after realizing how much time and mental energy both coding and socials were draining from me I just deactivated my accounts and paused all my projects. Now I’m writing code and doing research just for my job, sporadically merging some PRs people send to the projects I’ve developed, and that’s it, the rest of my time I spend playing guitar (my main instrument since I was 15) and piano (that I started to study recently).\u003c/p\u003e\n\u003cp\u003eIt’s going to be a new and long ride, I’m not scared, it makes me happy like I wasn’t from a very long time.\u003c/p\u003e\n\u003cp\u003eThanks for everybody who cared and asked what happened to me, cya in \u003cem\u003ethe world of the electron and the switch\u003c/em\u003e.\u003c/p\u003e\n\u003cp\u003ePS, to whoever is spreading fake rumors about me: you should really think about where you got your intel from and how your naiveness and bias are being weaponized. Fact checking might be your friend.\u003c/p\u003e\n\u003cp align=\"center\"\u003e\n\u003cimg src=\"https://i.pinimg.com/originals/0e/85/af/0e85af756c464e165b5ba9c3d4996eea.png\"/\u003e\n\u003c/p\u003e\n\u003c/div\u003e",
  "Date": "2020-05-26T18:39:44Z",
  "Author": "Simone Margaritelli"
}