{
  "Source": "blog.zzbd.org",
  "Title": "永远的笔记本",
  "Link": "https://blog.zzbd.org/2010/03/29/forever-note/",
  "Content": "\u003cdiv class=\"post-body\" itemprop=\"articleBody\"\u003e\u003cblockquote\u003e\u003cp\u003e记忆如潮水，川流不息。\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e转眼又一个十年，坐上90后的头班车，到2010的秋季就是整整20年。前年的时候搬了一次家，告别破旧的砖瓦小屋住进小镇的商品房，随之告别的还有杂七杂八的童年物什。这些东西除了一些文学经典书籍，其他卖的卖，仍的扔，至此再难找到童年的证据。\u003cspan id=\"more\"\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e但有个日记本例外。扉页上写着\u003ccode\u003e寒窗苦读无人问 一朝鹏展无限天\u003c/code\u003e \u003ccode\u003e为×××十岁赠言\u003c/code\u003e \u003ccode\u003e一九九九年十月\u003c/code\u003e \u003ccode\u003e段叔字\u003c/code\u003e。段叔叔是谁？已经无从考证，但这几行字我在熟悉不过，因为过去的10年里我经常翻开来看看。\u003cimg data-src=\"http://cdn.zzbd.org/2010-03-29-22-23-12.jpg\" alt=\"notebook2\" title=\"notebook2\"/\u003e\u003c/p\u003e\u003cp\u003e到大学后我只从家里带来两样东西：它，和一个记录高三黑暗生活的日记本。小学，初中，高中，每个阶段都留下了那时的文字。每一小段都在诉说一个故事，即使是再小的故事（比如上课无聊抄起《时间简史》）也是弥足珍贵的记忆。\u003cbr/\u003e更让我感到温暖的是，硬壳纸封面的夹层里还有一些小物件，就是下面这张图片（很普通，但于我很重要）（看一会儿就会陷入沉思）\u003cbr/\u003e \u003cimg data-src=\"http://cdn.zzbd.org/2010-03-29-22-23-36.jpg\" alt=\"IMG_0317\" title=\"IMG_0317\"/\u003e\u003cbr/\u003e那张白色的字条是初三的时候，卫生委员递给我的，意思是是让我跟另外一个家伙下课去卖易拉罐。我也不知道这张字条是如何保留到现在的。我想说，WXH，你现在在那里？初中一别就在没见过面了，依然记得你笑靥如花的样子，还有轻声咳嗽时总是偏偏脑袋的动作，现在过的还好吧，你有一个武汉的同学一直没忘记你。还有ZOX，你小子应该混的不错吧，跟TA有下文没？我很好奇。。。\u003c/p\u003e\u003cp\u003e上面发黄的字条是一年前的女生节，我在活动室抓阄抓的。至今我没有满足她的愿望，但这张字条夹在这个本子里一定伴随着一个承诺。。。\u003c/p\u003e\u003cp\u003e中间是2009年武大樱花节的门票，那一天也是高中老同学聚会的日子。洁白的樱花很美，在异地看见熟悉的笑容尤为的美丽。原本拍了好多照片，怪我疏忽大意，U盘中毒之后，被我格式化，现在仅存数张，庆幸之余稍稍有些遗憾。\u003c/p\u003e\u003cp\u003e那个像风车的东西。。。拿铅笔顶住中心向前推动就会旋转，或者站在阳台让它自由落下（高三我们教室在四楼）。高三枯燥生活中仅有的几项娱乐之一。。可惜同学教我几次都没能让我学会怎么折。。也许这是我决定留下它的理由吧！\u003c/p\u003e\u003cp\u003e千纸鹤————勾起心里苦涩的味道。高三，某个平常而忙碌的下午，坐在窗边看着脚下的大河发呆。随手这了个千纸鹤，递给前面的ChengLu。两分钟后，一个新的纸鹤递到我面前，清晰记得白鹤有两只用红色圆珠笔画的眼睛。当时我拿着也没太留心，放学之后，感觉ChengLu的神色变得严肃起来，我忽然就意识到纸鹤不见了，然后在教室后面的垃圾铲里发现了它。也许这就是我保留这个纸鹤的原因。CL，无论你是否记的这件事，我内心还是很内疚的。\u003c/p\u003e\u003cp\u003e也许你没注意到左下角那还在那个字条。这是我去过高中图书馆的唯一证据。抄得是浦丰投针实验，为什么留？也许缘于我对数学的兴趣吧。\u003c/p\u003e\u003cp\u003e另外还有两片叶子，樟树叶和李树叶，记录了两个地点，两件事。。。\u003c/p\u003e\u003cp\u003e能留下这些东西是我的幸运，经历过的林林总总就让这些小事概括吧，至少不会觉得自己虚度了少年时光。\u003c/p\u003e\u003cp\u003e我会一直保留的，如果哪一天我想你们了就翻出来看看，真的很想你们。\u003c/p\u003e\u003c/div\u003e",
  "Date": "2010-03-29T06:23:39Z",
  "Author": "J. F"
}