{
  "Source": "blog.zzbd.org",
  "Title": "元旦记事",
  "Link": "https://blog.zzbd.org/2010/01/03/first-day/",
  "Content": "\u003cdiv class=\"post-body\" itemprop=\"articleBody\"\u003e\u003cp\u003e阿嚏～天儿是越来越冷，再过几日就到小寒了。\u003cbr/\u003e今年武汉有些阴冷潮湿，新年第一天就下起了连阴雨。出校和几个哥们儿游荡一整天，晚上回来手脚都几乎没了知觉，十根手指冻得像猪蹄儿一样。唉，领教过江城冬天就要念叨夏天的好了。不是有句谚语“小寒大寒寒得透，来年春天天暖和”，2010应该会风调雨顺吧！\u003cspan id=\"more\"\u003e\u003c/span\u003e\u003cbr/\u003e我是早晨8点钟出发的，回来正好晚上8点，这12个小时里几乎都在走路坐公交。从华师往西走到中南路，在一个叫“川胖子”的馆子匆匆解决了午饭，又上公交去了了省博，之后沿途又经过红楼，长江一桥，户部巷……回到街道口，个个都累得东倒西歪，虽然这次聚会没什么新意（就是瞎逛），我还是很满足的\u003cstrong\u003e￣▽￣\u003c/strong\u003e，曾听人说距离是友情的慢性毒药，但也有例外的时候。我无疑是幸运的，高中虽说一无所获，没知识，没特长，没壮举，至少我有几个超“铁”的哥们儿。\u003c/p\u003e\u003cp\u003e扯远了，元旦还是颇有感触的。起码我知道“站”公交车要向车窗而立，否则一路下来你一只脚肯定麻了。原理，因为堵车。牛逼的司机会把车开的跟筛子一样，突然启动又突然刹车，在此期前，如果你面向车门而立，一只脚肯定受力不轻。呵呵，这是个人小经验。\u003c/p\u003e\u003cp\u003e如果说这次聚会有点意义的事就是到\u003ca target=\"_blank\" rel=\"noopener\" href=\"http://www.hubeimuseum.net/\"\u003e省博\u003c/a\u003e走了一遭。入口查得挺严，我手里一听“雪花”就被扣下了-_-! 身为楚地的后代，对楚文化一无所知真是糟糕透了，恩，我得自我检讨一下。虽然外头在下雨，这里游人依然不少，不过撒多数对青铜兵器比较感兴趣，农具石器之类的就明显被冷落了。踏入大门就看见勾践那把铜剑着实夺人眼球，一圈人眯着眼睛一本正经的“_研究_”着，谁也不知道它是怎么保存的如此完好。相比之下，一旁的夫差茅就有明显的岁月痕迹，毕竟是2000多年的物什啊。同寝浙江的哥们儿听说越王剑在湖北就不服气了，非说勾践是浙江人，应该把剑放在浙江博物馆,我才懒得争，反正我亲眼看到了……这还是我第一次这么近距离观察跨越千年的宝贝，震撼自是无以复加，但如果要我鉴赏，只能说一个“美”字了。还有一个印象挺深的就是巨大的编钟，虽然这里禁止照相，但仍有人甘冒大险在钟前合影留念，大钟依然光泽圆润，棱廓分明，看来岁月在这样的鬼斧神工面前也要低头了。\u003c/p\u003e\u003cp\u003e出来博物馆，坐公交直奔长江大桥，本想这里很热闹，到了之后才明白热闹过头也不是什么好事。整条司门口路就像火车站一样，人头攒动，真正是比肩接踵。跟博物馆的宁静肃穆相对的，这儿的嘈杂有些让人厌恶。来这里的目的之一就是“\u003ca target=\"_blank\" rel=\"noopener\" href=\"http://baike.baidu.com/view/1969.htm\"\u003e户部巷\u003c/a\u003e”，但到了之后就有些食欲不足，失望有余。各家买的东西都差不多，什么“大西北烤肉”“炸鱿鱼”“酸辣粉”“豆皮”“烤饺子”，招牌“热干面”也没见几家。于是每人拿了一串肉就穿过烟气弥漫的胡同离开了。\u003c/p\u003e\u003cp\u003e胡同外的一排建筑倒是别有一番风味，一色的青砖红瓦，木雕的窗栏充溢着古韵，让我想起“世界因爱而生”里的那个小镇。唉，要是能在这里颐养天年，此生足矣。\u003c/p\u003e\u003cp\u003e一天下来，兜里的百元大钞只剩下几颗硬币了，但只要开心就好。省博物馆，等着，我一定会再回来的，那个时候一定不是流于外表的看，恩，一定。\u003c/p\u003e\u003cp\u003e新年新气象，祝大家有个好的开始，2010精彩连连！\u003c/p\u003e\u003c/div\u003e",
  "Date": "2010-01-02T18:47:35Z",
  "Author": "J. F"
}