{
  "Source": "blog.zzbd.org",
  "Title": "用心灵深处声音感受大自然与人类的呼吸",
  "Link": "https://blog.zzbd.org/2018/10/11/miao2/",
  "Content": "\u003cdiv class=\"post-body\" itemprop=\"articleBody\"\u003e\u003cp\u003e\u003cimg data-src=\"http://cdn.mq-class.cn/2331538831939_.pic_hd.jpg\" alt=\"照片提供：朋友圈\"/\u003e\u003cbr/\u003e（※照片提供：朋友圈）\u003cbr/\u003e\u003caudio controls=\"controls\"\u003e\u003c/audio\u003e\u003c/p\u003e\u003csource src=\"http://cdn.mq-class.cn/%E5%AD%99%E7%87%95%E5%A7%BF%20-%20%E9%81%87%E8%A7%81.mp3\" type=\"audio/mpeg\"/\u003e这里是喵和她的精神家园 那一刻我不经意间抬起头，望着周围的人群，一双双焦虑的、迷茫的眼神 其中,也有求知的眼神和寻找的眼神 ![照片提供：朋友圈](http://cdn.mq-class.cn/UNADJUSTEDNONRAW_thumb_22.jpg) （照片提供：朋友圈）\u003cp\u003e“师傅一一跟我解释，当年这些都是苏联人盖的，红砖方块格局，不过参考了莫斯科的建设风格，却没有意识到武汉的天气比莫斯科高很多。 这这一大群建筑冬暖夏凉，内部结构都是竹子参泥土，建于上个世纪五十年代末期，至今无损。\u003cbr/\u003e难怪附近的理工大学有几栋楼有“血色同心”画面的感觉。”\u003cbr/\u003e（「图片」引自十一出行的人们）\u003c/p\u003e\u003cspan id=\"more\"\u003e\u003c/span\u003e\u003cp\u003e这种文化已经渗透到生活的毛系血管中，以致很多事情在面对的时候有多种选择。\u003cbr/\u003e其实不是选择与选择的问题，是坚持自我与失去自我的问题。\u003cbr/\u003e僧侣似的忍耐与沉默与感动，让西方人要么相信他们坚持的道义是对的，要么从人性的角度看只会是虚伪不堪。\u003cbr/\u003e最重要的一点，便是对人性本身的尊重和对正义的起码坚持。\u003cbr/\u003e正义这个词的诠释在小孩身上可以表现得淋漓。或许没有受过污染，或许是天性所在，它们在遇到事情的时候的第一反应足以让冷漠的人也落泪。\u003cbr/\u003e互帮互助，公平竞争，尽情的玩耍，无忧无虑，对父母和对亲人的爱，哪怕是一岁的孩子都懂得这些。\u003cbr/\u003e对孩子的观察永远让你觉得光明的背后肯定有一种无比的力量，它代表着绝对的公义。\u003c/p\u003e\u003cp\u003e\u003cimg data-src=\"http://cdn.mq-class.cn/UNADJUSTEDNONRAW_thumb_91.jpg\" alt=\"照片提供：朋友圈\"/\u003e\u003cbr/\u003e（照片提供：朋友圈）\u003c/p\u003e\u003cp\u003e为和谐的村落文化被外界的物质文明带来的冲击和变化而落泪……\u003c/p\u003e\u003cp\u003e坐在河边，望着河那岸的树，望着天，任思绪无边无际的蔓延。一坐就是一整天，泪流不止。我们一路在追求，到底又在追求什么？\u003c/p\u003e\u003cp\u003e 参加了一个朋友的婚礼，随便吃了点饭，一言不发。告别后，我一个人沿着小时候常走的河堤一路回来。看着孩提时代经常玩耍的地方，一种按捺不住的故乡情怀涌上心头。\u003c/p\u003e\u003cp\u003e村落大概2000户人家，曾经生活的地方，前后50户左右。『应该还有印象』。每家每户平均2个孩子，所以小时候一起玩耍的伙伴总是很多很多。如今，除了念书读大学的朋友外，其他均已结婚生子，现在很多小孩都不认识，除非旁边有人介绍，才顿然想起，哦，谁谁谁的孩子，似乎还有些印象。\u003c/p\u003e\u003cp\u003e\u003cimg data-src=\"http://cdn.mq-class.cn/UNADJUSTEDNONRAW_thumb_86.jpg\" alt=\"照片提供：朋友圈\"/\u003e\u003cbr/\u003e（照片提供：朋友圈）\u003c/p\u003e\u003cp\u003e乡村的婚礼永远都是这么简陋，没有珠光宝气的殿堂。来参加婚礼的也只是亲戚朋友和附近的一些家户人。上一辈人在守护着祖祖辈辈沿袭下来的这种婚姻传统，然而，传统也在不断被改变。到结婚年龄的男男女女在父母和乡亲的操办下按传统去履行一道道手续，然后或中途退出，或白头偕老。婚后，又如何呢？\u003cbr/\u003e我感到了外面物质文明的发展给这个村落的生活带来的巨大冲击和变化。\u003cbr/\u003e村落的文化已经慢慢开始出现了断层。也许是我不了解前人们的生活，我所感知的是村落按照祖辈流传的习俗按部就班的繁衍后代，而到了我们这一代，什么都变了……\u003c/p\u003e\u003cp\u003e《百年孤独》的那个村落，由于没有外界的交流，所以村落繁衍到了第7代开始出现怪圈，人开始变得畸形。\u003c/p\u003e\u003cp\u003e这部小说大致是说孤僻的文化不会保持长久的生命力，要勇于和外界交流。\u003c/p\u003e\u003cp\u003e闪婚闪离已经波及到了这个村庄，永结同心也不过是个美好的愿望。\u003c/p\u003e\u003cp\u003e婚姻对于我们这一代，已经显得没有那么神圣。\u003c/p\u003e\u003cp\u003e\u003cimg data-src=\"http://cdn.mq-class.cn/UNADJUSTEDNONRAW_thumb_71.jpg\" alt=\"照片提供：朋友圈\"/\u003e\u003cbr/\u003e（照片提供：朋友圈）\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e苗的精神家园\u003cbr/\u003e读书进城的我们终日对着书本和电脑，认识世界的途径大抵是网络上的图片和文字，与人交流的方式大部分也变成了文字交流。\u003cbr/\u003e我们的意识逐渐变得理想化，当看到现实的时候又是什么呢？\u003cbr/\u003e每个人都在谈论如何买房买车，如何成功云云。城市那么拥挤，为什么我们非要进驻？\u003cbr/\u003e该老去的人都老去，甚至离去；该长大的已经长大，新的一代开始萌发。\u003cbr/\u003e时过事迁，万象更迭，有些事物一去不复返，永远都留不住。\u003cbr/\u003e散不尽的是那些历历在目的回忆。\u003cbr/\u003e为孩提时代的那些人，那些事已不在存在而伤感落泪。\u003cbr/\u003e有一天晚上突然大哭，怨人生太长，长得不知该如何度过。\u003cbr/\u003e朋友安慰说，该来的总会来，该去的还会走，人生就是一个过程，就是一个真实的梦。\u003cbr/\u003e鲁迅先生在一篇文章里说让年轻人不要看到月缺花残便伤感落泪，说年轻人应该去做些有意义的事情，可是有意义的事情又是什么呢？\u003c/p\u003e\u003c/blockquote\u003e\u003ch4 id=\"在这里有过梦想的耕耘，所以记忆尤深\"\u003e\u003ca href=\"#在这里有过梦想的耕耘，所以记忆尤深\" class=\"headerlink\" title=\"在这里有过梦想的耕耘，所以记忆尤深\"\u003e\u003c/a\u003e在这里有过梦想的耕耘，所以记忆尤深\u003c/h4\u003e\u003cp\u003e内心独白\u003c/p\u003e\u003cp\u003e\u003cimg data-src=\"http://cdn.mq-class.cn/UNADJUSTEDNONRAW_thumb_90.jpg\" alt=\"照片提供：朋友圈\"/\u003e\u003cbr/\u003e(照片提供：朋友圈）\u003c/p\u003e\u003cp\u003e也许追求让我更快乐，然后这么多年，不知道时间耗在无尽的虚幻世界中， 以至于人生失败一而再再二三的发生。\u003c/p\u003e\u003cp\u003e本质上，是没有了内在的巨大动力和一贯对自己的严格要求。\u003c/p\u003e\u003cp\u003e人，在于读书，在于思考，在于追求灵魂深处的东西。\u003c/p\u003e\u003cp\u003e人，不是行尸走肉，不是让人指使的机器或者牲畜。\u003c/p\u003e\u003cp\u003e人有自己心灵的渴望，有对精神世界的追求，有自身独特的审美观和价值观。\u003c/p\u003e\u003cblockquote class=\"blockquote-center\"\u003e\u003cp\u003e人必须面对自己内心的坦白，\u003cbr/\u003e不可用虚伪的宗教麻痹自己，\u003cbr/\u003e催眠自己\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e\u003cimg data-src=\"http://cdn.mq-class.cn/UNADJUSTEDNONRAW_thumb_59.jpg\" alt=\"照片提供：朋友圈\"/\u003e\u003cbr/\u003e（照片提供：朋友圈）\u003c/p\u003e\u003cp\u003e不管民族，血统，肤色，本质上，人，作为个体，造物主有其自身的目的。\u003cbr/\u003e而非单纯的复制，让自己成为机器螺丝钉。\u003cbr/\u003e最近在办公室，一天比一天待不下去，每天都在思考自己在这个办公室的意义，以及说服自己长期待下去的理由。然后并没有。\u003c/p\u003e\u003cp\u003e悲剧的发生是有其必然原因的。直觉敏锐的人都能够事先觉察到事情的端倪始末。\u003c/p\u003e\u003cp\u003e不匹配，是走不长的根本原因。\u003cbr/\u003e暂且让这一页翻过去，但是未来的路如何走？\u003c/p\u003e\u003cp\u003e人，不能总是按照别人的意愿，最终违背自己内心的想法。\u003cbr/\u003e经验已经让自己窒息很久，只有自己才知道自己的口味。\u003c/p\u003e\u003cp\u003e本质上的东西无法接受，不是用理论说服就能够表面上的顺从。 宗教，太偏激或者极端。\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e迷上了音乐，迷上了看书。这些让我快乐，从内心深处快乐。何乐而不为？\u003c/p\u003e\u003c/blockquote\u003e\u003cblockquote\u003e\u003cp\u003e迷上了翻译，迷上了与人打交道，善良和理性是我的筹码。何乐而不为？\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e太喜欢写作，太喜欢追求。如果这件事情让你心情愉悦到极致，何乐而不为？\u003cbr/\u003e认知，也许只有读书，读好书，可以让你胜过如此垃圾让人愤慨的世界。 世界，永远都不缺失败者，自怨自艾者。\u003c/p\u003e\u003ch4 id=\"见贤思齐\"\u003e\u003ca href=\"#见贤思齐\" class=\"headerlink\" title=\"见贤思齐\"\u003e\u003c/a\u003e见贤思齐\u003c/h4\u003e\u003cp\u003e\u003cimg data-src=\"http://cdn.mq-class.cn/UNADJUSTEDNONRAW_thumb_5.jpg\" alt=\"照片提供：朋友圈\"/\u003e\u003cbr/\u003e（照片提供：朋友圈）\u003c/p\u003e\u003cp\u003e金钱只是地上提供便利的途径之一，人的追求，不仅仅在于金钱，而是在于更加深刻的东西，至少对我自己而言。金钱不能说明什么。\u003c/p\u003e\u003cp\u003e人要达到一个目的，真心需要坚持，并且不为外界动摇。 人的基本素质，并非基督教就能全部覆盖或者解释。\u003c/p\u003e\u003cp\u003e世间存在的诸多东西，不仅仅是宗教，都可以给身心带来巨大的放松和愉悦。\u003cbr/\u003e回了一趟华科，走了熟悉的东校区，俞园，西校区，中心操场，一切那么熟悉。\u003cbr/\u003e在西十二，听到老师的讲课，全英文授课，感叹长江后浪推前浪。\u003cbr/\u003e每次回到校园的感觉都不一样。毕业后，第一次，2008年10月，院里庆祝建立10周年，可喜可贺。\u003c/p\u003e\u003cp\u003e只可惜回去被当了广告宣传语，毕竟10年进去一个北京大学，确实不容易。\u003c/p\u003e\u003cp\u003e然后那个时候单纯，性格甚是偏激，抑或带有浪漫主义色彩，以至不够面对世俗，在全国高等学府，迷失方向。迫于外在的压力，以及桃色事件实在分心，于是荒废度日。\u003c/p\u003e\u003cp\u003e2009年再次返回母校，整个人云里雾里，精神恍惚不定。2010年，人生继续走下坡路。2012年，还是灰色心情。\u003c/p\u003e\u003cp\u003e整个人却是异常轻松。身边的这个男人给我甚是安定的感觉，珍惜相处的时光，然后理性控制情感，毕竟人各有志，在地上都是过旅客的生活。\u003c/p\u003e\u003ch4 id=\"寻找真实的自我\"\u003e\u003ca href=\"#寻找真实的自我\" class=\"headerlink\" title=\"寻找真实的自我\"\u003e\u003c/a\u003e寻找真实的自我\u003c/h4\u003e\u003cp\u003e\u003cimg data-src=\"http://cdn.mq-class.cn/UNADJUSTEDNONRAW_thumb_8e.jpg\" alt=\"照片提供：朋友圈\"/\u003e\u003cbr/\u003e（照片提供：朋友圈）\u003c/p\u003e\u003cp\u003e最近，工作闲暇不堪，大量时间浪费在看自己的书上，确是深感快乐。交了一些朋友，校友，心都甚是真诚。\u003cbr/\u003e鄙人最厌恶失信之辈，自以为是之辈，龌蹉之辈。每天在办公室思考工作的意义，以及身边同事的厌恶。最后疲惫的预感，很快回离开这家公司。\u003c/p\u003e\u003cp\u003e其实每一件事情都在预料之中。没有给内心带来愉快，彼此不适合，没有造成更大的冲突或是损失，对彼此都是好事。 也感谢这件事的发生。\u003c/p\u003e\u003cp\u003e很难找到能够情投意合的人，人生苦短，为何不去追求灵魂深处的快乐，肉体其次。\u003c/p\u003e\u003cp\u003e音乐让人震撼，文学让人心灵得到升华或启迪。\u003c/p\u003e\u003cp\u003e宗教形式化，一味的催眠。 长时间外在环境的污染，整个人因此崩溃。\u003c/p\u003e\u003cp\u003e人具有求生本能，追求快乐的本能，如果用制度来压抑，那么此生枉费。\u003c/p\u003e\u003cp\u003e罗素对基督教和人生的分析，让我重新思考目前走的路。\u003c/p\u003e\u003cp\u003e不仅仅再次去选择谋生的道路，乃是如何去实现自我价值，追求梦寐以求的快乐。\u003c/p\u003e\u003cp\u003e如果连最基本的追求都被宗教贬为世界，那么此宗教也是泯灭人性的，因为实在无法接受此理论或是说法。\u003c/p\u003e\u003cp\u003e\u003cimg data-src=\"http://cdn.mq-class.cn/UNADJUSTEDNONRAW_thumb_9c.jpg\" alt=\"照片提供：朋友圈\"/\u003e\u003cbr/\u003e（照片提供：朋友圈）\u003c/p\u003e\u003cp\u003e人不可能丧失最基本的判断力，以及最基本的本能。\u003cbr/\u003e如果这一点都要被教义否定的话，那么人的话也不过是屁话鬼话。\u003c/p\u003e\u003cp\u003e人和人之间的不同，体现在追求的东西不同。\u003c/p\u003e\u003cp\u003e也许父母从小给我提供了比较优越的环境，所以童年基本上没有受到过挫折。\u003c/p\u003e\u003cp\u003e初中，人生观的巨变， 高中甚是压抑。\u003c/p\u003e\u003cp\u003e于是大学疯狂的看书，疯狂的逃避现实。\u003c/p\u003e\u003cp\u003e然而，经历了这么多，又怎样。\u003c/p\u003e\u003cp\u003e身边多了很多朋友，一同支持。\u003c/p\u003e\u003cp\u003e但是，古老的法则，在中国不会失效，比如骄兵必败。\u003c/p\u003e\u003cp\u003e\u003cimg data-src=\"http://cdn.mq-class.cn/UNADJUSTEDNONRAW_thumb_7d.jpg\" alt=\"照片提供：朋友圈\"/\u003e\u003cbr/\u003e（照片提供：朋友圈）\u003c/p\u003e\u003cp\u003e拜读完周作人的作品。文风依旧朴素，淡雅。\u003cbr/\u003e确实现在的北大无法跟当年的北大相比。\u003c/p\u003e\u003cp\u003e做研究，无非是给老板打工，自我主张不得很好的释放，条条框框限制灵性。那几年，人真的被打击的不行。\u003c/p\u003e\u003cp\u003e而后，靠着弟兄们的英文祷告，才一点点变得开朗很多。\u003c/p\u003e\u003cp\u003e文化给人的束缚，体现在人生的诸多经历中。\u003c/p\u003e\u003cp\u003e过早的思考这些问题，只能百思不得其解，然后又反复追求这些东西。\u003c/p\u003e\u003cp\u003e现在可以大量的时间去理性的面对这些。 其实，或成功或失败，只有自己心里清楚。\u003c/p\u003e\u003cp\u003e外在人看来光鲜，也许不是自己内心的追求。\u003c/p\u003e\u003cp\u003e可能外在人追求的也许只是凡夫俗子追求的一箪一瓢。\u003c/p\u003e\u003cp\u003e搞不懂为什么网上那么多低俗的东西，居然还有观众去欣赏去鼓掌。\u003c/p\u003e\u003cp\u003e回归原始，回归朴实。\u003c/p\u003e\u003cp\u003e\u003cimg data-src=\"http://cdn.mq-class.cn/UNADJUSTEDNONRAW_thumb_8b.jpg\" alt=\"照片提供：朋友圈\"/\u003e\u003cbr/\u003e（照片提供：朋友圈）\u003c/p\u003e\u003cp\u003e冬日初雪，朋友圈都晒起下雪的图片。\u003c/p\u003e\u003cp\u003e今天早起，父亲开着他心爱的电车送我去车站。途中给我买了早餐，并在上车前给我塞了一笔钱，我不忍心拒绝，也就好心收下。\u003c/p\u003e\u003cp\u003e这笔钱对彼此来说都不是什么大数，只是他对我平日给母亲买东西的谢意。投之以桃报之以礼。 这几天在家，异常的开心，久违的在家待的感觉，一切还是很熟悉。\u003c/p\u003e\u003cp\u003e楼下麻将桌增加了几个，楼上卫生间换成现代式的马桶式。\u003c/p\u003e\u003cp\u003e家具都还在，父母安好。\u003c/p\u003e\u003cp\u003e上次在家还是陪襁褓婴儿，而后婚姻不幸，多次不得回家，当初闹事凶凶，如今都归于平静。逝者灵位仍摆在故人卧室，对之表示愧疚，思之潸然落泪。 最近脱离了一直所在的教会，屏蔽了一些不负责任的教友。如果耶和华真的存在，特毕竟会尊重我内心的想法，而不是用空洞的理论成规模的去给我洗脑。\u003c/p\u003e\u003cp\u003e\u003cimg data-src=\"http://cdn.mq-class.cn/UNADJUSTEDNONRAW_thumb_15.jpg\" alt=\"照片提供：朋友圈\"/\u003e\u003cbr/\u003e（照片提供：朋友圈）\u003c/p\u003e\u003cp\u003e回归回家感受，家乡变化算大也不算太大，终于不用带着负罪般的心情回家，家人对我做的不理智的决定（被迫而已）已经赦免，并且求得当地算命机构，娓娓道出真相。\u003c/p\u003e\u003cp\u003e文字可以洗涤心灵，可以调节心情，可以缕清思绪，可以整理情绪。\u003c/p\u003e\u003cp\u003e诚然，每次都以胜利者的姿态回家，因为一直用汗水在努力，尽中华之孝道。\u003c/p\u003e\u003cp\u003e虽然旅居东瀛，客经美帝，还是偏好中国文化，难怪民国留学大师们都对中国美景美食传统赞叹有加，鲁迅除外。他们笔下的中国（五四除外），都刻画出令人向往的中国，也许只是他们精神世界的折射。\u003c/p\u003e\u003cp\u003e\u003cimg data-src=\"http://cdn.mq-class.cn/UNADJUSTEDNONRAW_thumb_11.jpg\" alt=\"照片提供：朋友圈\"/\u003e\u003cbr/\u003e（照片提供：朋友圈）\u003c/p\u003e\u003cp\u003e对中国文化，越发热爱，发自内心，肺腑。 被束缚了手脚，所以这几年没有飞得更高。每天刷朋友圈的人，足以见得这些人是何无聊。\u003cbr/\u003e中国的务实精神，体现在哪怕穷途末路，都可以让一个从棺材走过的人站起来。 要是我是治国者，我不愿意在宗教方面投入太多，毕竟任何宗教进入中国，必须和中国文化结合，才能为中国所用。\u003c/p\u003e\u003cp\u003e由于研究的东西太理论，太学术，所以我没有以功利心的思想念完博士，也没什么后悔可言，尊重自己选择。 回想起身边众多成功者，他们并非圣徒，如果神爱世人，那么他必爱土地上每一个儿女。\u003c/p\u003e\u003cp\u003e打算脱离宗教组织，脱离与我内心不匹配的人事物。\u003c/p\u003e\u003ch4 id=\"灵魂深处的感动\"\u003e\u003ca href=\"#灵魂深处的感动\" class=\"headerlink\" title=\"灵魂深处的感动\"\u003e\u003c/a\u003e灵魂深处的感动\u003c/h4\u003e\u003cp\u003e\u003cimg data-src=\"http://cdn.mq-class.cn/UNADJUSTEDNONRAW_thumb_17.jpg\" alt=\"照片提供：朋友圈\"/\u003e\u003cbr/\u003e（照片提供：朋友圈）\u003c/p\u003e\u003cp\u003e人灵魂里面的感动，引起共鸣的东西，需要同一振幅的人才能满足。\u003cbr/\u003e喜欢旧约，而不喜欢基督教，喜欢读书，而不喜欢读书社团。\u003c/p\u003e\u003cp\u003e今日遇得一女子，大眼，长发，颇有自己的主张。同一趟车，甚至旅友。\u003c/p\u003e\u003cp\u003e经商，入世几年，也见得当地世面。内心比较诚实，也比较明事理，无世俗之气，中而正。 古人很多话特别有道理，择良友而交，看来交友也需要筛选，识人也需要慧眼，并非以地域性来判断，乃是以品以德。\u003c/p\u003e\u003cp\u003e\u003cimg data-src=\"http://cdn.mq-class.cn/UNADJUSTEDNONRAW_thumb_29.jpg\" alt=\"照片提供：朋友圈\"/\u003e\u003cbr/\u003e（照片提供：朋友圈）\u003c/p\u003e\u003cp\u003e不知道为什么，内心还是充满厌恶。这么多年，无法面对家长的无尽干涉。\u003c/p\u003e\u003cp\u003e也许只有坦诚布公，才能正面面对。\u003c/p\u003e\u003cp\u003e\u003cimg data-src=\"http://cdn.mq-class.cn/2321538831861_.pic_hd.jpg\" alt=\"照片提供：朋友圈\"/\u003e\u003cbr/\u003e（照片提供：朋友圈）\u003c/p\u003e\u003cp\u003e内心做了深刻剖析，才会最大可能的放下。多年来，这种愤怒一直挟持着我，自由的方方面面的束缚。也许，婚姻有其本身的目的，顺应着生存。相比那些不幸的婚姻，我的人生算是比较幸福。毕竟人很多时候无能为力，面对被迫的无奈。只有赦免的时候，才是真正放下的时候。\u003c/p\u003e\u003cp\u003e\u003cimg data-src=\"http://cdn.mq-class.cn/2311538831732_.pic.jpg\" alt=\"照片提供：朋友圈\"/\u003e\u003cbr/\u003e（照片提供：朋友圈）\u003c/p\u003e\u003cp\u003e看着，或者听着别人的故事，自己才知道该如何面对，走正确的道路。多听，多看，多交流，带来的不仅仅是思想的碰撞，更是智慧的开启。而非真的去深山庙宇去修行。\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e苦难中，并非你一人在独行。\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e虽然本质上都是限制了内心无比的自由，从别人的真实的人生故事，能够学到什么？\u003c/p\u003e\u003cp\u003e过着如梦似幻的生活，偶然被人间烟火打得粉碎，从而选择离家出走。若换个女子，觉得对父亲是一种报恩，尽孝。\u003c/p\u003e\u003cp\u003e\u003cimg data-src=\"http://cdn.mq-class.cn/UNADJUSTEDNONRAW_thumb_55.jpg\" alt=\"照片提供：朋友圈\"/\u003e\u003cbr/\u003e（照片提供：朋友圈）\u003c/p\u003e\u003cp\u003e冬的夜晚永远这么安静。\u003c/p\u003e\u003cp\u003e窗外凌凌落落飘着雪花，枝头没有知了的鸣笛，四下也没有蝉儿们的轻唱。街头没有行人的脚步，深巷的狗儿们也停止了吠声。\u003c/p\u003e\u003cp\u003e冬适合眠，整个苍穹之下只有睡眠的气息。\u003c/p\u003e\u003cp\u003e静静地，一切这么静谧，如同熟睡的婴儿，偶尔会悄悄伸个懒腰。\u003c/p\u003e\u003cp\u003e天空似墨，地蛰伏在祂面前。\u003c/p\u003e\u003cp\u003e出了九后，绿便会蔓延开来。\u003c/p\u003e\u003ch4 id=\"想大声对着世界说-”NO-”\"\u003e\u003ca href=\"#想大声对着世界说-”NO-”\" class=\"headerlink\" title=\"想大声对着世界说:”NO!”\"\u003e\u003c/a\u003e想大声对着世界说:”NO!”\u003c/h4\u003e\u003cp\u003e\u003cimg data-src=\"http://cdn.mq-class.cn/UNADJUSTEDNONRAW_thumb_46.jpg\" alt=\"照片提供：朋友圈\"/\u003e\u003cbr/\u003e（照片提供：朋友圈）\u003c/p\u003e\u003cblockquote class=\"blockquote-center\"\u003e\u003cp\u003e庚寅之春\u003c/p\u003e\u003cp\u003e东瀛樱下\u003c/p\u003e\u003cp\u003e遇故土青年。\u003c/p\u003e\u003cp\u003e攀谈数时 深感青年拳拳爱国之心。\u003c/p\u003e\u003cp\u003e青年逐一列举古往今来天下大事\u003c/p\u003e\u003cp\u003e上至华夏祖先，下至清、民\u003c/p\u003e\u003cp\u003e五千文明 底蕴厚实 提及孔老 双眸煌煌\u003c/p\u003e\u003cp\u003e叹五千精髓于当朝衰落\u003c/p\u003e\u003cp\u003e谈故土现状 痛心不已\u003c/p\u003e\u003cp\u003e浑身热血欲发 责同胞昧、惑\u003c/p\u003e\u003cp\u003e观四下\u003c/p\u003e\u003cp\u003e扶桑之民 彬彬厚礼\u003c/p\u003e\u003cp\u003e扶桑社会 秩序整然\u003c/p\u003e\u003cp\u003e怒赞\u003c/p\u003e\u003cp\u003e再观故邦 沸沸扬扬 乌气挡朝之日\u003c/p\u003e\u003cp\u003e余问 君欲遂何\u003c/p\u003e\u003cp\u003e答曰 兴教育 举圣人之道 弘扬四海\u003c/p\u003e\u003cp\u003e余喜 国之后继有人 国之后生可畏\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e\u003cimg data-src=\"http://cdn.mq-class.cn/UNADJUSTEDNONRAW_thumb_58.jpg\" alt=\"照片提供：朋友圈\"/\u003e\u003cbr/\u003e（照片提供：朋友圈）\u003c/p\u003e\u003cp\u003e这里没有巫山，有着自己独特的水，山，云。\u003cbr/\u003e水，不是流水，是一面人造湖，湖畔用细碎的小石头玲珑地围砌。风如发丝般掠过水面，画出旖旎水纹。\u003cbr/\u003e连绵山脉如骆驼之峰，嗡嗡郁郁的原始松柏一层层，波浪般匍匐于山面。\u003cbr/\u003e云，最爱这里的云。岛国四面环海，湿气很重，故云多，且变幻莫测。\u003c/p\u003e\u003cp\u003e东边，干净而湛蓝的天空中缓缓走动的是卷状云，白的发亮，一尘不染。\u003c/p\u003e\u003cp\u003e西边，乌云浓且重且低，有如夏日傍晚之时暴风骤雨的前兆。\u003cbr/\u003e地球旋转，带着云渐渐向东。 「静谧，和煦。」\u003c/p\u003e\u003cp\u003e\u003cimg data-src=\"http://cdn.mq-class.cn/2271538831695_.pic.jpg\" alt=\"照片提供：朋友圈\"/\u003e\u003cbr/\u003e（照片提供：朋友圈）\u003c/p\u003e\u003cp\u003e经过一片玻璃橱窗，看到窗外淡淡的阳光，不耀眼，也感觉不到外面的寒意，有种很释放的感觉。\u003cbr/\u003e橱窗有两层，都是落地的，中间隔着平台。\u003cbr/\u003e听一位建筑系的朋友说这种风格在上个世纪九十年代流行于美国，不管怎么说，眼前这个风景的设计者想必当时设计的初衷也是为了留住窗外的一切。\u003c/p\u003e\u003cp\u003e\u003cimg data-src=\"http://cdn.mq-class.cn/UNADJUSTEDNONRAW_thumb_57.jpg\" alt=\"照片提供：朋友圈\"/\u003e\u003cbr/\u003e（照片提供：朋友圈）\u003c/p\u003e\u003cp\u003e阳光，整个下午都没有变过。\u003cbr/\u003e苍柏，或是苍松，叶尖微微变黄，树的外一层仿佛淡淡蘸了些许粉末。\u003cbr/\u003e从不拥挤的道路两侧种着不知名的绿树，偶尔叶尖泛红。\u003cbr/\u003e落地窗很宽，脚下摆着室内盆栽。过道旁是舒适的咖啡沙发桌椅，宁静的这儿很少有人经过。\u003cbr/\u003e喜欢安详，不悲秋，秋喜秋静！\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e※如有侵权，照片请联系作者删除，文字均为原创！\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e",
  "Date": "2018-10-11T01:02:05Z",
  "Author": "J. F"
}