{
  "Source": "blog.zzbd.org",
  "Title": "我是猫（7） 第七章",
  "Link": "https://blog.zzbd.org/2018/10/15/cat-story-7/",
  "Content": "\u003cdiv class=\"post-body\" itemprop=\"articleBody\"\u003e\u003ch2 id=\"第七章-爱的相互\"\u003e\u003ca href=\"#第七章-爱的相互\" class=\"headerlink\" title=\"第七章 爱的相互\"\u003e\u003c/a\u003e第七章 爱的相互\u003c/h2\u003e\u003cp\u003e\u003cimg data-src=\"http://pgf2p534g.bkt.clouddn.com/31539588141_.pic.jpg\" alt=\"此处输入图片的描述\"/\u003e\u003c/p\u003e\u003ch3 id=\"（一）趁修理逃出家门\"\u003e\u003ca href=\"#（一）趁修理逃出家门\" class=\"headerlink\" title=\"（一）趁修理逃出家门\"\u003e\u003c/a\u003e（一）趁修理逃出家门\u003c/h3\u003e\u003cp\u003e女主人家的热水器坏了，洗衣机坏了， 厨房的煤气灶坏了，厨房做饭的也坏了。\u003c/p\u003e\u003cp\u003e同住的人，叫了保修的师傅，顺便找了借口，说：\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e“洗衣机我也不用，你来处理吧”。\u003c/p\u003e\u003c/blockquote\u003e\u003cspan id=\"more\"\u003e\u003c/span\u003e\u003cp\u003e临近中午时分，修理的师傅进来了，门没有关，于是我趁机跑出去。\u003c/p\u003e\u003cp\u003e快到冬天了，天气灰蒙蒙的，没有阳光，也没有暖意。周末的人们没有出行，窝在家里，所以家家户户飘出来做饭的香味。\u003c/p\u003e\u003cp\u003e一出来我就想回去了。但是目前家里什么都没有，厨房只有女主人扔掉的鸡蛋壳让我能够唯一有点胃口。我的陶瓷盘中，还剩下前几天女主人精心用各种香料卤制的瘦肉五花肉，好大一盘，纯肉的，享受了几天的美味。但是总是饥一顿饱一顿，大鱼大肉之后又不得不面对几天的饥荒。\u003c/p\u003e\u003ch3 id=\"（二）百草园郊游\"\u003e\u003ca href=\"#（二）百草园郊游\" class=\"headerlink\" title=\"（二）百草园郊游\"\u003e\u003c/a\u003e（二）百草园郊游\u003c/h3\u003e\u003cp\u003e女主人突然下楼了，朝着小区旁边的林荫小道走过来。一般去购物的时候，她喜欢走着路，因为没有多少行人。小道长满了各种各种的植物，无花果，夜来香，木槿，月季，还有大树。\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e这条路纯天然，路径是人们用脚步刻画出来的，大概长半公里，我随着女主人的脚步，一路雀跃。\u003cbr/\u003e有时候，我会飞快的从她背后冲到前面去，不小心绊过她的双腿；\u003cbr/\u003e有时候，我又窜到丛林中，在里面嗅嗅气味，看看有没有新发现；\u003cbr/\u003e有时候我会矫捷地爬到树上，树太粗，我双手双脚抱着，悬挂在那里。\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e有时候我也是捣蛋鬼。\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e去惹了别人家的狗，偶尔捞一下就飞快的爬到树上，惹得被拴住的家狗不停的冲我叫唤。狗叫的时间太长，导致它的男主人会探头出来，看看究竟发生了什么。而这个时候，我的女主人会极其不情愿的把我从远处的树上揪下来抱我回去，并跟别人很难为情的道歉。\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e当我驻足不前的时候，女主人会停下来叫我，因为她怕我迷路。但是到了丛林的尽头，她要走出小区的时候，她又回过头来，赶我回去，怕我找不到回家的路，或者怕我被外人抱走，我只得在分别的地方等待，要么是车空下，要么是丛林间。\u003c/p\u003e\u003cp\u003e好几次，我都会在分别的地方等她回来，少则5到10分钟，多则一整天。有时候天黑的时候，女主人才回来，回到家看我不在，又出来小区门口接我，因为她知道，我不认识回去的路。\u003c/p\u003e\u003ch3 id=\"（三）-离家出走\"\u003e\u003ca href=\"#（三）-离家出走\" class=\"headerlink\" title=\"（三） 离家出走\"\u003e\u003c/a\u003e（三） 离家出走\u003c/h3\u003e\u003cp\u003e我不在的日子，主人一定很难过吧。\u003c/p\u003e\u003cp\u003e我越长越壮，感觉快从一个少女变成女性。渴望社交，渴望去寻找更多的朋友。\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e猫三村\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e古老的谚语说，猫要跑出去3个村子，说明我们猫类也需要自己的活动空间。\u003c/p\u003e\u003cp\u003e那些被主人用笼子圈养的同类是多么的可怕。\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e娇生惯养的猫类狗类，整日依赖它们的主人，吃昂贵的加工制造出来的饼干，特奴性的舔舐它们的主人，而失去了自己的纯真性情。\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e去哪里了，其实我也不记得了。总之，消失了一个夜晚，我的女主人应该找我很久吧。听说凌晨3点多，女主人想下楼找我，估计夜里寒气逼人，她没有出来。没我的日子，是不是她的失眠会更加加重。\u003c/p\u003e\u003ch3 id=\"（四）-小别胜新\"\u003e\u003ca href=\"#（四）-小别胜新\" class=\"headerlink\" title=\"（四） 小别胜新\"\u003e\u003c/a\u003e（四） 小别胜新\u003c/h3\u003e\u003cp\u003e女主人在家独居，三顿饭出来透气，偶尔也会上午10点多，下午3-4点出来。今天同往常一样，老远看到她，我就大步流星的跑过去，她也不问我昨晚去哪里了，直接抱起我，又是亲又是吻，很是欢乐。\u003c/p\u003e\u003cp\u003e随即她便把我抱到曾经拴住我的老太太的庭院里，论抚养权，我已经划分给了老太太。但是院子太憋屈，我从迅速跳出来，远远追上渐行渐远的女主人。\u003c/p\u003e\u003cp\u003e她会在楼梯口等我，看不到我的身影时，她会蹲下来叫我。殊不知回过头，我就从她右手边跳出来。躲猫猫的天性依然未改。\u003c/p\u003e\u003cp\u003e已经习惯性的地到达3楼，门开着，我比女主人抢先一步跳进屋里，这是我们俩的屋。\u003c/p\u003e\u003cp\u003e望见我的盘里食物没有更新，我又回头，故意抬起头，用撒娇的声音央求我的女主人。\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e 会叫的孩子有奶吃。\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e女主人家里快枪尽粮绝，所以我不得不吃昨天剩下的饭。饭的种类比宠物猫宠物狗的品类要繁盛很多，我尝到香蕉，火腿，红薯，番茄，鸡蛋，鸡腿，鸭掌，猪肉，酸菜鱼，鸡蛋，五花八门，这些可比宠物猫们的食物营养多元化。\u003c/p\u003e\u003cp\u003e饭后，我依然跑到女主人的房间，在琴凳上磨爪子，然后跳到阳光普照的阳台上伸懒腰休息。\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e你爱我的日子， 我也爱你！\u003c/p\u003e\u003c/blockquote\u003e\u003c/div\u003e",
  "Date": "2018-10-15T02:46:28Z",
  "Author": "J. F"
}