{
  "Source": "blog.zzbd.org",
  "Title": "我是猫（2）",
  "Link": "https://blog.zzbd.org/2018/10/11/caty-story2/",
  "Content": "\u003cdiv class=\"post-body\" itemprop=\"articleBody\"\u003e\u003ch3 id=\"第二章-三代主人\"\u003e\u003ca href=\"#第二章-三代主人\" class=\"headerlink\" title=\"第二章  三代主人\"\u003e\u003c/a\u003e第二章 三代主人\u003c/h3\u003e\u003chr/\u003e\u003ch3 id=\"遥望远方，活在当下\"\u003e\u003ca href=\"#遥望远方，活在当下\" class=\"headerlink\" title=\"遥望远方，活在当下\"\u003e\u003c/a\u003e遥望远方，活在当下\u003c/h3\u003e\u003cp\u003e\u003cimg data-src=\"http://pgf2p534g.bkt.clouddn.com/IMG_5787.jpg\" alt=\"必须在路上\"/\u003e未来在哪里？ 其实自己也不知道。\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e享受当下，活在当下一直是自己的处事原则吧。\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e毕竟主人每天对自己宠爱有加，附近的阿姨时不时做了新鲜的鱼，亲自端过来，被几个人同时宠着，没有太多忧虑烦恼。\u003c/p\u003e\u003cspan id=\"more\"\u003e\u003c/span\u003e\u003chr/\u003e\u003ch3 id=\"三代人之老太太\"\u003e\u003ca href=\"#三代人之老太太\" class=\"headerlink\" title=\"三代人之老太太\"\u003e\u003c/a\u003e三代人之老太太\u003c/h3\u003e\u003cp\u003e照顾我的老太太，49年出生，老上海人，普通话不标准。老太太总觉得我的本职工作是\u003cstrong\u003e抓老鼠\u003c/strong\u003e，所以经常用它长期劳作的手指\u003cstrong\u003e打\u003c/strong\u003e我，还经常用绳子将我拴住。\u003c/p\u003e\u003cp\u003e那绳子之前听说是给她家狗狗拴出的，长2米不到。当我的脖子上被拴住的时候，我的活动范围仅限于我的饭碗和我的猫砂盆。\u003c/p\u003e\u003cp\u003e当然老太太也为我考虑，给我安置了比较抗冻的窝儿。白天可以晒太阳，躲风雨，晚上可以防止敌人入侵。\u003c/p\u003e\u003cp\u003e但是我不怎么喜欢待在这个不自由的地方，有时候为了逃脱，我努力的\u003cbr/\u003e绕着柱子几圈，最后脖子的绳子越远越短，我的活动范围就越来越少。\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e被拴住一天，我就渴望逃脱一天….\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e老太太似乎很有经验，她知道我每天早上6点要上厕所的习惯，并把这个习惯跟我的女主人讲，当我去女主人家过夜的时候，她会反复叮嘱女主人一定要早上6点前把我送回来。\u003c/p\u003e\u003cp\u003e老太太的老伴心也很好，知道我和女主人之前有深厚的感情，总是提醒她把我送回去。\u003cbr/\u003e经常听到他责备老太太说：\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e人家都有感情了，你干嘛把猫留着，不送给人家。\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e老太太的儿子偶尔也会回来，这么责怪她。没办法，谁让她是收留我的第一个主人呢。\u003c/p\u003e\u003chr/\u003e\u003ch3 id=\"三代人之女主人\"\u003e\u003ca href=\"#三代人之女主人\" class=\"headerlink\" title=\"三代人之女主人\"\u003e\u003c/a\u003e三代人之女主人\u003c/h3\u003e\u003ch4 id=\"（一）初夏邂逅\"\u003e\u003ca href=\"#（一）初夏邂逅\" class=\"headerlink\" title=\"（一）初夏邂逅\"\u003e\u003c/a\u003e（一）初夏邂逅\u003c/h4\u003e\u003cp\u003e三个月前，那个时候还没有到夏天，我喜欢在附近的车轮下面窜来窜去。偶尔也会有别的猫儿过来耍。\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e附近有树，青草地，所以这里是我的天堂。\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e然而一个下午，我正在耍，不经意间，我被一个女人的双手抱住了， 随后她便把我捧在胸口。一瞬间，好温暖。\u003c/p\u003e\u003cp\u003e我被带到她的住处，那个时候还小，估计我才3个月不到，不记得当时她给我吃什么了，好像当晚我便尝到了超级美味的鱼，每天一条。\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e新的环境，总是充满新鲜和刺激。\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e小小的我，在她的双手中，被她视为珍宝。夏天还有点小冷，被迫的洗澡，然而我很乖很乖，努力配合她的精心照料。\u003c/p\u003e\u003cp\u003e热水沐浴后，我居然进了她的卧室。好大一个熊为我准备。我太冷了，空调还开着，于是打了一个喷嚏，女主人也吓到了，瞬间把空调关了。\u003c/p\u003e\u003cp\u003e我躺在她的大熊上，期待自己的毛发快干。女主人不停的闻我身上的气味，在她看来是\u003cstrong\u003e淡淡的清香。\u003c/strong\u003e\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e那晚，我便和女主人睡着一个屋子了。一睡，就是3个月。\u003c/p\u003e\u003c/blockquote\u003e\u003ch4 id=\"（二）初生牛犊不怕虎\"\u003e\u003ca href=\"#（二）初生牛犊不怕虎\" class=\"headerlink\" title=\"（二）初生牛犊不怕虎\"\u003e\u003c/a\u003e（二）初生牛犊不怕虎\u003c/h4\u003e\u003cp\u003e清晨，我会顺着阳台爬出去，张望初升的太阳。每天的日光是如此清新。\u003c/p\u003e\u003cp\u003e随后，我便爬到女主人熟睡的枕边。阳光晒在她睡熟的脸上，用我的哲学来讲，早起的鸟儿有虫吃，于是我会用我满有爱的嘴唇将她亲醒。很多时候，女主人睁开眼睛，马上把我推开。\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e她无法接受我的初吻。\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e女主人加有台琴，也有其他庞大的乐器。初来乍到的我对什么都保持新鲜，于是我会在她的房间窜来窜去，都留下自己的气息。\u003c/p\u003e\u003cp\u003e她的衣柜，我任意的去用我的幼嫩的爪子扒开，进去偷窥女主人的隐私。\u003c/p\u003e\u003cp\u003e她的白色黑色相间的琴键，我会从低音符粗暴地到高音符，再从高音符优雅的走到低音符。\u003c/p\u003e\u003cp\u003e有时候凌晨4点，不小心爬到她的琴键上，女主人突然从梦中惊醒，急忙过来琴键电源拔掉，把我一把抱住，虏进她的被子。\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e深夜不属于我，我也不属于深夜\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e于是我和其他的猫不一样，陪我的女主人继续睡。但是我不喜欢睡在她身边，喜欢选择床尾，因为我的活动空间会更大。\u003c/p\u003e\u003ch4 id=\"（三）日久生情\"\u003e\u003ca href=\"#（三）日久生情\" class=\"headerlink\" title=\"（三）日久生情\"\u003e\u003c/a\u003e（三）日久生情\u003c/h4\u003e\u003cp\u003e随着在女主人家待的时间越长，属于我的家居用品越来越多。我被添置了专业的猫厕所，绿茶味的猫砂。我的猫粮也到位，还配置了沙丁鱼酱和火腿。\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e整日无忧无虑，无比悠闲。女主人周末不在家，于是一个人可以享受更多的自由。\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e我的身躯日益结实。\u003c/p\u003e\u003cp\u003e隔壁屋是一对情侣，跟他们不熟。有时候，我尝试纵身一跃，居然一口气跳到隔壁家的阳台上，在那里一蹲就是几个小时。\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e望着天空，望着远处的绿树，望着楼下曾经一起玩耍的小伙伴们。\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e有时候我也会望着曾经对我特别好的阿姨，远处看见她，我就努力的喊叫唤起她的注意。\u003c/p\u003e\u003cp\u003e我的出奇的叫声倒是引起了我女主人的注意，她以为我看到了失散多年的老爹老妈或者其他亲人，于是顺着我的叫声往下探望。\u003c/p\u003e\u003cp\u003e她叫到：\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e是你啊！ 我还以为小猫遇到她娘了呢！\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e楼下阿姨也叫着说：\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e她认识我的，她也去过我家，在我家我给她做鱼吃。\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e看来我是一个痴情的知恩图报的种儿，爱曾经爱过我的任何一位。\u003c/p\u003e\u003chr/\u003e\u003ch3 id=\"三代人之阿姨\"\u003e\u003ca href=\"#三代人之阿姨\" class=\"headerlink\" title=\"三代人之阿姨\"\u003e\u003c/a\u003e三代人之阿姨\u003c/h3\u003e\u003cp\u003e由于我的出现，促成了女主人在这里认识了曾经收养我的老太太和对我极好的阿姨，她一向高处不胜寒的生活也开始变得有生活气息。\u003c/p\u003e\u003cp\u003e之前我爱爬树，所以阿姨的手机里存满了我爬树的照片。可能我的身姿太矫健，可能她们真的喜欢我，爬树的时候总是备受关注，虽然身为女儿身，爬树是一种本能。\u003c/p\u003e\u003cp\u003e阿姨50来岁，已退休，每天清晨爱在小区散步，和她老伴。\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e很善良的一对夫妇。\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e阿姨家在前面一栋，当我偶尔找不到吃的时候，我会跑到她家，她总是给我各种好吃的。好像和她的感情比女主人感情还深。记得她的声音。\u003c/p\u003e\u003cp\u003e我喜欢在广阔的空间无尽的奔跑，无拘无束的从百草园的这一头，跑到那一头。\u003c/p\u003e\u003cp\u003e有时，我看到散步的阿姨大老远的走过来，我像见到亲人一般，飞速跑到她脚前，享受她的抚摸。她抚摸我的头，我闭上眼睛享受这种温暖。\u003c/p\u003e\u003cp\u003e阿姨为人和善，说话也好听。\u003c/p\u003e\u003chr/\u003e\u003ch3 id=\"爱这里，祥和的一切\"\u003e\u003ca href=\"#爱这里，祥和的一切\" class=\"headerlink\" title=\"爱这里，祥和的一切\"\u003e\u003c/a\u003e爱这里，祥和的一切\u003c/h3\u003e\u003cp\u003e这里难得的清净。\u003c/p\u003e\u003cp\u003e当然我也会有敌人，一对猫爸猫妈，总是追着我赶，还好平时练就的爬树功夫总能让我躲过一劫又一劫。不止一次我被追赶，不得不爬到树上，望着树下肥胖的敌人，虎视眈眈地守着我。\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e我不敢下树，一直僵持，只能等到对方最终放弃攻击。好窝囊的自己！\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e听说这种窝囊的场面不止不一个人看到过，都去我的女主人那里告状。然而女主人不会骂我，看到我在外面受欺负的时候总是挺身而出。\u003c/p\u003e\u003cp\u003e她会将敌人赶走，然后唤我下来，轻轻跟我说：\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e “别怕，跟我回家！”\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e于是我记住了她的楼梯口，记住了她的家。虽然有时候智商也会出错认错门，但是那个熟悉的楼梯口不会忘记。\u003c/p\u003e\u003cp\u003e每当女主人拿着钥匙下楼，远远的听到她的脚步声，她拿钥匙晃动的清脆的银铃般的声音，我便闻声跑到去。\u003c/p\u003e\u003cp\u003e有时候我的判断总是出错，每当有人下楼我都去张望是不是我的女主人。但是，从那里走出来的不止一家，所以貌似这楼居住的人们都记住了我。有老人，有年轻人。\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e爱这里，难得的清净。城市一隅，生活气息浓重，花香鸟语。\u003cbr/\u003e希望我的女主人也能停止她忙碌的身躯，和我一起享受这里。\u003c/p\u003e\u003c/blockquote\u003e\u003c/div\u003e",
  "Date": "2018-10-11T08:25:34Z",
  "Author": "J. F"
}